class ElmTextDersTwo {
  static const String titleTwoOne = """
 العلم والمعرفة
-------------
""";
  static const String ayahHadithTwoOne_1 = """
 وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧ 
الأنعام 37 
""";

  static const String elmTextTwoOne_1 = """
انت مع من؟ 
اذا كان اكثرهم لا يعلمون فانت مع من ؟ مع الاكثريه ام مع الاقليه ؟
""";

  static const String ayahHadithTwoOne_2 = """
قال تعالى 
وَمَا یَتَّبِعُ أَكۡثَرُهُمۡ إِلَّا ظَنًّاۚ 
يونس 36 

قال تعالى 
وَإِن تُطِعۡ أَكۡثَرَ مَن فِی ٱلۡأَرۡضِ یُضِلُّوكَ عَن سَبِیلِ ٱللَّهِۚ
الانعام 116
""";

  static const String elmTextTwoOne_2 = """
فهل يقبل منك ان تقول هكذا شأن الناس كلهم يااخي ، وانا واحد من الناس ، هكذا التقاليد الان ، هكذا العادات ، هكذا ماتعارف عليه الناس ، هكذا نشأنا يااخي ، هكذا العادات ، هكذا التقاليد ، كل الناس مخطؤن

""";
// page 2
  static const String ayahHadithTwoTwo_1 = """
اسمع قوله تعالى 
وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧
الأنعام 37 

قال تعالى 
یَعۡلَمُونَ ظَـٰهِرࣰا مِّنَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَهُمۡ عَنِ ٱلۡءَاخِرَةِ هُمۡ غَـٰفِلُونَ ۝٧
الروم 7 
""";
  static const String elmTextTwoTwo_1 = """
 يعلمون التجاره والصناعه، والزراعه، وكسب المال وانتهاز الفرص ، واصول الحياة ، وكيف يتنعمون بها ، وكيف يشترون الاجهزه المتنوعه في البيت ، هذا كله يعرفونه ، ولكنهم يجهلون المصير ، يجهلون ساعةيوم يقوم الناس لرب العالمين ، فالعبره ان تعرف الحقيقه كلها لا ان تعرف شطرها 

  """;
// page 3
  static const String elmTextTwoThree_1 = """
قد تلتقي بدكتور يحمل شهادة بورد ، ومع ذلك لايعلم عن الاخره شيئا ، يعيش لحظته ، يعيش حياته الدنيا ، لايستطيع أن يفكر ابعد من الموت ، وكانه يضن الموت نهاية الحياه ، ولا شيئ بعد الموت ، هذا ليس علما ، هذه حرفه ، وليس علما ، العلم ان تعرف الحقيقه كلها من كل جوانبها 
""";
  static const String ayahHadithTwoThree_1 = """
قال تعالى 
 وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧
الانعام 37 
""";
  static const String elmTextTwoThree_2 = """
لذلك ايها الاخ الكريم لا تستانس اذا كان الناس جميعا في ضلال يقول لسان حالك انا مثل هؤلاء الناس

""";
// page 4
  static const String elmTextsTwoFour_1 = """
قد تجد عظماء في بيئات متخلفه ، وعلماء في بيئات جاهله ، والانسان اذا اختار شيئآ لن يقف شيئ في طريقه ، وان القرار اللذي يتخذه الانسان في شان مصيره قلما تنقضه الايام إذا كان صادرا حقا عن إراده وإيمان

""";

  static const String elmTextTwoFour_2 = """
إنك إذا اردت ان تكون مستقيما في هذا الزمان كنت كذلك ، وكلمة لا استطيع كلمه مضحكه ، لانك قد تفعل اشياء اخرى تبدو مستحيله ، ولكنك بتصميمك عليها فعلتها ، ولو انك صممت على ان تكون مستقيمآ لبلغت الاستقامه ، لو صممت على ان تعرف كتاب الله لعرفته ، لو صممت على ان تصلي قيام الليل لصليته

  """;

  static const String elmTextTwoFour_3 = """
هذا اللذي لا يعرف إلا الطعام والشراب وكسب المال والإنغماس في الشهوات هذا ميت 
""";
  static const String ayahHadithTwoFour_1 = """

قال تعالى 
أَمۡوَ ٰتٌ غَیۡرُ أَحۡیَاۤءࣲۖ 
النحل 21 

""";

// page 5
  static const String elmTextTwoFive_1 = """
وهذا اللذي عرف ربه ، واحبه ، واقبل عليه ، وتقرب إليه ، وجعل حياته كلها في طاعته ، وجعل طاقاته كلها مسخره لخدمةعباده هذا الحي
 
 :لذلك يقول سيدنا علي *
  ياكميل ، مات خزان المال وهم احياء)
  والعلماء باقون مابقي الدهر 
   اعيانهم مفقوده 
    (وامثالهم في القلوب موجوده
 
 كن عالما ، او متعلما ، او مستمعا ، او محبا
ويظل المرء عالما ماطلب العلم ، فإذا ضن انه قد علم فقد جهل
""";
  static const String footerTwoFive = """
---------------------
 نهج البلاغة المنسوب الى سيدنا علي*
""";

// page 6
  static const String elmTextTwoSix_1 = """
الحياة متعبه ، فيها مزالق وفيها مواقف حرجه  وفيها متاهات ، فيها ظنون ، وفيها فساد ، فإن لم يعتصم الإنسان بالإيمان الصحيح فسوف يضيع مع الناس ، سوف تنزلق قدمه ، سوف تزل قدمه ، وتهوي به في مكان سحيق
""";

  static const String elmTextTowSix_2 = """

وبالعلم لاتبقى لدى المؤمن وسوسه ، ولا هم ، ولا حزن ، ولا ضيق ، ولا قلق ، ولا يأس ، ولا شيء من هذا القبيل ، هذا التمزق الداخلي ، انفصام الشخصيه ، الخور ، الضعف ، الخنوع ، هذه الامراض اللتي فتكت بالناس ، ونحن مع ماعندنا من ايمان ، مع قرائتنا لكتاب الله في نعمة كبيره

  """;

// page 7
  static const String elmTextTwoSeven_1 = """
إن قارئ القرآن لا يحزن ، فلا يمكن ان تحزن إذا قرات القرآن بشكل صحيح وفهم لآياته واضح ، إذا كنت تقرؤه ، وتعقله ، وتفهمه ، وتطبقه ، لايمكن ان تحزن 
""";

  static const String ayahHadithTwoSeven_1 = """
قال تعالى 
فَإِنَّكَ بِأَعۡیُنِنَاۖ
الطور 48 
""";

// page 8
  static const String elmTextTwoEight_1 = """
مع قرائتنا لكتاب الله وفهمه الفهم الصحيح يقوى الايمان ، ومن علامات الايمان التوكل على الله ، والتفويض لأمر الله ، والتسليم لقضاء الله ، والرضا بقضاءالله ، توكل ، وتفويض ، وتسليم ، ورضا
""";

  static const String ayahHadithTwoEight_1 = """
 قالو لأبي الدرداء *
  يا أبا الدرداء لقد احترق دكانك ، قال : ماكان الله ليفعل ، يا أبا الدرداء لقد احترق دكانك ، قال: ماكان الله ليفعل ، إلى ان جاءه الخبر الصحيح ، لم يحترق دكانك ، قال: اعلم ذلك  فهو مطمئن ، فقد فوض امره إلى الله سبحانه ، وتوكل عليه ، ثم غادر دكانه ، فكان الله خليفته في حفظ دكانه

""";
  static const String footerTwoEight = """
---------------------
فتاوي إبن باز *
الحديث ضعيف، ولكن إذا عمل به الإنسان رجاء أن ينفعه الله به؛ فهو ذكر طيب
  """;
// page 9
  static const String elmTextTwoNine_1 = """
وإذا امنت بالله ورسوله يؤتك كفلين من رحمته  اي ضمانه في الدنيا وضمانه في الآخره ، ويجعل لك نورا تمشي به في الناس ، يريك الخير من الشر
  """;

  static const String elmTextTwoNine_2 = """
الإنسان بلا علم كالبهيمه تماما ، الإنسان بلا علم إلى أن يكون حيوانآ أقرب منه من أن يكون إنسانآ ، يأكل ، ويشرب ، وينام ، ويعطي نفسه ماتشتهي ، ويتكلم مايحلو له ، فيؤذي ويفرق ، ويخرب البيوت، وهو لايدري ماذا يفعل ، يتمحور حول ذاته ، يجر الأمور نحو مصلحته، يعيش على أنقاض الآخرين، يبني مجده على رفاتهم، يبني غناه على فقرهم، يبني سعادته على شقائهم، يبني حياته على موتهم، يبني أمنه على قلقهم، الإنسان من دون علم ومن دون هدى يدمر نفسه، ويدمر مجتمعه، يدمر ذاته، ويدمر الآخرين، لا تعنيه إلا ذاته

  """;

  // page 10
  static const String elmTextTwoTen_1 = """
احيانا تصاب النفس بالقلق، تصاب بالخوف، تصاب بالشعور بالقهر احيانا
إن هذه الأحاسيس المدمره، هذه المشاعر المقلقه، وهذا الإختلال في توازن الإنسان، هذا كله سببه الجهل، يأتي القرآن فيطمئن، نضرب على هذا امثله كثيره
  """;

  static const String ayhaHadithTwoTen_1 = """
قال تعالى 
مَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَلَنُحۡیِیَنَّهُۥ حَیَوٰةࣰ طَیِّبَةࣰۖ وَلَنَجۡزِیَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُوا۟ یَعۡمَلُونَ ۝٩٧
 النحل 97 
""";

  static const String elmTextTwoTen_2 = """
هذا نص قرأني، هذا كلام رب العالمين، يجب ان يبدد هذا الكلام كل خوف، كل قلق، كل شعور بالمستقبل المظلم، يجب ان يبدد هذا القول وهو كلام رب العالمين كل شعور بالظلم، كل شعور بأن الحياة تحتاج إلى إنسان شرس، إلى إنسان قوي
 """;

// page 11
  static const String ayhaHadithTowEleven_1 = """
قال تعالى 
أَمۡ حَسِبَ ٱلَّذِینَ ٱجۡتَرَحُوا۟ ٱلسَّیِّءَاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَوَاۤءࣰ مَّحۡیَاهُمۡ وَمَمَاتُهُمۡۚ سَاۤءَ مَا یَحۡكُمُونَ ۝٢١
الجاثية 21 
""";
  static const String elmTextTwoEleven_1 = """
انتهى الامر الله عز وجل يعجب ! أيعقل ياعبادي ان اعامل المسيئ كالمحسن؟! ان اعامل من عرفني كمن لا يعرفني ؟ ايعقل هذا ؟

""";
// page 12
  static const String elmTextTwoTwelve_1 = """
اذا عرفت الله عز وجل وانه بيده كل شيئ ، وأن الأمر كله إليه ، وانه اليه ترجع الأمور كلها ، وانه بيده ملكوت السماوات والأرض ، وانه ما من دابه إلا هو آخذ بناصيتها ، وهو يحكم لا معقب لحكمه ، وهو لطيف لما يشاء ، وان الخير منه ، والشر بتقديره من الإنسان كسبا  ومن الله فعلآ ، 

إذا قرأ الإنسان القرآن وفهمه الفهم الصحيح وطبقه انقلبت نفسه إلى نفس هانئه ، وادعه ، مطمئنه ، واثقة برضاء الله عز وجل، واثقة من عدالته، واثقة برحمته، تعرف ان هذه الحياة قصيرة، طبيعتها الإبتلاء طبيعتها الإمتحان وأن الحياة الحقيقية حياة الآخرة وان هذه الدنيا دار ابتلاء وان الآخرة دار عطاء هذه الدنيا دار تكليف، وان الآخرة دار تشريف اذا عرف هذه المعاني رضي بدخله رضي بزوجته رضي بأولاده رضي بكل شيء لانه يرى هذا كله بتخطيط من عليم حكيم رحيم محب

""";

// page 13
  static const String titleTwoTherteen = """
وقفه
----- 
""";

  static const String ayhaHadithTowTherteen_1 = """
وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدۡرِهِۦ

""";
  static const String elmTextTwoTherteen_1 = """
أي ماعظموه حق تعظيمه، ما عرفوه حق معرفته، كل اخطائهم، وكل شركهم، وكل إنحرافهم، وكل معاصيهم بسبب نقص معرفتهم

حقيقة تقول: نقص المعرفه يقابله إنحراف السلوك، ما من سلوك منحرف، ما من إنسان وقع في مخالفات، ما من إنسان قصر في أداء واجب، ما من إنسان وقع فيما حرم الله إلا بسبب نقص معرفته، فهناك علاقة طردية بين العلم وبين السلوك

""";
}
