// ElmList39 - إن الذين قالوا ربنا الله ثم استقاموا
import 'package:elm/core/data/model/elm_model_new_order.dart';
import 'package:elm/core/data/model/enum_order.dart';

List<ElmModelNewOrder> elmList39NewOrder = <ElmModelNewOrder>[
  ElmModelNewOrder(
    titles: [
      "إن الذين قالوا ربنا الله ثم استقاموا",
    ],
    ayahs: [
      "{تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون}",
    ],
    texts: [
      "وأنا أستمع لهذه الآية بصوت الشيخ خالد الجليل، شعرت بإحساس غريب لا أعلم هل هو بسبب التلاوة العذبة التي دغدغت مشاعري، أم لأنه كلام الله ربنا وخالقنا الذي لا معبود سواه.",
    ],
    order: [
      EnOrder.titles,
      EnOrder.ayahs,
      EnOrder.texts,
    ],
  ),
  ElmModelNewOrder(
    ayahs: [
      "{نحن أولياؤكم في الحياة الدنيا وفي الآخرة}",
    ],
    texts: [
      "حتى اقشعر بدني، وأوقفت المقطع لبرهة من الزمن، ولسان حالي يقول: كيف السبيل، يا رب، لأكون منهم؟ لكي يشملني هذا الوعد الإلهي؟ كيف يمكن لي أن أصل إلى مرتبة ومكانة كهذه؟",
    ],
    order: [
      EnOrder.ayahs,
      EnOrder.texts,
    ],
  ),
  ElmModelNewOrder(
    texts: [
      "كان قلبي يعتصر ألمًا على كل ما ضيعت من سنين عمري، وعلى كل ما فرطت فيه في جنب الله، وكل ما أسرفت فيه.",
      "وشيءٌ في نفسي يقنعني بأن هذه المكانة لفئة من البشر فقط، وكأن نفسي تريد أن تقنعني بأنه مستحيل أن أكون منهم.",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),
  ElmModelNewOrder(
    texts: [
      "وعند رجوعي إلى الآية التي قبلها، وجدت أن الله سبحانه وتعالى يقول: {إِن الذين قالوا ربنا الله ثم استقاموا} هم هذه الفئة من البشر.",
      "لكن النفس الأمارة بالسوء تحاول إقناعنا باستحالة أن نكون منهم.",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),
  ElmModelNewOrder(
    texts: [
      "وعندما حاولت البحث عن السبب، وجدت أن ما اعتادت عليه النفس من التفلت خلال سنين العمر الماضية هو ما جعلها ترى الاستقامة شيئًا مستحيلًا.",
      "لذلك، أنصح أبنائي الأعزاء على قلبي بأن يروضوا أنفسهم، وينتصروا عليها وعلى وسوسة الشيطان بإرادة فولاذية صلبة، لكي يستحقوا أن يكونوا ممن يتولاهم الله في الدنيا والآخرة.",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),
];
