// ElmList28 - لا تخف إنك انت الأعلى
import 'package:elm/core/data/model/elm_model_new_order.dart';
import 'package:elm/core/data/model/enum_order.dart';

List<ElmModelNewOrder> elmList28NewOrder = <ElmModelNewOrder>[
  // Page 1
  ElmModelNewOrder(
    titles: [
      "لا تخف إنك انت الأعلى",
    ],
    texts: [
      "{قلنا لا تخف إنك انت الأعلى}",
      "عندما تكون على حق وتؤمن بأن الله هو الحق وقوله حق ووعده حق فلا تخف انك انت الأعلى",
    ],
    order: [
      EnOrder.titles,
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),

  // Page 2
  ElmModelNewOrder(
    texts: [
      "لطالما وأنك قد خلعت نعليك (رميت الدنيا وراء ظهرك) وشمرت عن ساعديك وامتثلت أمر الله {فاعبدني وأقم الصلاة لذكري فلا تقلق ولا تخف فستأتيك الدنيا وهي راغمة فإن الأرض لله يورثها من يشاء من عباده والعاقبة للمتقين",
    ],
    order: [
      EnOrder.texts,
    ],
  ),

  // Page 3
  ElmModelNewOrder(
    texts: [
      "لطالما لسان حالك يقول وعجلت إليك ربي لترضى فلا تخف لأن ربك قد قالها من قبل { اقبل ولا تخف انك من الآمنين } فمن يواسي نبيه يواسيك أنت أيضا فرب موسى هو ربك",
    ],
    order: [
      EnOrder.texts,
    ],
  ),

  // Page 4
  ElmModelNewOrder(
    texts: [
      "وارفع يديك إلى السماء واخشع واخضع وأضرع فمن قال { قد أوتيت سؤلك يا موسى } لن يردك خائبا فإنه الحي الكريم ولا يرد من رفع يديه صفرا",
    ],
    order: [
      EnOrder.texts,
    ],
  ),

  // Page 5
  ElmModelNewOrder(
    texts: [
      "لا تخف أن يفرط عليك أحد أو أن يطغى فربك هو رب موسى وهارون ولن يعجزه كل من هو على شاكلة فرعون وهو القائل { لا تخافا انني معكما اسمع وأرى}",
    ],
    order: [
      EnOrder.texts,
    ],
  ),

  // Page 6
  ElmModelNewOrder(
    texts: [
      "عندما يكون يقينك كلا إن معي ربي سيهدين فلا تخاف دركا ولا تخشى",
    ],
    order: [
      EnOrder.texts,
    ],
  ),

  // Page 7
  ElmModelNewOrder(
    texts: [
      "فمن شق لموسى في البحر طريقا يبسا فإنه حتما سيشق لك طريق النجاة والنصر فرب موسى هو ربك وهو القائل { ثم ننجي رسلنا واللذين آمنوا }ووعد المؤمنين بالنجاة (كذلك حقا علينا ننج المؤمنين}",
    ],
    order: [
      EnOrder.texts,
    ],
  ),

  // Page 8
  ElmModelNewOrder(
    texts: [
      "ما عليك إلا أن تثق بربك العظيم وأن تصبر فربك العظيم القائل { ولتصنع على عيني } هو القائل أيضا {واصبر لحكم ربك فإنك بأعيننا } فمن يطمئن أنبيائه فهو يطمئنك أنت أيضا",
    ],
    order: [
      EnOrder.texts,
    ],
  ),

  // Page 9
  ElmModelNewOrder(
    texts: [
      "لا تخف وما يجب عليك هو أن تأخذ الكتاب بقوة وأن يقشعر جلدك لأحسن الحديث ثم يلين قلبك",
      "واستشعر بأن الخطاب موجه لك أنت أيضا فلا تقل من أنا حتى أضع نفسي مكان الأنبياء فمن وعد الأنبياء هو نفسه من وعد مجموع المؤمنين بقوله {ولا تهنوا ولا تحزنوا وأنتم الأعْلون إن كنتم مؤمنين}",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),

  // Page 10
  ElmModelNewOrder(
    texts: [
      "واعلم يقينا بأن الله يدافع عن الذين آمنوا",
      "فالقرآن هو منهج لك أنت أيضا وعلى قدر إيمانك بالوعد وثقتك بالواعد سيريك الله من آياته الكبرى",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),

  // Page 11
  ElmModelNewOrder(
    texts: [
      "لا تخف",
      "وما ينبغي عليك هو فقط أن تثق أن الله حق وقوله حق ووعده حق فتعالى الله الملك الحق فهو القائل {واصبر إن وعد الله حق}",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),
];
