// ElmList30 - ياليتني قدمت لحياتي
import 'package:elm/core/data/model/elm_model_new_order.dart';
import 'package:elm/core/data/model/enum_order.dart';

List<ElmModelNewOrder> elmList30NewOrder = <ElmModelNewOrder>[
  // Page 1
  ElmModelNewOrder(
    titles: [
      "ياليتني قدمت لحياتي",
    ],
    texts: [
      "اعظم واكبر خسارة حلت بنا في كل ما مضى من اعمارنا هي اننا لم نفكر في اول يوم من حياتنا، وماذا اعددنا له؟! وكيف سيكون حالنا فيه؟!",
      "لأجل ذلك ينبغي ان نتدارك ما تبقى من العمر، وان نعمل جاهدين وبهمة عالية وسرعة فائقة، ونسابق ونسارع لكي يكون اول يوم من حياتنا يوم عرس وفرحة تفوق حد الخيال.",
    ],
    order: [
      EnOrder.titles,
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),

  // Page 2
  ElmModelNewOrder(
    texts: [
      "نعم اول يوم من حياتنا وهي الحياة الحقيقية الابدية السرمدية التي لا مناص منها.",
      "فالسفر طويل، والزاد قليل، وقد لا يكفي لينير لنا ظلمة اول ليلة من حياتنا، تلك الليلة التي سنقضيها بعيدا عن الاهل والاحباب.",
      "وسنحتاج ونحتاج ونحتاج فيها من يؤمن وحشتنا، هذا ما كان يجب علينا فعله منذ البداية.",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),

  // Page 3
  ElmModelNewOrder(
    texts: [
      "وما يجب علينا فعله الان بعد الاستعانة بالله، والاستغاثة برحمته، والتمسك بحبله المتين.",
    ],
    ayahs: [
      "{ حبل النجاة }.",
    ],
    order: [
      EnOrder.texts,
      EnOrder.ayahs,
    ],
  ),

  // Page 4
  ElmModelNewOrder(
    texts: [
      "صحيح بأن ما فرطنا به مما مضى من العمر كثير، ولكن الامل بالله كبير؛ ليس غروراً، ولكن ثقة بكرمه ورأفته مع مسارعه بالخيرات كسرعة النسر الى فريسته.",
      "وثقة برحمته التي وسعت كل شيء، رحمته التي سبقت غضبه.",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),

  // Page 5
  ElmModelNewOrder(
    texts: [
      "فقد كنا في مكان اضيق واظلم من الحفرة التي سنبيت فيها اول ليلة من حياتنا، كنا في ظلمات ثلاث: ظلمة غشاء الجنين، وظلمة الرحم، وظلمة بطن الأم.",
      "ولكنه برحمته سبحانه وتعالى اذا شاء ان يوسع وسع.",
    ],
    order: [
      EnOrder.texts,
      EnOrder.texts,
    ],
  ),
];
