class ElmTextTwentySix {
  // pageOne
  static const String subtitleTwentySixPageOne_1 = """
  التكبر في حق الله كمال، وفي حق الإنسان نقص 
 """;
  static const String elmTextTwentySixPageOne_1 = """
التكبُرُ في حق الله كمالٌ، وفي حق الإنسان نقصٌ، الإنسان بالأساس ضعيف، في الأصل الإنسان ضعيف، فإذا تكبر تكبر بغير حق، أما ربنا عز وجل كبير، عطاؤه كبير، كماله عظيم، منحته لا حدود لها، فإذا ذكرنا بعطائه الكبير فهذا كمالٌ فيه 
إذاً: المتكبر لا نهاية لعظمته، لا نهاية لكرمه، لا نهاية لجوده لا نهاية لعطائه، في حق الله كمال، وفي حق العبيد نقص، لأنه تكبرٌ بغير حق 
""";
  static const String ayahHadithTwentySixPageOne_1 = """
هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر سبحان الله عما يشركون 
""";

  // pageTwo
  // 1
  static const String subtitleTwentySixPageTwo_1 = """
الإستكبار في الطاعة من أكبر المعاصي 
  """;
  static const String elmTextTwentySixPageTwo_1 = """
هناك ألف معصية سببها الغلبة، يُغلب الإنسان، وفي معصية سببها الكبر، معصية الكبر عند الله كبيرة جداً 
""";
  static const String ayahHadithTwentySixPageTwo_1 = """
ومن يستنكف عن عبادته ويستكبر فسيحشرهم إليه جميعاً 
""";
// 2
  static const String elmTextTwentySixPageTwo_2 = """
الإستكبار في الطاعة مشكلة، لذلك ما الكبر؟ قال 
""";
  static const String ayahHadithTwentySixPageTwo_2 = """
        الكبر بطر الحق وغمط الناس (مسلم عن عبدالله بن مسعود) 
        """;
  // 3
  static const String elmTextTwentySixPageTwo_3 = """
الكبر أن ترفض الحق، ألا تقبله، ألا تعبأ بالصلاة، ألا تعبأ بالزكاة، ألا تعبأ بالحج، أن ترى نفسك فوق الشرع 
معصية الإستكبار كبيرة جداً، إبليس استكبر 
""";
  static const String ayahHadithTwentySixPageTwo_3 = """
          قال أنا خير منه 

لذلك ورد عن رسول الله صلى الله عليه وسلم عن الله عز وجل 
الكبرياء ردائي، والعظمة إزاري، فمن نازعني واحداً منهما قذفته في النار (احمدعن ابي هريرة) 

""";
// pageThree
// 1
  static const String subtitleTwentySixPageThree_1 = """
إبليس رأس العاصيين المستكبرين 
""";
  static const String elmTextTwentySixPageThree_1 = """
هناك معاصي الاستكبار، على رأس العاصيين إستكباراً إبليس اللعين 
""";
  static const String ayahHadithTwentySixPageThree_1 = """
        لم اكن لأسجد لبشر خلقته من طين 
        أبى واستكبر وكان من الكافرين 
        """;
  //2
  static const String subtitleTwentySixPageThree_2 = """

معصية الإستكبار والإباء إثمها أكبر 
""";
  static const String elmTextTwentySixPageThree_2 = """
معصية استكبار، معصية التأبي، هذه المعصية إثمها مليون ضعف عن إثم معصية الغلبة 
أحياناً يُغلب الإنسان على أمره، تغلبه شهوته، فيفعلها، ويبكي بكاء مراً ندماً على فعلته، هذه معصية، وهذه معصية، لكن الأولى معصية الاستكبار، معصية التأبي، معصية التألق، أما المعصية الثانية فهي معصية الغلبة والإنكسار 
""";

  static const String ayahHadithTwentySixPageThree_2 = """
          قال أنا خير منه 
          """;
  // 3
  static const String elmTextTwentySixPageThree_3 = """
لذلك قالوا أربع كلمات مهلكات: أنا ونحن ولي وعندي، (أنا) قالها إبليس فأهلكه الله، و(نحن) قالها قوم بلقيس نحن أولو قوة وبأس شديد فانهار ملكها، وقال قارون: إنما أوتيته على علم عندي، أنا عندي كذا، أنا حجمي المالي كذا، أنا أملك كذا، أنا أفعل كذا هذه كلمة مهلكة، وفرعون قال: أليس(لي) ملك مصر، إذاً أربع كلمات مهلكات: أنا ونحن ولي وعندي 
""";
  static const String ayahHadithTwentySixPageThree_3 = """
قال أنا خير منه خلقتني من نار وخلقته من طين 
        {قال فاخرج منها فإنك رجيم} 
        {وإن عليك لعنتي إلى يوم الدين} 

        """;
  // 4
  static const String elmTextTwentySixPageThree_4 = """
هذه اللعنة أصابت إبليس وكل من تبع إبليس، كل من أستجاب لأبليس عليه لعنة الله 
""";

// pageFour
// 1
  static const String subtitleTwentySixPageFour_1 = """
لا ينبغي للمؤمن أن يجعل بينه وبين الحق حجاباً 
""";

  static const String elmTextTwentySixPageFour_1 = """
أحياناً يكون مال الإنسان حجاباً له عن اتباع الحق، هذا الذي يتكلم فقير، وأنا غني، أيعقل أن أجلس في مجلسه؟ هذا الذي يتكلم ضعيف، وأنا قوي، أيعقل أن أستمع له، لا تجعل المال والجاه حجاباً يحجبك عن الحق، إبليس ما الذي أهلكه، أنه نظر إلى النار وتوهمها أنها خير من الطين، فكيف يعقل أن يسجد له؟ أما المؤمن فلا يجعل شيئاً يحجبه عن الحق 
""";
  static const String ayahHadithTwentySixPageFour_1 = """
سيدنا العباس عم رسول الله، سئل مرة: ايكما أكبر أنت أم رسول الله؟ فقال رضي الله عنه: هو أكبر مني قدراً بلا شك، وأنا ولدت قبله 
""";
// 2
  static const String elmTextTwentySixPageFour_2 = """
المؤمن الصادق لا يجعل من السن حاجزاً، ولا من المال حاجزاً، ولا من الجاه حاجزاً، ولا من النسب حاجزاً، ولا من القوة حاجزاً 
""";
  static const String ayahHadithTwentySixPageFour_2 = """
عن أنس بن مالك عن النبي صل الله عليه وسلم قال:{إسمعوا، واطيعوا، وإن استعمل حبشي كان على راسه زبيبة}[البخاري] 
""";

// 3
  static const String elmTextTwentySixPageFour_3 = """
أنت عبد للحق، أينما كان الحق فأنت تابع له 
في بعض الأحيان يرى الإنسان عُلو نسبه، ويقول: أنا منسوب لكن عملك غير طيب 
""";
  static const String ayahHadithTwentySixPageFour_3 = """
{يا أبا ذر، أعيرته بأمه؟ إنك امرؤٌ فيك جاهلية}[البخاري] 
""";
// 4
  static const String elmTextTwentySixPageFour_4 = """
هذه جاهلية، أن تعتد بنسبك، أو بمالك، أو بقوتك، أو بصحتك، أو بشكلك، أو بمنصبك، أو باختصاصك هذه كلها حجب 
""";
  static const String ayahHadithTwentySixPageFour_4 = """
تلك الدار الآخرة نجعلها للذين لا يُريدون علواً في الأرض ولا فساداً 
""";
// 5
  static const String elmTextTwentySixPageFour_5 = """
لو أن الله عز وجل قال: للذين لا يستعلون ولا يفسدون، ليست هكذا الآية 
""";
  static const String ayahHadithTwentySixPageFour_5 = """
للذين لا يريدون علواً في الأرض ولا فساداً 
""";
// 6
  static const String elmTextTwentySixPageFour_6 = """
أي يجب ألا يريد، لو أن إنساناً أراد، ولم يتمكن وقع في المعصية، لو أراد،  الإمام علي كرم الله وجهه قال: لو أردت أن يكون لك شراك نعل تباهي به أخاك فأنت ممن تعنيهم هذه الآية 
ياليت لو كان عندي بيت، يأتي إلى عندي أصدقائي لأريهم أربعمئة متر، وليس عندك إلا مئة متر، أنت لم تقعل شيئاً إطلاقاً، لكن تمنيت أن تستعلي على الناس 
""";

// pageFive
  static const String subtitleTwentySixPageFive_1 = """
من صور العلو في الأرض 
""";
  static const String elmTextTwentySixPageFive_1 = """
ممكن أن تطعم الناس، أما لو أردت بهذا الإطعام أن تستعلي عليهم، دخلت في الآية، يمكن أن تسكن بيتاً، أما إذا أردت من هذا البيت أن تستعلي به على الناس فقد دخلت في هذه الآية، يمكن أن تكون تاجراً، أما إذا جلست في مجلس تتحدث عن حجم تجارتك، وعن نجاحاتك، وعن، وعن من أجل أن تستعلي عليهم فقد دخلت في الآية 
يمكن أن ترتدي ثياباً نظيفة أنيقة جميلة، أما أن تريد بها أن تزهو على الناس فقد دخلت في هذه الآية، شيء خطير جداً لمُجرد أن تستخدم الشيء لا لوظيفته، ولكن لتستعلي به على الناس دخلت في الآية، هذا في الطعام والشراب، واللباس، والزينة، والسيارة، والمصنع، والمعمل، والتجارة، والسياحة، يمكن أن تأخذ أهلك إلى مكان ما، للنزهة، أما أن تعود في المجالس لتقول كيف استمتعت في المكان الفلاني، وكم أنفقت، وكم فعلت، دخلت في الآية 
العلو أن تكون أعلى من الناس
""";
  static const String ayahHadithTwentySixPageFive_1 = """
 النبي عليه الصلاة والسلام سيد الخلق، وحبيب الحق، كانوا في سفر، وأرادوا أن يأكلوا فقال أحدهم: علي ذبح الشاة، وقال الثاني: علي سلخها وقال الثالث: علي طبخها، قال النبي الكريم: 
          علي جمع الحطب 
قالوا: نكفيك ذلك، قال 
لا.. أعرف ذلك لكن الله يكره أن يرى عبده متميزاً على أقرانه 
""";

// pageSix
//1
  static const String subtitleTwentySixPageSix_1 = """
العلو رد للحق واحتقار للناس 
""";
  static const String ayahHadithTwentySixPageSix_1 = """
النبي عليه الصلاة والسلام سُئل عن الكبر.. فعن عبد الله بن مسعود عن النبي صلى الله عليه وسلم قال 
لا يدخل الجنة من كان في قلبه مثقال ذرةٍ من كبر، قال رجل: إن الرجل يُحب أن يكون ثوبهُ حسناً، ونعله حسنة؟! قال: إن الله جميل يحب الجمال، الكبر بطر الحق وغمط الناس{صحيح مسلم} 
""";
  static const String elmTextTwentySixPageSix_1 = """
بالتعريف الدقيق 
""";
// 2
  static const String ayahHadithTwentySixPageSix_2 = """
          بطر الحق وغمط الناس 
          """;
  static const String elmTextTwentySixPageSix_2 = """
معنى بطر الحق، أي رد الحق، أن ترى نفسك فوق الشرع، أنت لست مقتنعاً بهذا الحُكم الشرعي، لست مقتنعاً بهذه الآية، إذا رأيت نفسك لا تنصاع لأمر الله عز وجل، ولا لحكمه فأنت متكبر 
لمجرد أن ترى نفسك فوق السنة، النبي عليه الصلاة والسلام من سنته أن تلعق الإناء، أنت تركت طعام بالإناء من أجل أن تزهو أمام الناس 
لمجرد أن ترد السنة، أو القرآن، أو الشرع، أو الحق فأنت متكبر، بل كافر، فالكبر بطر الحق، وغمط الناس، وغمط الناس أن تحتقرهم، أن تزدريهم، أن لا ترى إلا نفسك، أن تهمل من حولك، لكن التواضع قبول الحق، وإنصاف الناس، فالعلو في الأرض من معانيه الكبر، والكبر بطر الحق وغمط الناس، أما الفساد لمجرد ان تشعر الآخرين أنهم محرومون وأنت الذي تملك كل شيء، هذا الفساد، العلو أن تُشعره بالحرمان، أن تغتصب ماله فساد، أن تحمله على المنكرات فساد، أن تُزين له الدنيا فساد 
""";

// pageSeven
//1
  static const String subtitleTwentySixPageSeven_1 = """
تناقض الكبر مع العبودية لله عز وجل 
""";
  static const String elmTextTwentySixPageSeven_1 = """
ورد في الحكم{لا تجعل الله أهون الناظرين إليك} فالإنسان أحياناً يستحي من ضيف تكون ثيابه غير أنيقة، بل متبدِلة، فلا تجعل خالق الكون الذي يراك حين تقوم أهون الناظرين إليك،
""";
  static const String ayahHadithTwentySixPageSeven_1 = """
 يقول الله عز وجل 
ياأيها الذين أمنوا لا يسخر قوم من قوم عسى أن يكونوا خيراً منهم ولا نساء من نساء عسى أن يكُن خيراً منهن 
""";
// 2
  static const String elmTextTwentySixPageSeven_2 = """
فقد تجد امرأة أقل جمال من أُختها لكنها أكثر معرفة بربها، وأكثر رعاية لزوجها، وعطفاً على أولادها، وطاعة لله، فهذا الجمال يذوي، وهذا التيه والزهو لا شأن له عند الله عز وجل، فأنت متواضع بقدر إيمانك، متكبر بقدر بعدك عن الله عز وجل، فلا يدخل الجنة من كان في قلبه مثقال ذرةٍ من كبر لماذا؟ لأن الكبر يتناقض مع العبودية لله عز وجل 
""";

// pageEight
// 1
  static const String subtitleTwentySixPageEight_1 = """
الجاهل من يستعلي على الناس ويتيه عليهم 
""";
  static const String elmTextTwentySixPageEight_1 = """
ممكن للحليب أن يضاف له من دون غش ضمن البيت، ثلاثة أمثاله ماء وتعمله شراباً، فهو يتحمل أن تضيف له ثلاثة أمثال، ولكن لا يتحمل قطرة نفط واحدة، وعندئذٍ يفسد وتلقيه في قارعة الطريق، فكذلك العبودية لله عز وجل لا تحتمل كبراً أبداً، ويجوز للإنسان أن يغلط آلاف الأغلاط من غير قصد ومن غير تصميم ويتوب منها سريعاً، أما أن يأخذه العُجب، ويستعلي على الناس، ويتيه على الناس بشكله، أو بماله، أو بقوته، أو بوسامته، أو بذكائه، فهذا الكبر يتناقض مع العبودية لله عز وجل 
""";
  static const String ayahHadithTwentySixPageEight_1 = """
الله سبحانه وتعالى يقول 
واخفض جناحك لمن إتبعك من المؤمنين 
""";
// 2
  static const String subtitleTwentySixPageEight_2 = """

تواضع النبي عليه الصلاة والسلام مع أصحابه 
""";
  static const String elmTextTwentySixPageEight_2 = """
اخفض جناحك، كان عليه الصلاة والسلام يُكرم أصحابه كثيراً، كان يحبُهم، كان يثني عليهم، كان يعرف أقدارهم
""";
  static const String ayahHadithTwentySixPageEight_2 = """
 والله يامعاذ إني لأحبُك.. ولسيدنا سعد: هذا سعد خالي أروني خالاً مثل خالي 
""";
// 3
  static const String elmTextTwentySixPageEight_3 = """
سيدنا أبو عبيدة أمين هذه الأمة، كل صحابي جليل أعطاه النبي عليه الصلاة والسلام وصفاً يليق به 
""";
  static const String ayahHadithTwentySixPageEight_3 = """
لو كان نبيٌ بعدي لكان عمر 
""";
// 4
  static const String elmTextTwentySixPageEight_4 = """
ماصُب في صدري شيء إلا وصببته في صدر أبى بكر هكذا يجب أن تحب من تُعلمه، تحبهم، أن تعرف أقدارهم، وأن تنزلهم منازلهم، أن تقدر أعمالهم، تضحياتهم، ورعهم، استقامتهم لكي يحبُوك، يحبهم ويُحبُونه 
ما من فاتح على وجه الأرض فتح بلدة إلا وأخذه التيه، وأخذته الغطرسة والإستعلاء والعلو، وما شاكل ذلك، إلا النبي عليه الصلاة والسلام حينما فتح مكة دخلها مطأطئ الرأس، فلما جمعهم، وكان بإمكانه أن يقضي عليهم واحداً واحداً، هؤلاء الذين كذبوه، هؤلاء الذين أخرجوه، هؤلاء الذين ائتمروا على قتله، هؤلاء الذين عذبوا أصحابه، هؤلاء الذين قتلوا أصحابه، هؤلاء الذين حاربوه ليستأصلوا شأفته، هؤلاء هؤلاء لما كانوا في قبضته وكان بإمكانه أن يقضي عليهم، وأن يدمرهم عن آخرهم قال لهم
""";
  static const String ayahHadithTwentySixPageEight_4 = """
 ماتظنون أني فاعلٌ بكم؟، قالوا: أخ كريم وابن أخ كريم قال: اذهبوا فأنتم الطلقاء 
""";
// 5
  static const String elmTextTwentySixPageEight_5 = """
هكذا الرحمة، هكذا الحكمة 
""";
  static const String ayahHadithTwentySixPageEight_5 = """
أبو سفيان قبيل إسلامه قال له: والله ما أعقلك، ما أحكمك، ما أرحمك، ما أوصلك!، قال عليه الصلاة والسلام: من دخل دار أبى سفيان فهو آمن.. أي أن هذا زعيم قريش، فجعل له شأناً
من دخل الكعبة فهو آمن، ومن دخل بيته فهو آمن، ومن دخل دار أبى سفيان فهو آمن.. فلم عَلِمَ أبو سفيان قال: ما أعقلك، ما أرحمك، ما أحكمك، ما أوصلك! 

عدي بن حاتم عندما رأى النبي يكلم امرأةٌ مسنة، ضعيفة، فقيرة وقف معها طويلاً قال: والله ما هذا بأمر ملك، هذا ليس ملك، دخل إلى البيت وليس في بيت النبي الكريم إلا وسادة من أدم محشوة ليفاً، قال له النبي: اجلس عليها، قال: بل أنت، قال: بل أنت ضيفنا، قال: فجلست عليها وجلس هو على الأرض 
يا محمد أتحب أن تكون نبياً ملكاً أم نبياً عبداً؟ قال له؛ بل نبياً عبداً أجوع يوماً فأذكره وأشبع يوماً فأشكره 
""";

// pageNine
// 1
  static const String ayahHadithTwentySixPageNine_1 = """
واخفض جناحك لمن اتبعك من المؤمنين 
""";
  static const String subtitleTwentySixPageNine_1 = """

أمر الله نبيه عليه الصلاة والسلام بخفض الجناح والتواضع 
""";
  static const String elmTextTwentySixPageNine_1 = """
هذا توجيه من الله سبحانه وتعالى للنبي عليه الصلاة والسلام في الطريقة التي ينبغي أن يُعامل بها أصحابهُ، هذا توجيه، أو تربية، أو تأديب، حينما سئل النبي عليه الصلاة والسلام عن الأدب الرفيع الذي يتحلى به فما زاد أن قال: 
""";
  // 2
  static const String ayahHadithTwentySixPageNine_2 = """
          ادبني ربي فأحسن تأديبي 
          الجامع الصغير عن ابن مسعود بسند ضعيف 
""";
  static const String elmTextTwentySixPageNine_2 = """
وهذه الآية من تأديب الله سبحانه وتعالى 
""";
// 3
  static const String ayahHadithTwentySixPageNine_3 = """
واخفض جناحك لمن اتبعك من المؤمنين 
""";
  static const String elmTextTwentySixPageNine_3 = """
معنى خفض الجناح 
خفض الجناح كناية، والكناية هي التعبير عن الشيئ ببعض لوازمه، إذا قلت فلان ندم، فأنت قد استخدمت الأسلوب المباشر، أما إذا أردت أن تستخدم الكناية تقول: فلان عض على أصبعه! قال تعالى 
""";
  // 4
  static const String ayahHadithTwentySixPageNine_4 = """
          ويوم يعض الظالم على يديه 
          """;

  static const String elmTextTwentySixPageNine_4 = """
هذا كناية عن الندم الشديد، وخفض الجناح كناية عن التواضع، فعن أنس بن مالك قال: قال رسول الله صل الله عليه وسلم 
""";
// 5
  static const String ayahHadithTwentySixPageNine_5 = """
إن الله أوحى إلي أن تواضعوا، ولا يبغى بعضكم على بعض 
رواه ابن ماجة
""";
  static const String elmTextTwentySixPageNine_5 = """
والله سبحانه وتعالى يوجه النبي عليه الصلاة والسلام، أو يؤدبهُ أو يُربيه، كي يكون متواضعاً مع أصحابه، قال تعالى
""";
// 6
  static const String ayahHadithTwentySixPageNine_6 = """
واخفض جناحك لمن اتبعك من المؤمنين 

""";

// pageTen
//1
  static const String subtitleTwentySixPageTen_1 = """
الطاغية المتكبر لا يؤمن باليوم الآخر 
""";
  static const String elmTextTwentySixPageTen_1 = """
لو أن الإنسان آمن بيوم الحساب لاستقام على أمر الله، من المستحيل أن تجد إنساناً يؤمن أن بعد الموت حياة أبدية، وأن الله سبحانه وتعالى لابد من أن يحاسبه، ثم لا يستقيم إلى أمر الله؟! فهذا شيء مستحيل 
وقال موسى إني عذت بربي وربكم من كل متكبر لا يؤمن بيوم الحساب 
لذلك فالطغاة دائماً مُلحدون، لا يمكن يكون طاغية كفرعون مؤمناً، لو آمن لاستقام، إنسان ضعيف وأمامه قوي فهل يتحداه؟ يكون أحمق، ويكون مجنوناً، لكن لأنه لم يؤمن بالله أصلاً، ولم يؤمن بالآخرة إطلاقاً تراه متكبراً متجبراً، بطاشاً قهاراً 
""";
  static const String ayahHadithTwentySixPageTen_1 = """
كذلك يطبع الله على كل قلب مُتكبر جبار 
""";

  //2
  static const String subtitleTwentySixPageTen_2 = """

العلاقة بين الكبر والتجبر 
""";
  static const String elmTextTwentySixPageTen_2 = """
كما أن هناك علاقة بين الإسراف والارتياب، هناك علاقة بين التكبر والجبروت، فالمتكبر إذا بطش دمر 
""";
  static const String ayahHadithTwentySixPageTen_2 = """
          وإذا بطشتم بطشتم جبارين 
""";

  // 3
  static const String elmTextTwentySixPageTen_3 = """
فالتجبر ليس ظلماً فقط، بل هو ظلم، مع كبر، مع تدمير، مع إيقاع الأذى الشديد، هذا هو التجبُر، والله سبحانه وتعالى قهر كل الجبابرة بالموت سبحان من قهر عباده بالموت والإنسان مهما كان عالياً في الأرض فلا بد من أن يموت، كل مخلوق يموت، ولا يبقى إلا ذوالعزة والجبروت، والليل مهما طال فلا بد من طلوع الفجر، والعمر مهما طال فلا بد من نزول القبر، وسبحان من قهر عباده بالموت، فالمتكبر والجبار يجولان جولاتٍ ثم يزولان، ويقصمهما الله عز وجل، أما المؤمن فإنه ينمو، كلما ازداد عمره ازداد مكانة ورفعة لأنه متواضع، وبالتواضع تأخذ أعلى درجة 
إنظر إلى الأكحال وهي حجارة 
        لانت فصار مقرها في الأعين 
الحجر عندما لان أصبح يوضع في العين، والكحل أساسه حجر 
علامة المؤمن التواضع، بالتواضع يعلو، والإنسان غير المؤمن متكبر، وبالتكبر يسفُل، فربنا عز وجل يرفع المتواضعين، ويقصم العتاة والجبارين
""";

// Page Eleven (from kibr.ini // TwentySixEleven_..)
  static const String elmTextTwentySixPageEleven_1 = """
️على من تستكبر؟ على الذي خلقك من تراب ثم من نطفةٍ ثم سواك رجلا؟ على من بيده كل أجهزتك؟
لو أنه عطل أحد الأجهزة لأصبحت الحياة جحيماً لا يطاق، على من تستكبر؟ على من لو أنه جمد في عروق دماغك نقطة دم لأصبح الإنسان مجنوناً، أو لأصبح مشلولاً أو لأصبح أعمى، على من تستكبر؟
""";
  static const String elmTextTwentySixPageEleven_2 = """
️المؤمن يرى نفسه صغيراً ويراه الناس كبيراً
""";
  static const String elmTextTwentySixPageEleven_3 = """
️الكافر يرى نفسه كبيراً ويراه الناس صغيراً
""";
  static const String ayahHadithTwentySixPageEleven_1 = """
️الدعاء النبوي الشريف{ اللهم اجعلني في عيني صغيراً وفي اعين الناس كبيراً} رواه البزاز عن بريدة بن الحصيب
""";
  static const String elmTextTwentySixPageEleven_4 = """
️لابد للمتكبر أن يصيبه الله سبحانه وتعالى بمشكلة تكشف ضعفه وزيفه
""";
  static const String elmTextTwentySixPageEleven_5 = """
️أيُعقل أن يحرم الإنسان الجنة لأن في قلبه مثقال حبة من كبر؟! نعم لأن مثقال حبة من كبر يتناقض مع العبودية لله
""";
  static const String elmTextTwentySixPageEleven_6 = """
️من كان في قلبه مثقال حبة من كبر فهو ليس عبداً لله
""";
  static const String elmTextTwentySixPageEleven_7 = """
️من أسباب الكفر الإستكبار والتواضع علامة الإيمان
""";
  static const String elmTextTwentySixPageEleven_8 = """
️أحد عوامل الكفر الكبر، ومن علامات المؤمن التواضع
""";
  static const String elmTextTwentySixPageEleven_9 = """
️تواضعوا لما تتعلمون منه، وتواضعوا لمن تعلمونه، والتواضع لابد منه في التعلم والتعليم، وقال أحد العارفين بالله لبعض تلامذته وقد تجاوز حده يافتى نحن إلى أدبك أحوج منا إلى علمك
""";
  static const String elmTextTwentySixPageEleven_10 = """
️خفض الجناح يؤلف القلوب، ويُعين على المحبة، والمحبة أساس الدعوة إلى الله
""";
  static const String elmTextTwentySixPageEleven_11 = """
️المؤمن الفقير خير من كل مستكبر
""";
  static const String elmTextTwentySixPageEleven_12 = """
️المستكبر المترف كافر بنص القرآن
""";
  static const String elmTextTwentySixPageEleven_13 = """
️عندما اخبرنا الله عن فرعون وملإيه قال
""";
  static const String ayahHadithTwentySixPageEleven_2 = """
          فاستكبروا وكانوا قوماً مجرمين
""";
  static const String ayahHadithTwentySixPageEleven_3 = """
          فاستكبروا وكانوا قوماً عالين
""";
  static const String ayahHadithTwentySixPageEleven_4 = """
          واستكبر هو وجنوده
""";
  static const String subtitleTwentySixPageEleven_1 = """
️فرعون استكبر واستعلى
""";
  static const String elmTextTwentySixPageEleven_14 = """
فقال انا ربكم الأعلى فأخذه الله نكال الآخرة والأولى العلماء قالوا بدأ الله بكلمة الآخرة، لأن الكلمة الثانية أشد كفراً، والأولى أقل
 لأنه في الأولى ماذا قال:
""";
  static const String ayahHadithTwentySixPageEleven_5 = """
          ماعلمت لكم من إله غيري
""";
  static const String elmTextTwentySixPageEleven_15 = """
كلام فيه تحفظ فيه اعتدال، أي بحسب معلوماتي، وبحسب علمي المتواضع، أي في حدود علمي ليس في الدنيا إله غيري، هذا كلام كفر، ولكنه أقل من قوله
""";
  static const String ayahHadithTwentySixPageEleven_6 = """
          انا ربكم الأعلى
""";
  static const String elmTextTwentySixPageEleven_16 = """
وماذا قال في الآخرة؟
""";
  static const String ayahHadithTwentySixPageEleven_7 = """
          فقال أنا ربكم الأعلى
          فأخذه الله نكال الآخرة والأولى
""";
  static const String subtitleTwentySixPageEleven_2 = """
️من وصايا لقمان الحكيم
""";
  static const String ayahHadithTwentySixPageEleven_8 = """
ولا تُصعر خدك للناس
""";
  static const String elmTextTwentySixPageEleven_17 = """
أي كبراً وعجباً واختيالاً، واحتقاراً
""";
  static const String ayahHadithTwentySixPageEleven_9 = """
ولا تمشي في الأرض مرحاً
""";
  static const String elmTextTwentySixPageEleven_18 = """
إذا جائتك الدنيا كما تشتهي إياك أن تحملك الدنيا على أن ترقص طرباً
أياك والكبرياء والعلو فإن الدنيا تزول
""";
  static const String ayahHadithTwentySixPageEleven_10 = """
إن الله لا يُحب كل مختال فخور
""";
  static const String ayahHadithTwentySixPageEleven_11 = """
وأقصد في مشيك واغضض من صوتك إن أنكر الأصوات لصوت الحمير
""";
  static const String elmTextTwentySixPageEleven_19 = """
القصد هو الإعتدال، لا تمش في الأرض ذليلاً خانعاً، ولا تمش مفتخراً، مختالاً متكبراً
""";
  static const String elmTextTwentySixPageEleven_20 = """
️المؤمن يُعرف من خُلُقه الحسن
في حركاته، وسكناته، في أخلاقه، في مواقفه، في تصرفاته، متميز
""";
  static const String elmTextTwentySixPageEleven_21 = """
️قاصمة من قواصم الظهر
الجمع بين المظهر الديني والسلوك المنفر
أخطر إنسان في المجتمع هو الإنسان الذي له مظهر ديني، أو هوية دينية، أو خلفية دينية، أو انتماء ديني، ويسيء إلى الناس، أخطر إنسان، لأنه مِعول يُهدم به الدين
""";
}
