class ElmTextDersSixteen {
  /*------------- page 1 -------*/
  static const String titleOne = """
المرأه الصالحه ودورها في المجتمع
--------------------------
 """;
  static const String subtitleOne1 = """

دور المرأه بين تيه الفلسفة الوضعية ونور الإسلام 
 """;
  static const String elmTextDersSixteenOne1 = """
للمرأة دور خطير في الحياة ، ولدور المرأة فلسفة خاصة في أي فكر ، أو أي نظام ، أو أي اتجاه ، ولكن المسلم يستقي عقيدته من كتاب الله ، ويستقي منهجه من كتاب الله ، فأي مبدأ ، أي مذهب وضعي ، أي فكر وضعي ، أي نظام وضعي ، له أن يُفلسف دور المرأه مايشاء ، ولكن المُعول عليه هو النظام الإلهي ، نظام خالق الكون ، أنت بإمكانك أن تكتب مبادئ ، وتقول : المرأة يجب أن تعمل كذا وكذا وكذا 
هذا كلامك ، وهو شيئ جميل 
 """;
  static const String ayahHadithOne1 = """
 ذَٰلِكَ قَوْلُهُم بِأَفْوَٰهِهِمْ ۖ
""";
  static const String elmTextDersSixteenOne2 = """
هذه كلمة تقولها بفمك ، لكن ياترى هل هي مطابقة للواقع ؟ هل هي مؤدية إلى نتائج عملية إيجابية ، أم هي مدمرة ؟ أي إنسان بإمكانه أن يقبع في غرفة ، وأن يكتب مبادئ ، ويقول لك : أنا ارى أن تكون المرأة في الموقع الفلاني ، أو الموقع الفلاني ، وأن تفعل كذا ، وأن تخرج كذا ، وأن تعمل كذا ، هذا شيئ يمكن أن يقوله كل إنسان ، ولكن هذا الكلام يبقى كلام بشر ، إن أصاب في جهةٍ يسيرة أخطأ في جهاتٍ كثيرة ، وإن دغدغ عواطف فئةٍ من الناس فقد فجر مشاعر فئات كثيرة ، ولكن المعول عليه في موضوع خطير كموضوع المرأة هو خالق الكون الذي خلقها ، خالق الكون الذي أنزل القرآن الذي لا يأتيه الباطل من بين يديه ولا من خلفه هو المعول عليه

""";
  static const String subtitleOne2 = """
موقف الإسلام من المرأة  
""";
  static const String elmTextDersSixteenOne3 = """
المرأة مساوية للرجل تكليفاً وتشريفاً 
مساوية للرجل تماماً ، مساوية للرجل تماماً في التكليف وفي التشريف وفي المسؤلية ، لكن المرأة لها خصائص نفسية وجسمية واجتماعية ، وللرجل خصائص نفسية وجسمية واجتماعية وعقلية  
كل طرف خصائصه كمال في حقه ، فالمرأة صُممت لتكون زوجة وأماً ترعى أولادها ، فقد أعطاها الله من العاطفة الشيئ الكثير ، أعطاها القلب الكبير ، أعطاها المشاعر المرهفة ، أعطاها الحُب ، أعطاها العطف ، أعطاها الاهتمام ، والرجُل لأنه خُلق ليكسب الرزق أعطاه الله ضعفاً في عواطفه ونماءً في عقله وملكاته ، فصفات الرجل العقلية والجسمية والنفسية والإجتماعية كمالٌ فيه ومعينة على أداء مهمته ، وصفات المرأة الجسمية والعقلية والاجتماعيه والنفسية كمال فيها ومعينة على أداء مهمتها ، المرأة مساوية للرجل وأية نظرةٍ أخرى نظرة جاهلية الإسلام منها بريء
""";
  static const String ayahHadithOne2 = """
يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَىٰ نُورُهُم بَيْنَ أَيْدِيهِمْ
""";
  static const String elmTextDersSixteenOne4 = """
لو ذكر الله تعالى المؤمنين فقط لفُهم معها والمؤمنات !  ولكن الله تعالى أراد أن يذكر المؤمنين والمؤمنات ليُبين أن المرأة كالرجل تماماً من حيث التكليف والتشريف والمسؤلية ، فهي ترقى كما يرقى الرجل ، وتؤمن كما يؤمن ، وتحب الله كما يحب ، ويتفضل الله عليها كما يتفضل على الرجل ، ولها عند الله مقام علي كما للرجل ، وكلما اقترب الإنسان من كتاب الله شعر أن المرأة صنوُ الرجل ، فالنساء شقائق الرجال ، تؤمن وترقى بإيمانها ، لذا كان عليه الصلاة والسلام إذا قدمت عليه فاطمة وقف لها ! والمرأة يمكن أن تصل إلى أعلى الدرجات وأقصى الغايات إذا عرفت ربها وأطاعته 
   لذا الله تعالى قال 

""";
  static const String ayahHadithOne3 = """
يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ    

وقال تعالى 
 رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ
 رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ
  فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ
  
""";
  static const String elmTextDersSixteenOne5 = """
فالمساواة الحقيقيه بين المرأة والرجل إنما هي في التكليف والتشريف والمسؤلية ، ولكنها ليست كالرجل في بنيتها الفيزيولوجية والنفسية والاجتماعية ، وإن كل خصائصها كمال فيها ، وكُل خصائص الرجُل كمال فيه ، وهما متكاملان  
فقد جعل الله كل منهما سكناً للآخر وهذه حكمة الله أما إذا غيرنا خلق الله عز وجل ، ودفعنا المرأة إلى التشبه بالرجال فإننا نكون بذلك قد شوهنا أنوثتها
قال تعالى 
""";
  static const String ayahHadithOne4 = """

إِنَّ الْمُسْلِمِينَ وَالْمُسْلِمَاتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ وَالْحَافِظِينَ فُرُوجَهُمْ وَالْحَافِظَاتِ وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا
 """;
  static const String elmTextDersSixteenOne6 = """

لو أن الله سبحانه وتعالى قال 
 إن المسلمين ، والمؤمنين ، والقانتين ، والصادقين ، والصابرين ، والخاشعين والمتصدقين ، والصائمين ، والحافظين فروجهم ، والذاكرين الله كثيراً أعد الله لهم مغفرة وأجراً عظيما

لو أنه ألغى الأسماء المؤنثه فما الذي يحصل؟ المعنى يبقى شاملاً الذكور والإناث على التغليب لإن الفاظ التذكير تشمل الفاظ التأنيث على سبيل التغليب ، وهذه قاعدة معروفة في اللغة
إذاً ما الحكمة من التفصيل بالتذكير والتأنيث أراد الله عز وجل بهذه الآية أن يؤكد على أن المرأة كالرجل تماماً في التكليف وفي التشريف ، مكلفة بالإسلام ، وبالايمان ، وبالقنوت ، وبالصبر ، والخشوع ، والصدقة ، والصوم ، وحفظ الفرج ، وذكر الله ، كالرجل تماماً ، وهذا يؤكده أيات أخرى
 يقول الله عز وجل
""";
  static const String ayahHadithOne5 = """

مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ 
[النحل: 97]
""";
  static const String footerOne = """
\n---------------------\n
""";

/*-----------    page 2     -------------*/
  static const String elmTextDersSixteenTwo1 = """
ولو أن الله عز وجل قال: من عمل صالحاً وهو مؤمن ، فهو بهذا يعني من ذكر أو انثى ، فماذا جاء ب( من ) البيانية ، من ذكر أو أنثى ليؤكد لنا أن الذكر كالأنثى ، أو ان الأنثى كالذكر ، مكلفة ومشرفة ، بل إن الأنثى المؤمنة لها مكانة عند الله تزيد على ألف رجل ، أو عن مئة الف رجل عاص ، لكن هُناك تنبيه مهم : وليس الذكر كالأنثى
يقول الله سبحانه وتعالى في آية كريمة أخرى

""";
  static const String ayahHadithTow1 = """
 وَلَيْسَ الذَّكَرُ كَالْأُنْثَى
  [آل عمران: 36]
""";
  static const String elmTextDersSixteenTwo2 = """

تعني أن للمرأة خصائص ؛ في عقلها ، وفي نفسها ، وفي بُنيتها الإجتماعيه ، وفي قوامها ، وفي بُنيتها العضوية والفسيولوجية تميزها عن الرجل ، وأن للرجُل عقلية ، ونفسية ، وبنية اجتماعية ، وخصائص فسيولوجية تميزه عن المرأة ، وهذا معنى قوله تعالى  
  """;
  static const String ayahHadithTwo2 = """

 وَلَيْسَ الذَّكَرُ كَالْأُنْثَى
""";
  static const String elmTextDersSixteenTwo3 = """

وما في الأرض من فساد اجتماعي إلا بسبب أن نضع الرجل مكان المرأة ، وأن نضع المرأة مكان الرجل 
 لذلك
 """;
  static const String ayahHadithTwo3 = """
لَعنَ رسُولُ اللَّهِ ﷺ المُتَشبِّهين مِن الرِّجالِ بِالنساءِ، والمُتَشبِّهَات مِن النِّسَاءِ بِالرِّجالِ
 رواه البخاري

""";
  static const String subtitleTwo1 = """
الرجال قوامون على النساء 
-------------------
""";
  static const String elmTextDersSixteenTwo4 = """
هذه المؤسسة التي هي الأسرة فيها مساواة ك
املة بين أفرادها ، وفيها حب وتقدير وكرامة ، لكن هذه المؤسسة تحتاج إلى قائد ، وصاحب قرار ، وتحتاج لإنسان واسع الأفق ، حريص على هذه المؤسسة ، أن يقول في الوقت المناسب لا ، وأمره نافذ ، فالله سبحانه وتعالى بحكمته هيأ الزوج بقدراته العقلية وصفاته النفسية وخصائصه الأجتماعية والجسدية ، وبما أنفق من ماله أن يكون صاحب القرار ، وقواماً على هذه الأسرة  
شائت إرادة الله في نظام الزوجية أن يكون الرجل صاحب القرار ، لأن الله هيئه فكرياً وجسمياً واجتماعياً ، ونفسياً ليكون قائد هذه الأسرة ، وشائت إرادة الله أيظاً أن تكون المرأة تابعة للرجل في العلاقة الزوجية والأسرة ، لما هيأه الله به من خصائص فكرية ، واجتماعية ، ونفسية ، وجسمية ، هذا هو التصميم الألهي  
""";
  static const String ayahHadithTwo4 = """

   ( الرجال قوامون على النساء )
""";
  static const String elmTextDersSixteenTwo5 = """

القرآن الكريم رسم أدوار للذكر والأنثى حينما نحترمها نقطف ثماراً يانعه

لكن المشكلة أن الإسلام منهج كامل ، فإذا أردنا أن نأخذ من الإسلام بعض بنوده ، ومن الحياة المعاصرة التي لا ينتظم الإسلام دقائقها بعض البنود نقع في إشكال ، فالتي تعمل ، وتأتي إلى البيت الساعة الثانية منهكة القوى ، أعصابها متوترة ، تعاني مايعاني الرجل من مشكلات في العمل ، ومن منافسة ، ومن قضايا تحتاج إلى معالجة ، ومن تجبر بعض الأشخاص ، وغير ذلك ... فتأتي إلى البيت منهكة متعبة ، وعليها أن تطبخ أيظاً ، وعليها أن تربي ، فأعصابها متوترة دائماً ، لم تعد سكناً له ، الآن الدخل من يأخذه ، هو أم هي؟ 
تقول له :  هذا لي ، وهو لها ، لكن لم يأخذ منها كل اهتمامها ، أربعة أخماس اهتمامها لعملها ، فهناك تداخل ، الحياة المعاصرة فيها تداخل ، لو أن النساء كن متفرغات لأزواجهن ، متفرغات لتربية الأولاد ، حينما تدفع المرأة بإبن إلى المجتمع صحيحة عقيدته ، صحيح جسمه ، سليمة أخلاقه ، إنها تقدم أكبر خدمة للمجتمع ، بل إن أرقى مرتبة تكتب على بطاقة المرأة في بعض البلاد ، أرقى رتبة تكتب على بطاقة المرأة سيدة منزل ، إنها متفرغة لتربية أولادها ، هذا الطفل سيغدو عالماً ، سيغدو قائداً ، سيغدو باحثاً ، سيغدو مصلحاً ، من يربيه في البيت ، أيعقل أن يُترك للطريق ؟ لأصدقاء السوء ؟ 
لخادمة لا تفقه في التربية شيئاً ؟ لذلك حينما تتفرغ المرأة لتربية أولادها تكون قد حققت الهدف الذي من أجله خلقت ، يفهم كثير من الناس أن جلوس المرأة في البيت يعني أنها جاهلة ، لا ، قد تكون الزوجة في أعلى مستوى ثقافي ، وقد تكون في أعلى درجات الإيمان ، لكنها متفرغة لزوجها وأولادها لذلك الإبن يتعلم من أمه كل شيئ ، لذلك هناك أدوار رسمها القرآن الكريم ، حينما نحترمها نقطف ثماراً يانعة ، أما حينما لا نحترمها ، ونريد أن تنافس المرأة الرجل في كل شيئ تفقد شيئين ؛ تفقد السباق ، وتفقد أنوثتها
""";
  static const String footerTwo = """
\n---------------------\n
  """;

/*------------------ page 3 ----------*/
  static const String subtitleThree1 = """
المرأه الصالحة هي حسنة الدنيا  
-----------------------
 """;
  static const String ayahHadithThree1 = """
فَالصَّالِحَاتُ قَانِتَاتٌ حَافِظَاتٌ لِّلْغَيْبِ بِمَا حَفِظَ اللَّهُ ۚ
""";
  static const String elmTextDersSixteenThree1 = """

أي ملتفتات إلى الله ، منقطعات لله عز وجل  
كانت الصحابية الجليلة تقف على باب البيت قبل أن تودع زوجها ، تقول له : اتق الله فينا ، نصبر على الجوع ولا نصبر على الحرام
كم من زوجة الآن تضغط على زوجها إلى أن تحمله على كسب المال الحرام ، إلى أن تحمله على أن يرتشي من أجل أن يلبي غرورها ، وكم من امرأة تهمل زوجها ، وتجلس عند بناتها أسابيع وأسابيع ، ولا تعبأ بزوجها ، ولا بطعامه ، ولا بشرابه ، ولا براحته ، هناك تقصير كبير
هذا الفساد الذي نراه من تطلع الأزواج إلى غير زوجاتهم هو بسبب تقصير الزوجات ، وهذا الفساد الذي نراه من تفلت الزوجات بسبب تقصير الأزواج ، لو أن الزوج عرف مهمته ، وعرفت مهمتها ، وتعاونا على تأسيس عش مسلم ينتج عناصر مؤمنه للمجتمع لكنا في حال غير هذا الحال
""";
  static const String subtitleThree2 = """

المرأة نصف المجتمع البشري  
---------------------
""";
  static const String elmTextDersSixteenThree2 = """
فلذلك هذه التي لها دور خطير خطير في المجتمع البشري
أولاً : من حيث الحجم نصف البشر من النساء ، نصف المجتمع
ثانياً : ليس نصفاً فقط عددياً ، بل نصفاً مكملاً للنصف الأول
لا تقوم حياة النصف الأول إلا بالتعاون مع النصف الثاني ، وطبيعة المرأة محببة للرجال هكذا قال الله عز وجل
""";
  static const String ayahHadithThree2 = """

زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوَاتِ مِنَ النِّسَاءِ 

""";
  static const String subtitleThree3 = """
المرأة صُممت لتكون أماً  
------------------
""";
  static const String elmTextDersSixteenThree3 = """

حينما صُممت المرأة صُممت لتكون أماً تربي أولادها ، وليس في حياة الأولاد شيئ يفوق عظمة الأم ، في حياتهم طبعاً ، قلب الأم لا يوصف ، هي إنسان تعيش لغيرها ، إنها الأم ، تعيش لأولادها ؛ تشقى ليسعدوا ، تجوع ليشبعوا ، تخاف ليطمئنوا ، تموت ليحيوا ، هي الأم ، حينما صُممت المرأة صُممت لتكون أماً ، أو لتكون زوجة تملأ قلب زوجها سعادة ، تملأ البيت جمالاً ، ورقة ، وتألقاً بخدمتها لزوجها ولأولادها

الأصل بقاء المرأة في بيتها
فالأصل في المرأة أن تكون في بيتها ، هذا هو الأصل ، المرأة اللتي تهز سرير ابنها بيمناها تهز العالم بيسراها ، لأنه كلما كانت اللبنة الأولى ، وهي الأسرة ؛ صحية متوازنة ، منتظمة ، مستقيمة كان الإنتاج خارج البيت مُضاعفاً ، فنجاح ألرجل في عمله أساسه نجاحه في بيته  إنتاج ألرجل أساسه راحة قلبه من طرف بيته ، لذلك حينما أمر الله سبحانه وتعالى الإناث ، أو نساء النبي خاصة ، والنساء عامة أن يقررن في بيوتهن ، فلأن البيت هو مكان تربية الأولاد ، هو مكان العناية باللبنة الأولى ألا وهي الأسرة 
""";
  static const String ayahHadithThree3 = """

وَقَرْنَ فِي بُيُوتِكُنَّ 
""";
  static const String elmTextDersSixteenThree4 = """

ولا تعني الآيه أنها ممنوعة من الخروج ، لكن تخرج للضرورة 
""";
  static const String ayahHadithThree4 = """

 قَالَ مَا خَطْبُكُمَا قَالَتَا لَا نَسْقِي حَتَّى يُصْدِرَ الرِّعَاءُ وَأَبُونَا شَيْخٌ كَبِيرٌ﴾ [القصص: 23]
""";
  static const String elmTextDersSixteenThree5 = """

أستنبط العلماء من هذا : أن المرأة لا يصح أن تخالط الرجال ، ولا أن تزاحمهم ، بل عليها أن تقف بعيداً عنهم ، وعليها ايظاً ألا تخرج من بيتها لقضاء حوائج المنزل ، إذا كان أبوها أو أخوها ، أو زوجها رجلاً قوياً قادراً على كفايتها ، أما إذا كان مريضاً فلها العُذر 
""";
  static const String ayahHadithThree5 = """

  ( وأبونا شيخ كبير ) 
""";
  static const String elmTextDersSixteenThree6 = """

فلو أن امرأة مات زوجها ، وأولادها صغار ، واضطرت إلى أن تخرج من بيتها لشراء حوائجها فمعها العذر الكافي ، ولكن امرأة لها زوج في البيت ، وتخرج هي لتشتري اللحم والفاكهة والحاجات ، وزوجها أو أخوها أو ابنها في البيت ، فهذا ليس من أخلاق المسلمين
""";
  static const String subtitleThree4 = """

من ضوابط خروج المرأة 
-------------- 
""";
  static const String ayahHadithThree6 = """
َ وَلَا تَبَرَّجْنَ تَبَرُّجَ الْجَاهِلِيَّةِ الْأُولَى

""";
  static const String elmTextDersSixteenThree7 = """
بالمعنى الدقيق : ولا تُظهرن مفاتنكن ، أي أن الله سبحانه وتعالى أكرم المرأة فاسبغ عليها شيئاً من الجمال ، بعض الجمال ، أو أكثر الجمال ، هذا الجمال حينما أسبغه الله عليها جعله سبباً لسعادة زوجها بها ، جعل هذا الجمال ليسكُن زوجها إليها ، فإذا استخدم هذا الجمال لغير ماخلق له ، لغير زوجها ، للأجانب ، لمن في الطريق فقد أضلت المسعى ، فالله سبحانه وتعالى أراد أن تكون هذه المرأة شيئاً مصوناً ، بعيداً عن وحول الطريق بعيداً عما تقع عليه العيون ، فحينما سمح لها أن تخرج ، أمرها أو نهاها عن أن تتبرج ، والتبرج إظهار مايجب إخفاؤه عن الأجانب ، إظهار مايجب إخفاؤه في الطريق
""";
  static const String subtitleThree5 = """

المرأة نقطة ضعف الرجل  
------------------
""";
  static const String elmTextDersSixteenThree8 = """
إذا خرجت المرأة سافرة ، فاتنة ، تعرض ما أودع الله فيها من مفاتن لترضي زوجها أصلاً ، وتكون مسعدة له ، إذا أظهرت هذه المفاتن للناس جميعاً ، اشتعلت الفتن واستعرت ، وضاع المجتمع ، وانحرف الشباب ، وتحسر الرجال ، ودُمر المجتمع ، فلذلك موضوع المرأة موضوع خطير خطير ، إذاً المأخذ الأشد على دين الإنسان ، أو المأخذ الأكبر أهمية على دين الإنسان موضوع المرأة ، يكفي أن يطلق الإنسان بصره فيما حرم الله عليه ، أين صلاته؟ صار الطريق إلى الله غير سالك ، يكفي أن يستمتع بامرأة لا تحل له ؛ إن بالنظر ، أو بالكلام ، أو بما شاكل ذلك ، صار الطريق إلى الله غير سالك
""";
  static const String ayahHadithThree7 = """

يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ وَبَنَاتِكَ وَنِسَاءِ الْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِنْ جَلَابِيبِهِنَّ 

""";

  static const String elmTextDersSixteenThree9 = """
الحقيقة قد يكون إيمان الرجل في قلبه ، لكن المرأة إيمانها ظاهر وباطن معاً ، إيمانها في حجابها ، فإذا برزت للرجال من دون حرج ، واختلطت مع الرجال فكأنها تتخلى عن هويتها ، وكأنها تتخلى عن شخصيتها المسلمة ، وكأنها تُعلن أنها لا تأتمر بأمر الله
القرآن الكريم أمر بستر العورات ، ثم أمر بالحجاب ، ثم أمر بغض البصر ، وعدم إبداء الزينة إلا لرجال جاء ذكرهم في سورة النور ، الأمر بستر العورات أولاً ، ثم الأمر بحجاب النساء المؤمنات ثانياً ثم الأمر بغض البصر وعدم إبداء الزينة للأجانب ثالثاً ، فكأن هذه الآية جاءت في الوسط ، وكأن الله سبحانه وتعالى درج أحكام الحجاب بحسب الظروف وبحسب تطور الدعوة الإسلامية
الملاحظه الدقيقه أن المرأة التي تترك الحجاب إنكاراً له ، إنكاراً لفرضيته فقد كفرت ، وإذا تركته تقليداً للأجانب فقد فسقت وعصت ، لكن المرأة المؤمنة تعتقد بوجوبه وتلتزمه ، إذا ترك الحجاب إنكاراً لفرضيته فهذا كفر ، وإذا ترك الحجاب تقليداً للأجانب فهذا فسق وفجور ، أما حينما تطبق المرأة أمر الله عز وجل وتحتجب فهذا هو الحد الأدنى في إيمانها
""";
  static const String footer3 = """
\n---------------------\n
""";
}
