class ElmTextTwenty {
  //---- page 1
  static const String elmTextTwentyOne_1 = """
الذي لا شك فيه أن كلمة التقوى وردت في القرآن الكريم في أكثر من ثلاثمائة موضع ، والأحاديث الشهيرة والصحيحة تؤكد في مجملها أن التقوى جماع كل خير 
""";
  static const String titleTwentyOne = """
ماهي التقوى ؟ 
""";

  static const String elmTextTwentyOne_2 = """
فما هي التقوى ؟ الحقيقة أن التقوى مشتقة من فعل ثلاثي ، الفعل هو وقى ، والوقاية تكون من شيئ خطير ، فربنا سبحانه وتعالى يقول 
""";
  static const String ayahHadithTwentyOne1 = """

يا ايها الناس اعبدو ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون 

""";

  static const String subtitleTwentyOne_1 = """
العبادة هي سبيل التقوى 
""";

  static const String elmTextTwentyOne_3 = """
معنى ذلك أن العبادة هي سبيل الوقاية ، فأنت إذا دعوت إلى الله يجب أن تعتمد على حاجات الإنسان الفطرية ، وما منا واحد إلا وهو في حاجةٍ ماسة جداً إلى أن ينجو من شقاء الدنيا وعذاب الآخرة ، ففي نفس كل منا ميل جامح وحاجة مُلحة إلى النجاة 

والله سبحانه وتعالى يقول 
 """;

  static const String ayahHadithTwentyOne_2 = """

ياايها الناس اعبدوا ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون 

""";
// page 2
  static const String subtitleTwentyTwo_1 = """
في اللغة العربية هناك قاعدة : 
""";

  static const String elmTextTwentyTwo_1 = """
أن الفعل إذا حُذف المفعول به المتعلق به أطلق الفعل ، تتقون ماذا ؟ 
تتقون كُل خطر ، كل مكروه ، كل منزلق ، كل شقاء ، كل عذاب ، كل ضيق ، كل قلق ، كل مصيبة 
""";

  static const String ayahHadithTwentyTwo_1 = """

ياايها الناس اعبدوا ربكم الذي خلقكم والذين من قبلكم لعلكم تتقون 

  """;

  static const String elmTextTwentyTwo_2 = """
إذاً لا سبيل إلى تحقيق النجاة ، ولا سبيل إلى تحقيق السلامة ، ولا سبيل إلى أن يبتعد الإنسان عن شقاء الدنيا وعذاب الآخرة إلا بطاعة الله عز وجل 
لذلك فسر بعضهم التقوى بأنها إتقاء عذاب الله بطاعته 
أي لا منجأ منك إلا إليك 
لايستطيع الإنسان أن ينجو من التأديب الالهي ، ولا من المعالجة الإلهية ، ولا من العقاب الإلهي ، ولا من القضاء الذي يقضيه الله عز وجل للإنسان إلا بطاعة الله عز وجل 
هذه النقطة الأولى 

إذاً طاعة الله عز وجل سبيل إلى التقوى 
""";

// page 3
  static const String subtitleTwentyThree_1 = """
الإنسان له بناء مؤسس على تقوى الله : 

  """;
  static const String elmTextTwentyThree_1 = """
نقطة ثانية ، الإنسان له بناء ، معنى البناء أنت لك منظومة قيم ، في الموضوع الفلاني لك موقف ، في علاقتك بالنساء لك موقف ، في علاقتك بكسب المال لك موقف ، في علاقتك بإنفاق المال لك موقف ، في علاقتك بالجوار لك موقف ، في علاقتك بالبيع والشراء لك موقف ، في علاقتك بالشهوة التي أودعها الله فيك لك موقف ، هذه المواقف تنبع من رؤية أو من قيم ، 
فالله سبحانه وتعالى يقول 
""";
  static const String ayahHadithTwentyThree_1 = """

  أفمن أسس بُنيانه 

""";
  static const String elmTextTwentyThree_2 = """
أنت لك بناء ، الأسرة لبنة ، العمل لبنة ، علاقتك بذاتك لبنة ، علاقتك بالخالق لبنة ، علاقتك بأهلك ؛ بالوالد ، بالوالدة ، بالإخوة ، بالأخوات ، بالأصهار ، كل موقف ، وكل حركة وكل سكنة تنبع من رؤية أو من قيمة ، 
فالمؤمن أسس بنيانه على تقوى من الله ورضوان ، إذاً فالله سبحانه وتعالى لا بد من أن يحميه 

""";
// Page 4
  static const String subtitleTwentyFour_1 = """

غير المؤمن بناءُه مؤسس على الشهوة والمصلحة
""";
  static const String elmTextTwentyFour_1 = """
غير المؤمن أسس بنيانه على الشهوة ، على المصلحة ، على انتهاز الفُرص ، على القنص ، على حب الذات ، على الأنانية ، هذا البناء المبني على غير تقوى الله عز وجل كأنه على شفا جرفٍ هار فانهار به في نار جهنم ، فكل إنسان له بناء ، إما أن يبني هذا البناء على تقوى الله ورضوان ، وإما أن يبني هذا البناء على شفا جرفٍ هار فانهار به في نار جهنم 
""";
  static const String subtitleTwentyFour_2 = """

في الكون إله واحد يستحق العبادة 

""";
  static const String elmTextTwentyFour_2 = """
الشيئ الثاني أن الإنسان حينما يفكر ، ففي هذا الكون العظيم حقيقة كبرى ، حقيقة وحيدة ، حقيقة ليس بعدها حقيقة هي الله سبحانه وتعالى ، فهل من جهة بالكون تستحق أن يخشى عذابها ، أو ان ترجو رحمتها غير الله ؟ 
فهل في الكون جهة تستحق أن يرجى ماعندها ، وأن يخشى عقابها غير الله عز وجل ؟ 
 """;
  static const String ayahHadithTwentyFour_1 = """

  الله لا اله الا هو الحي القيوم 

""";
// page 5
  static const String elmTextTwentyFive_1 = """
أي قيام الشيئ بالله ، حياته بالله ، كن فيكون زُل فيزول 
إذاً في الكون حقيقة وحيدة ليس بعدها حقيقة هي الله سبحانه وتعالى ، أيُعقل أن تخشى غير الله ؟ 
أيعقل أن ترجو غير الله ؟ 
أيعقل أن تطمع بعطاء غير عطاء الله ؟ 
أيعقل أن تخاف من غير الله ؟ 
أيعقل أن تتقي عذاب غير الله ؟ 
أيعقل أن ترجو رحمة غير الله ؟ 
لذلك ربنا عز وجل في آية صغيرة قال: 
""";
  static const String ayahHadithTwentyFive_1 = """

  أفغير الله تتقون 

فما لكم كيف تحكمون 

""";
  static const String elmTextTwentyFive_2 = """
كيف تفكرون ؟ كيف تتأملون ؟ 
ربنا عز وجل طمأنك فقال على لسان أحد رسله: 
""";
  static const String ayahHadithTwentyFive_2 = """

فكيدوني جميعاً ثم لا تنظرون اني توكلت على الله ربي وربكم ما من دابة الا هو اخذ بناصيتها 

""";
  static const String elmTextTwentyFive_3 = """
قال لك: 
""";

  static const String ayahHadithTwentyFive_3 = """
  واليه يرجع الأمر كله 
""";
  static const String elmTextTwentyFive_4 = """
قال لك: 
""";
  static const String ayahHadithTwentyFive_4 = """

  مايفتح الله للناس من رحمة فلا ممسك لها 

""";
  // page 6
  static const String elmTextTwentySix_1 = """
قال لك: 
""";
  static const String ayahHadithTwentySix_1 = """

  له الخلق والأمر 

""";

  static const String elmTextTwentySix_2 = """
قال لك: 
""";
  static const String ayahHadithTwentySix_2 = """

  يد الله فوق ايديهم 

""";
  static const String elmTextTwentySix_3 = """

فإذا خشيت غير الله أو رجوت غير الله فلست متقياً 
أي: لم تتق الله عز وجل 
""";
  static const String ayahHadithTwentySix_3 = """

    أفغير الله تتقون 

""";
  static const String elmTextTwentySix_4 = """
أنت في قبظته ، ولماذا عليك أن تتقي الله ؟ 
لأن الله عليم بك ، وبكل مايحيط بك.. 
""";
// page 7
  static const String ayahHadithTwentySeven_1 = """

  واتقو الله واعلمو ان الله مع المتقين 

""";
  static const String elmTextTwentySeven_1 = """
إذا كان الإنسان مراقباً فإنه يخافُ هذا الذي يراقبه ، فربنا عزوجل رقابته عليك مستمرة 
فما دامت رقابة الله عليك مستمرة ألا ينبغي أن تتقي الله ؟ 
""";
  static const String ayahHadithTwentySeven_2 = """

  واتقوا الله واعلموا ان الله بكل شيئ عليم 

  واتقوا الله إن الله سريع الحساب 

  واتقوا الله واعلموا انكم اليه تحشرون 
""";
  static const String elmTextTwentySeven_2 = """
عليم بكل شيئ ، شديد العقاب ، سريع الحساب  
إليه نُحشر  
ألا تكفي هذه الدوافع كي تتقي الله عزوجل ؟ 
""";
  static const String ayahHadithTwentySeven_3 = """

قُل سيروا في الأرض ثم انظروا كيف كان عاقبة المكذبين 

""";
// page 8
  static const String subtitleTwentyEight_1 = """
الله علم عباده طريق التقوى 
""";
  static const String elmtTextTwentyEight_1 = """
النقطة الدقيقة أن الله عزوجل علمك 
علمك من خلال هذا العقل الذي اودعه الله فيك 
وعلمك من خلال هذا الكون الذي نصب فيه الأدله على عظمته 
وعلمك من ملامح الفطرة التي فطرك عليها 
وعلمك من خلال هذا الكتاب الكريم الذي أنزله على النبي العظيم 
وعلمك من خلال السنه النبوية المطهرة التي بينت هذا الكتاب 
وعلمك من الحوادث اليومية ،  هذه الحوادث اليومية فيها تعليم للإنسان ،
تشف هذه الحوادث عن قدرته ، وعن حكمته ، وعن عدالته ، 
وعلمك من خلال دعوة الدعاة 
وإلهام الملائكة ، فأنت في حالة تعلم مستمر ، 
والله سبحانه وتعالى يعلمك دائماً ، إن في الكتاب ، وإن في السنة ، وإن في الكون ، وإن في العقل ، وإن في الفطرة ، وإن في دعوة الدعاة ، وإن في الهام الملائكة 
أنت في حالة تعليم مستمر ، 
فلم لا تتقي الله عزوجل ؟ 
هذا معنى قوله تعالى 
""";
// page 9
  static const String ayahHadithTwentyNine_1 = """

  واتقوا الله ويعلمكم الله

""";
  static const String elmTextTwentyNine_1 = """
نحن نشعر أننا في قبضة الله عز وجل ، كل أجهزتك ، كل احوالك ، ورأسُ مالك عقلك ، 
نقطة دم صغيرة جداً إذا تجمدت في بعض شرايين المخ يففد الإنسان عقله دفعة واحدة 
 أو يفقد ذاكرته
أو يفقد سمعه أو بصره 
أو يفقد حركته 
إذاً أنت في قبضة الله 
بجسمك 
او بروحك 
وبنفسك 
وببيتك 
وبأهلك 
وبأولادك 
وبعملك 1
وبمن حولك 
وبمن فوقك 
وبمن تحتك 
لذلك: 
""";
  static const String ayahHadithTwentyNine_2 = """

   أفغير الله تتقون 

""";
// page 10
  static const String titletwentyten = """
الله هو أهل التقوى  
""";

  static const String elmTextTwentyTen_1 = """
لكن هناك معنى دقيق جداً وهو أنك يجب أن تتقي ربك ، لا لأنك بقبضته فحسب ؛ بل لأنه أهل التقوى وأهل المغفرة 
أي انه رحمن رحيم ، ذوالجلال والإكرام ، ذوالطول والإنعام ، يعلم السر وأخفى ، عفو كريم ، رحمن رحيم ، لطيف رؤوف  
فأنت من جهة تتقي ربك لأنك في قبضته 
ومن جهة ثانية تتقي ربك لأنه أهل التقوى وأهل المغفرة  
سبحان الله فالإنسان يتوق إلى أن يتقرب من إنسان عظيم ، ولكن ألا يتوق إلى أن يتقرب من خالق الأكوان؟ 
خالق الأكوان وضع نظاماً للتعامل معه ، قد يكون شخص عظيم مزاجي الطبع ، وأنت لا تدري كيف تتقرب إليه ، قد يصل إلى قلبه بعض الناس صُدفه أو بظرف طارئة، لكن الله سبحانه وتعالى والخلق كلهم عباده، رسم لهم خطة علاقة منظمه تكون أساساً في تعامل العباد مع خالقهم سبحانه وتعالى، لا كما يتعامل الناس مع شخص ما له مزاجه وظروفه 
""";

// page 11
  static const String titleTwentyEleven = """
الله يحب المتقين
""";
  static const String elmTextTwentyEleven_1 = """
خلاصة هذه العلاقة أن ربنا عز وجل قال 
""";

  static const String ayahHadithTwentyEleven_1 = """

    إن الله يحب المتقين 
    
""";
  static const String elmTextTwentyEleven_2 = """
فالتقوى منهم والعون والحب منه
القضية واضحة كالشمس الله عزوجل يحب المتقين 
 أفلا يحب الإنسان أن يكون محبوباً عند الله عز وجل ؟ 
إذا أحبك إنسان قوي فيما يبدو للناس ، فهذا الإنسان لا ينفعك حُبه ولا يضرك بغضه 
ولكن إذا أحبك الله عز وجل ألقى حبك في قلوب خلقه فكنت عند الله وخلقه محبوباً 
     ينادى له في الكون أنا نحبه 
     فيسمع من في الكون أمر مُحِبنا 
""";
// page 12
  static const String elmTextTwentyTwelve_1 = """
إذاً : إذا اتقيت الله سبحانه وتعالى أحبك الله ، وهل من مرتبة في الكون أرقى من مرتبة القرب من الله 
الدنيا كلها مراتب 
 مراتب مالية، مراتب علمية، مراتب اجتماعية، ومراتب رياضية، يقول لك: معه وسام ذهبي، وهناك معه ميدالية برونزية، مراتب نفسية ومراتب جسمية، ومراتب دينية، ألا تعتقد معي أن أعظم مرتبة ينالها إنسان على وجه الأرض هي القرب من الله، وأن يحبه الله عزوجل؟ 
""";
  static const String ayahHadithTwentyTwelve_1 = """

     إن الله يحب المتقين
     
     """;
  static const String elmTextTwentyTwelve_2 = """
أتق الله أن تعصيه يحبك الله عز وجل
اتق أن تسخطه يحبك
اتق أن تخالف أمره
اتق عقابه بطاعته
اتق عذابه بالاستقامة على أمره
اتق ناره بالعمل لجنته، يحبك
""";

// page 13
  static const String elmTextTwentyTherteen_1 = """
لكن ألا تحب أن يكون الله معك؟ 
""";
  static const String subtitleTwentyTherteen_1 = """
معية الله بالحفظ ملازمة للمتقين: 
""";
  static const String elmTextTwentyTherteen_2 = """
هل تدري أن معية الله نوعان

معية عامة
معية خاصة

الله مع كل مخلوق لقوله تعالى 

""";
  static const String ayahHadithTwentyTherteen_1 = """

    وهو معكم أين ماكنتم 

""";
  static const String elmTextTwentyeTherteen_3 = """
ولكن المعية الخاصة معية الحفظ 
معية الرعاية 
معية النصر 
معية التأييد 
ألا تتمنى أن يكون الله معك؟ 
""";
// page 14
  static const String ayahHadithTwentyFourteen_1 = """

   إن الله مع المتقين 

""";
  static const String elmTextTwentyFourteen_1 = """
ألا يتمنى الانسان أن يكون خالق الأكوان مدافعاً عنه؟ 
ألا تتمنى أن يكون وليك هو الله عز وجل 
الولي يخرجك من الظلمات إلى النور 
يجعل لك مقعد صدق عنده 
يدافع عنك 
يكيد لك 
ألا تتمنى ذلك؟ 
""";
  static const String elmTextTwentyFourteen_2 = """
   والله ولي المتقين 
   إن الله يحب المتقين 
   إن الله مع المتقين 
   والله ولي المتقين 
""";
// page 15
  static const String elmTextTwentyFifteen_1 = """
وربنا عز وجل قال: 
 """;
  static const String ayahHadithTwentyFifteen_1 = """
  
   أم نجعل المتقين كالفجار 

  """;
  static const String elmTextTwentyFifteen_2 = """
فمن السذاجة، ومن الغباء، ومن ضيق الأفق، ومن الجهل أن تتصور أن هذا الذي استقام على أمر الله، وتعرف إلى الله، وأمضى وقتاً في تعلم العلم، وكان منظبطاً، ضبط حواسه الخمس، ضبط مشاعره، ضبط كسبه، ضبط إنفاقه، وكان محسناً، أحسن إلى كل مخلوق 
هذا المتقي الذي يتقي غضب الله، يتقي سخط الله، يتقي عذاب الله، أهذا المتقي أيعقل أن يعامل كالفاجر؟ كالعاصي؟ 
كالذي يفعل المعاصي على قارعة الطريق؟ كالذي يتباهى بالمعصية؟ شيئ مستحيل 
فلو أتيح لك أن تقرأ الآيات القرآنية التي تتحدث عن التقوى لوجدت أن في هذه الآيات معاني كبيرة جداً، وربنا عز وجل أمرنا أن نكون طموحين، يقول بعضهم: أنا اريد مكاناً وراء الباب في الجنة، هذا كلام غيرصحيح، ربنا عز وجل علمنا في القرآن الكريم أن ندعو الله عز وجل ونقول: 
والذين يقولون ربنا هب لنا من ازواجنا وذرياتنا قرة اعين واجعلنا للمتقين إماما 
 """;
  // page 16
  static const String titleTwentySixteen = """
التقوى درجات ومستويات 
 """;
  static const String elmTextTwentySixteen_2 = """
لا ترضى إلا أن تكون إماماً، والتقوى درجات، التقوى مستويات كبيرة جداً
في أدنى مستوياتها أن تتقي عذاب الله بطاعته، هذا الذي يغض بصره عن محارم الله يتقي الله 
هذا الذي يخاف أن يأكل مالاً حراماً يتقي الله 
هذا الذي يخاف أن يكذب يتقي الله 
هذا الذي يخاف أن تصدر منه مخالفة يتقي الله، هذا مستوى
فهذا الرجل المؤمن يحاول أن يطبق أمر الله، هذا نوع من التقوى 
ولكن هناك درجة عالية من التقوى أنك إذا اتقيت الله عزوجل قذف الله في قلبك النور، فهذا سيدنا يوسف، بربك امرأة حسناء ذات منصب وجمال، امرأة العزيز، وغلقت الأبواب، وهو غير متزوج، وليس في بلده، وعبد لها، وليس من مصلحتها أن يفشوا هذا الأمر، وقد أمرته بذلك، لماذا امتنع؟ ماذا رأى حتى قال: معاذ الله؟ رؤية قلبية، هذا هو النور الذي يقذفه الله في قلب المؤمن يرى به الخير خيراً والشر شراً، الحق حقاً والباطل باطلاً، الصواب صواباً والخطأ خطأ، الصحيح صحيحاً والزيف زيفاً، هذا هو النور، 
لذلك فإن الدرجة الأولى أن تقرأ الأحكام 
تقرأ الأوامر 
تقرأ النواهي 
تطبق 
""";
  // page 17
  static const String elmTextTwentySeventeen_1 = """
لا ترضى إلا أن تكون إماماً، والتقوى درجات، التقوى مستويات كبيرة جداً
هذا مستوى من التقوى 
أما المستوى الأعلى أن تجتهد في الإستقامة وأن تجتهد في البذل والتضحية حتى تنعقد الصلة مع الله عزوجل، إذا انعقدت هذه الصلة، فمن خلال هذه الصلة يتجلى الله على قلبك بنوره، عندئذ تصبح مستنير القلب 
فإنها لا تعمى الأبصار ولكن تعمى القلوب التي في الصدور 
عندئذ ترى في المعصية الوبال، والقطيعة، والدمار، والتأخر، والتدهور، والعقاب

وعندئذ تقبل على الطاعة وتبتعد عن المعصية، هذا هو النور الذي قال الله عنه
""";
  static const String ayahHdithTwentySeventeen_1 = """

ياايها الذين آمنو إن تتقو الله يجعل لكم فرقانا 

""";

// page 18
  static const String elmTextTwentyEighteen_1 = """
ياايها الذين امنو اتقو الله وآمنو برسوله يؤتكم كفلين من رحمته ويجعل لكم نوراً تمشون به 
نور تمشي به في الناس، هذا الذي يأخذ ماليس له أعمى هذا الذي يُمتع عينه بما لا يحل له أعمى 
هذا الذي يؤثر نفسه على إخوانه أعمى 
هذا الذي يستضعف إنساناً ويظلمه، يقول لك: هذه مقطوعة ليس لها أحد أعمى، لو أن قلبه استنار بنور الله لرأى أن الله ولي هذه المرأة 
فإذا تجاوز حده معها نكل الله به، هكذا فالمستويات كثيرة جداً
 """;

  // page 19
  static const String titleTwentyNinteen = """
تزكية وتقييم الناس من شأن الله وحده 
 """;
  static const String elmTextTwentyNinteen_1 = """
شيئ آخر وهو موضوع التزكية، موضوع تقييم الذات هذا من شأن الله عزوجل 
مؤمنون كثيرون يخوضون فيما لا حق لهم أن يخوضوا فيه 
تقييم الإنسان من شأن الله عزوجل 
 """;
  static const String ayahHadithTwentyNinteen_1 = """

النبي عليه الصلاة والسلام حينما عاتب أحد أصحابه بقتل إنسان في المعركة قال: لا إله إلا الله، فعن أسامة بن زيد قال: بعثنا رسول الله صل الله عليه وسلم في سرية، فصبحنا الحرقات من جهينة فأدركت رجلا فقال لا إله إلا الله فطعنتُهُ، فوقع في نفسي من ذلك، فذكرتُهُ للنبي صلى الله عليه وسلم، فقال رسول الله صلى الله عليه وسلم:
أقال لا إله إلا الله، وقتلته؟!! 
قال: قلت: يارسول الله إنما قالها خوفا من السلاح، قال: أفلا شققت عن قلبه حتى تعلم أقالها أم لا فما زال يكررها علي حتى تمنيت اني اسلمت يومئذ 

 """;

// page 20
  static const String elmTextTwentyTwenty_1 = """
لذلك الأدب أن تحكم بالظاهر والله يتولى السرائر 
 """;
  static const String ayahHadithTwentyTwenty_1 = """

   وكفى بربك بذنوب عباده خبيراً بصيرا 

 """;
  static const String elmTextTwentyTwenty_2 = """
الأدب أن تمتنع عن إصدار الأحكام على الناس، تقول: هذا من شأن الله وليس من شأن البشر 
لذلك قال ربنا عزوجل: 
 """;
  static const String ayahHadithTwentyTwenty_2 = """

فلا تزكوا أنفسكم هو أعلم بمن اتقى 

 """;
  static const String subtitleTwentyTwenty_1 = """
التقوى خير زاد 
 """;

  static const String elmTextTwentyTwenty_3 = """
الإنسان يتزوج، الإنسان يجمع الأموال، يقول: هذه الأموال تنفعني في خريف العمر
الإنسان أحياناً يبني بناء شامخاً، يقول لك: أريد بيتاً فيه كل جيد وجديد، ينتقي أفضل الأثاث، ينتقي أفضل الكسوة، ينتقي أفضل الأجهزة، وقد يقتني أفضل سيارة، يقول لك: أريد شيئاً جيداً،
كله من نوع الزاد 
تزودت هذه السيارة، هذا البيت، هذا الأثاث
هذه الأجهزة الضخمة، تزودت بأموال تدخرها لوقت خريف العمر، لكن ربنا عزوجل قال بكلمة موجزة، قال 
""";
  static const String ayahHadithTwentyTwenty_3 = """
وتزودوا فإن خير الزاد التقوى 
""";
// page 21
  static const String elmTextTwentyTwentyOne_1 = """
أي أن أعظم زاد تدخره أن تتقي الله، لا أن تعصي الله 
من هنا سيدنا عمر كان إذا أصابته مصيبة قال
""";
  static const String ayahHadithTwentyTwentyOne_1 = """
الحمدلله ثلاثاً الحمدلله إذ لم تكن في ديني 
""";
  static const String elmTextTwentyTwentyOne_2 = """
هذه قاعدة، الدين سليم مالم تعصي الله عزوجل، مالم تقترب من حدوده، مالم تعتد على حدوده، مالم تخرق قواعد الاستقامة، مالم تسيئ إلى إنسان، مالم يكن في عنقك دين لأحد، أو ظلامة لأحد، فقد سلم دينك؟ 

 """;
  static const String subtitleTwentyTwentyOne_1 = """
التقوى سبيل الأمن والعافية والرضا: 
 """;
  static const String elmTextTwentyTwentyOne_3 = """
دائماً وازن.. 
   من اصبح منكم آمناً في سربه 
هذا أمن الإيمان، أنت مطمئن لعدالة الله، أنت مطمئن إلى أن الأمور كلها بيد الله، وأن الله رحمن رحيم، أنت مطمئن إلى أنه لا إله إلا الله، أنت مطمئن إلى أنه لا رافع ولا خافض، ولا معز ولا مذل، ولا معطي ولا مانع، ولا باسط ولا قابض إلا الله 
أنت مطمئن إلى أن الله سبحانه وتعالى يدخرُ لك عنده عطاءً كبيرا 
   ولسوف يعطيك ربك فترضى 
   """;
// page 22
  static const String elmTextTwentyTwentyTwo_1 = """
إذا كنت كذلك فأنت في نعمة لاتعدلها نعمة على وجه الأرض، نعمة أمن الإيمان، وإذا ادعى أحد أن عنده أمناً بسبب الأموال الطائلة فهذا أمن مزيف، لأن الله عزوجل قد يعاجل هذا الإنسان بمصيبة لا قيمة للمال إطلاقاً في حلها، وإذا كان عند الإنسان أمن بحسب صحته الطيبة، وتدريباته ونشاطه، ونظام قاس جداً يتبعه، هذا أمن مزيف
الأمن الحقيقي أن تكون بما في يدي الله أوثق منك مما في يديك، هذا أعلى درجة من درجات الأمن، لذلك: 
""";
  static const String ayahHadithTwentyTwentyTwo_1 = """

عن عبدالله بن محصن الخطمي قال: قال رسول الله صلى الله عليه وسلم: 
من أصبح منكم آمنا في سربه، معافى في جسده، عنده قوت يومه فكأنما حيزت له الدنيا 

""";
  static const String elmTextTwentyTwentyTwo_2 = """
إذا كنت كذلك فقد ملكت الدنيا بكل حذافيرها 
أمن الإيمان، وسلامة الأبدان، وشيئ تقتات به، وانتهى الأمر، لذلك فالمؤمن لو أصابته مصيبة، مادام دينه سليماً، مادامت صحته طيبه، مادمت أفعاله كريمة، فلا شيئ في الدنيا يضيره
  """;

  // page 23
  static const String subtitleTwentyTwentyThree_1 = """
تقوى القلوب أفضل لباس المسلم 
  """;
  static const String elmTextTwentyTwentyThree_1 = """
انظر إلى هذه المعاني الدقيقة، أحياناً تجد إنساناً قد أكرمه الله عز وجل بقوام جميل، بشكل وسيم، قد يكون ذا ذوق رفيع في ارتداء الثياب، له أذواق رفيعة جداً، قد يكون له ذوق عال جداً في أقتناء الأثاث، قد يختار سيارة جيدة، قد يعتني بها عناية بالغة، قد يُلبسُ أولاده أجمل الألبسة، قد يفرش بيته بأجمل الأثاث، ربنا عز وجل قال في كلمة: 
  """;
  static const String ayahHadithTwentyTwentyThree_1 = """

   ولباس التقوى ذلك خير 

  """;

  static const String elmTextTwentyTwentyThree_2 = """
لباس التقوى ذلك خير، هذا الذي ينفعك بعد الموت، هذا الذي يستمر أثره إلى ما بعد الموت 
  """;
  static const String ayahHadithTwentyTwentyThree_2 = """
   ولباس التقوى ذلك خير 
 """;
  static const String elmTextTwentyTwentyThree_3 = """
المظهر لا قيمة له 
 """;
  static const String ayahHadithTwentyTwentyThree_3 = """
إن الله لا ينظر إلى صوركم وأموالكم ولكن ينظر إلى قلوبكم وأعمالكم (من صحيح مسلم عن ابي هريرة) 
 """;
  // page 24
  static const String elmTextTwentyTwentyFour_1 = """
القلب بيت الرب، ومنظرالله عز وجل، يقول الله عز وجل: 
 """;
  static const String ayahHadithTwentyTwentyFour_1 = """
عبدي طهرت منظر الخلق سنين، أفلا طهرت منظري ساعة؟ 
 """;
  static const String elmTextTwentyTwentyFour_2 = """
ألا تستحيي من الله أن يطلع الله عليك فيرى في هذا القلب حقداً، أو حسداً، أو يرى فيه أنانية، أو حباً للذات؟ 
  
ألا تستحيي من الله أن يطلع الله على قلبك فيراه ممتلئاً بحب الدنيا؟

ألا تستحيي من الله عز وجل أن يطلع على قلبك وفيه نية ماكرة لبعض المؤمنين؟ ألا تستحيي؟.. 
طهرت منظر الخلق سنين أفلا طهرت منظري ساعة؟ 
  """;
  static const String ayahHadithTwentyTwentyFour_2 = """

   ولباس التقوى ذلك خير 

   وتزودوا فإن خير الزاد التقوى 

 """;
  // page 25
  static const String subtitleTwentyTwentyFive_1 = """
التقوى طريق الجنة 
 """;
  static const String elmTextTwentyTwentyFive_2 = """
لكن عليك بتقوى الله دائماً، فكل شيئ له ثمن كل شيئ له ثمن، لو أن احداً طلب مثلاً قطعة أثاث فاخرة جداً من مستوى رفيع جداً، فهذا الطلب العالي يقابله ثمن غالٍ دائماً، الشيئ المتقن ثمنه غالٍ، والشيئ غير المتقن ثمنه رخيص، ولكن هل في الحياة كلها، هل في الحياة الدنيا والآخرة عطاءً يفوق عطاء الأخرة؟ مالا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر، هذه الآخرة الأبدية السرمدية حياة مافيها نغص، ولا فيها قلق، ولا فيها أحزان، ولا فيها منافسة، ولا فيها زوال، ولا فيها تدني 
هذه الحياة فيها؟ ما لا عين رأت ولا أذن سمعت، ولا خطر على قلب بشر.. 
فلا تعلم نفس ما أخفي لهم من قرة أعين 
هذه الآخرة أتظن أن ثمنها بسيط؟ ثمنها يسير؟ ركعتان تُصليهُما وانتهى الأمر، لا والله، ألا إن سلعة الله غالية 
الله عز وجل قال
 """;
  // page 26
  static const String ayahHadithTwentyTwentySix_1 = """

أم حسبتم ان تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين 
ألا فلتعلم أن سلعة الله غالية، وطريق الجنة ليست طريقاً محفوفة بالرياحين، إنها طريق محفوفة بالمكاره 
هكذا قال عليه الصلاة والسلام 

حفت الجنة بالمكاره وحفت النار بالشهوات (من صحيح مسلم عن أنس بن مالك) 

 """;
  // page 27
  static const String subtitleTwentyTwentySeven_1 = """
آيات قرآنية متحدثة عن التقوى 
""";
  static const String elmTextTwentyTwentySeven_1 = """
الآية الأولى 
  """;
  static const String ayahHadithTwentyTwentySeven_1 = """
   وسيُجنبها الأتقى 

  """;

  static const String elmTextTwentyTwentySeven_2 = """
الأتقى اسم تفضيل، فهناك في اللغة تقي وأتقى، وكريم وأكرم، أما الأتقى ماصفاته الأساسية؟ 
قال: 
  """;
  static const String ayahHadithTwentyTwentySeven_2 = """
   الذي يؤتي ماله يتزكى 

  """;
  static const String elmTextTwentyTwentySeven_3 = """
المال: الله عز وجل أكرمنا به ليكون وسيلة للتقرُب إليه، أحد الصحابة الكرام قال: حبذا المال أصون به عرضي، وأتقرب به إلى ربي 
كلمات بليغات أصون به عرضي؛ أولادك، أهلك، أمك أبوك بحاجةٍ إليك، صنت بهذا المال عرضك، وتقربت به إلى ربك، فربنا عز وجل يصف الأتقى لا يصف التقي، قال: 
  """;
  static const String ayahHadithTwentyTwentySeven_3 = """
  وسيجنبها الأتقى الذي يؤتي ماله يتزكى 

  """;
  // page 28
  static const String elmTextTwentyTwentyEight_1 = """
الآية الثانية 
   """;
  static const String ayahHadithTwentyTwentyEight_1 = """
  ولكم في القصاص حياة يا أولي الألباب لعلكم تتقون 
وقد نتعرف إلى مؤمن كبير جداً، أساس إيمانه عقاب ناله من الله، خالف الشرع، فجاءه عقاب إلهي، فالقصاص أحد الطرق المؤدية إلى التقوى 

  """;
  static const String elmTextTwentyTwentyEight_2 = """
الآية الثالثة 
  """;
  static const String ayahHadithTwentyTwentyEight_2 = """
  وينجي الله الذين اتقو بمفازتهم لا يمسهم السؤ ولا هم يحزنون 
""";
  static const String elmTextTwentyTwentyEight_3 = """
لم يقل الله عزوجل: لا يصيبهم السوء؛ بل قال: 

  """;
  static const String ayahHadithTwentyTwentyEight_3 = """
لا يمسهم 

  """;

  // page 29
  static const String elmTextTwentyTwentyNine_1 = """
الآية الرابعة 
""";
  static const String ayahHadithTwentyTwentyNine_1 = """
إن المتقين في جنات وعيون اخذين ما اتاهم ربهم إنهم كانوا قبل ذلك محسنين 

""";
  static const String elmTextTwentyTwentyNine_2 = """
الآية الخامسة: 
""";
  static const String ayahHadithTwentyTwentyNine_2 = """
   إن المتقين في جنات ونهر 
   
   """;
  static const String elmTextTwentyTwentyNine_3 = """
الآية السادسة 
""";
  static const String ayahHadithTwentyTwentyNine_3 = """
   إن المتقين في جنات ونعيم 
   
""";
  static const String elmTextTwentyTwentyNine_4 = """
الآية السابعة 
""";
  static const String ayahHadithTwentyTwentyNine_4 = """
   إن المتقين في ظلال وعيون 

""";
  static const String elmTextTwentyTwentyNine_5 = """
الآية الثامنة 
""";
  static const String ayahHadithTwentyTwentyNine_5 = """
   إن المتقين في جنات وعيون 
   
""";
  static const String elmTextTwentyTwentyNine_6 = """
الآية التاسعة 
""";
  static const String ayahHadithTwentyTwentyNine_6 = """
   إن المتقين في جنات ونعيم 

""";
  static const String elmTextTwentyTwentyNine_7 = """
الآية الحادية عشرة 
""";
  static const String ayahHadithTwentyTwentyNine_7 = """
   والعاقبة للمتقين

""";
  static const String elmTextTwentyTwentyNine_8 = """
الآية الثانية عشرة 
""";
  static const String ayahHadithTwentyTwentyNine_8 = """
   والعاقبة للتقوى 

  """;
  // page  30
  static const String elmTextTwentyTherty_1 = """
أي أن في النهاية لا يسعد إلا المتقي، لا يفوز إلا المتقي، لا ينجو إلا المتقي، لا يُفلح إلا المتقي، لا ينجح إلا المتقي، لا يسعد إلا المتقي.. 
  """;
  static const String ayahHadithTwentyTherty_1 = """
   والعاقبة للمتقين 
   والعاقبة للتقوى 

  """;
  static const String elmTextTwentyTherty_2 = """
لكن من أجل أن تقطف ثمار التقوى يانعة ربنا عز وجل يقول: 
   """;
  static const String ayahHadithTwentyTherty_2 = """
   خذوا ما اتيناكم بقوة 
   
  """;
  static const String elmTextTwentyTherty_3 = """
بقوة، هناك أخذ بلين، ومسايرة، ومجاملة للآخرين، مواقفه دائماً ضبابية، دائماً متردد، دائماً مُرتاب، دائماً يُطيع الله ولكن على مضض، يخاف أن يعصيه، ولكن يرغب أن يعصيه، هذا الموقف المتردد الضبابي، موقف الأخذ والرد، موقف المتخاذل، موقف متردد، هذه المواقف ليست من صفات المؤمنين
  """;

  // page 31 وقفة
  static const String ayahHadithTwentyThertyOne_1 = """

   ومن يتق الله يجعل له مخرجا 
   
 """;

  static const String elmTextTwentyThertyOne_1 = """
القرآن الكريم فيه شيئ رائع جداً، هذا الشيئ هو أن الآية وهي في سياقها لها معنى، فإذا نزعتها من سياقها وقرأتها وحدها فلها معنى آخر، وهذا من اعجاز القرآن، كل آية إن انتظمت مع أخواتها تؤدي معنى محدداً، أما حينما تنزع من سياقها فتؤدي معنى شمولياً كبيراً جداً 
 """;
  static const String ayahHadithTwentyThertyOne_2 = """

    ومن يتق الله يجعل له مخرجاً 

 """;
  static const String elmTextTwentyThertyOne_2 = """
هذه الآية وردت في سورة الطلاق، معناها السياقي: أي ان من يتق الله في تطليق زوجته؛ يطلقها وفق السنة، يطلقها لعدتها، يطلقها في طهر مامسها فيه، يطلقها وهو اعتقد أن الله لعله يحدث بعد ذلك أمرا، يجعل الله له مخرجاً إلى الرجوع إليها، لو أنه ندم بإمكانه أن يُرجعها، لو أنه تأثر لفراقها بإمكانه أن يرجعها 
 """;
  static const String ayahHadithTwentyThertyOne_3 = """

    ومن يتق الله يجعل لهُ مخرجا 

 """;
  // page 32
  static const String elmTextTwentyThertyTwo_1 = """
لو نزعنا هذه الآية من سياقها يُكتب عليها مجلدات، 
إذا نُزعت من سياقها اصبحت قاعدة 
من يتق الله في اختيار زوجته يجعل له مخرجاً من تطليقها،
من ربى اولاده تربية إسلامية جعل الله له مخرجاً من عقوق الأولاد،
من كسب المال وفق السُنة بالطريق المشروع جعل الله له مخرجاً من إتلاف المال وضياعه، 
من اتقى الله في أداء زكاة ماله يجعل الله له مخرجاً من ضياع الأموال وإتلافها، 
من اتقى الله في معرفته يجعل الله له مخرجاً من المعاصي التي ترتكب بسبب الجهل بالله عز وجل، 
من اتقى الله في أصول معاملة الزوجة يجعل الله له مخرجاً من النكد الزوجي، والشقاء الزوجي، والخصومة الزوجية، 
من يتق الله في اختيار البيت المناسب، اختاره في حي محافظ، بعيد عن الشُبُهات، بعيد عن التفلُت يجعل الله له مخرجاً من انحراف الأولاد 


 """;
  // page 33
  static const String elmTextTwentyThertyThree_1 = """
هذه الآية يمكن أن تُطبق على مليون حالة، إذا نزعت من سياقها أصبحت قاعدة: 
 """;
  static const String ayahHadithTwentyThertyThree_1 = """

    ومن يتق الله يجعل له مخرجا 

 """;
  static const String subtitleTwentyThertyThree_1 = """
من يتق الله في الحرام يجعل الله له مخرجاً: 
 """;
  static const String elmTextTwentyThertyThree_2 = """
أحياناً يضعك في ظرف كل أبواب الحلال مغلقة، وكل الأبواب المشروعة مغلقة، وكل الطرق الآمنة مغلقة، وكل الأسباب التي رسمها الله عز وجل مغلقة ثم يفتح الله لك باب الحرام، باب المعصية، باب النفاق، باب الكذب، ويمتحنك، المؤمن يقول: والله لن أعصي الله ما حييت، ولن أتساهل في منهج الله قيد أنملة 

 """;
  static const String subtitleTwentyThertyThree_2 = """
من اتقى الله عز وجل جاءه رزق وفير من حيث لا يحتسب: 
 """;
  static const String elmTextTwentyThertyThree_3 = """
فهذه الآية دقيقة، أحياناً تعرض عليك الدنيا من طريق غير مشروع، قد يأتيك رزق وفير من معصية، من عمل مشبوه، من إنجاز عمل لا يرضي الله، من طريقة لا ترضي الله، هذا المال الوفير الذي يأتيك من هذا الطريق لا بركة فيه، وقد يذهب، ويُذهب معه صاحبه، لكنك إذا اتقيت الله عز وجل جاءك رزق وفير من حيث لا تحتسب 
  """;
  // page 34
  static const String ayahHadithTwentyThertyFour_1 = """

    ومن يتق الله يجعل له مخرجاً ويرزقه من حيث لا يحتسب 

  """;
  static const String elmTextTwentyThertyFour_1 = """
لكن لا تطالب الله بالوقت، الوقت له حكمته، أنت عليك أن تعبد الله، الآية دقيقة، وهذه نقطة مهمة جداً 

لابد من ضيق ليظهر صدق الإنسان مع الله وبعد ذلك يأتي فرج الله: 

لما ربنا عز وجل قال: 

 """;
  static const String ayahHadithTwentyThertyFour_2 = """

ياايها الذين امنوا إنما المشركون نجس فلا يقربوا المسجد الحرام بعد عامهم هذا 

 """;
  static const String elmTextTwentyThertyFour_2 = """
فهذه السياحة قديمة، حينما يأتي هؤلاء إلى المسجد الحرام يشترون الطعام والشراب، يسكنون في البيوت، ينفقون أموالاً كثيرة جداً، والأن تكاد تكون صناعة السياحة أروج صناعةٍ في كل البلاد، وتحقق أكبر دخل من العملات الصعبة، فربنا عز وجل قال: 
 """;
  static const String ayahHadithTwentyThertyFour_3 = """

ياايها الذين آمنوا إنما المشركون نجس 

 """;
  static const String elmTextTwentyThertyFour_3 = """
ماقال: نجسون، قال: 
    ( نجس ) 
أي هم عين النجاسة: 
    فلا يقربو المسجد الحرام بعد عامهم هذا 
طبعاً من لوازم هذا المنع انخفاض الدخل، طبيعي، قال:

 """;
  // Page 35
  static const String ayahHadithTwentyThertyFive_1 = """
    وإن خفتم عيلة 
 """;
  static const String elmTextTwentyThertyFive_1 = """
أي فقراً 
 """;
  static const String ayahHadithTwentyThertyFive_2 = """

    فسوف يغنيكم الله من فضله 
 """;
  static const String elmTextTwentyThertyFive_2 = """
لكن لم يقل: يغنيكم، قال: 
    ( فسوف ) 

أي أنه لا بد من مرحلة من أجل أن يظهر صدقكم مع الله، من أجل أن يظهر ثباتكم على الحق، من أجل أن تظهر مؤاثراتكم، أي يارب، رضاك أغلى عندنا من كل شيئ، 

قال تعالى: 
    ( فسوف ) 
وبعد حين يأتي فرج الله عز وجل، هذه الآية قانون، أي انسان إذا اتقى الله عز وجل وصرف نفسه من دخل كبير فيه شبهة، وقنع بالقليل الذي لا يكفيه لأنه حلال، قد يعاني بعض الوقت ليدفع ثمن هذا القرار الحكيم، ليدفع ثمن هذه الطاعة، وبعد حين يرزقه الله من حيث لا يحتسب، فالإنسان لايستعجل، فمن كان يريد لقاء الله فإن أجل الله آت
 """;
}
