class ElmTextDersTherteen {
// page1
  static const String titleThirteenOne = """
  ما أصابكم من مصيبة 
  --------------
 """;
  static const String ayahHadithThirteenOne_1 = """
وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠ *
""";

  static const String elmTextTherteenOne_1 = """
أي أقل مصيبة
ورد في الحديث الشريف 
""";

  static const String ayahHadithThirteenOne_2 = """

( ما من عثره ) **

شخص وقع في الطريق ما حصل له شيئ ، وقف ومشى فهذه مصيبة إذا قلت من أين هذه المصيبه ، ماشي في الطريق فخدش جلدك مسمارآ فما حصل شيئ إطلاقآ انتهت العملية ، الحديث الشريف (( ما من عثرة ولا اختلاج عرق ولا خدش عود إلا بما قدمت أيديكم ، وما يغفر الله أكثر )) 
""";

  static const String elmTextTherteenOne_2 = """
ما من مصيبةٍ في الكون أو في الأرض إلا بسبب معصيتنا ، وما من معصيةٍ إلا بسبب جهل إما بمعرفة الله أو بأمره ، فإن عرفته ولم تعرف أمره أصابتك المصيبة ، وإن عرفت أمره ولم تعرفه فما طبقت أمره أصابتك المصيبة ، إذا هذه الآية
""";

  static const String ayahHadithTherteenOne_3 = """
وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠ 
الشورى 30 

والحديث
يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا

""";

  static const String elmTextTherteenOne_3 = """
هناك مصائب أدبية ، انحرجت ، في مصائب مادية، فذهب منك مئةألف، وهناك مصائب معنوية، أهانك إنسان لا سمح الله، وهناك مصائب أسرية مرض، وأحيانآ حبس حرية، وأحيانآ إهانة، وأحيانآ ذل، وأحيانآ فقر مدقع، وأحيانآ ألم لا يُحتمل ، وأحيانآ انحرجت قليلآ، فذكرت رقمآ غير صحيح، فقال لك شخص: الرقم غير صحيح من أين أتيت به؟ فاستحييت في نفسك، فهذه كذلك مصيبة
""";

  static const String footerTherteen = """
-----------
الراوي **
الراوي : البراء بن عازب | المحدث : الألباني | المصدر : ضعيف الجامع
الصفحة أو الرقم : 5209 | خلاصة حكم المحدث : موضوع 

  """;

// page 2
  static const String elmTextTherteenTwo_1 = """
كل مصيبة أصابت الإنسان بسبب معصيةٍ
لكن ما كل معصيةٍ يتبعها مصيبة
""";

  static const String ayahHadithTherteenTwo_1 = """

وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠ 
الشورى 30 

""";

  static const String elmTextTherteenTwo_2 = """
العكس غير صحيح ، أي كل شيئ أصابك بسبب معصية ، لكن ما كل مخالفة وذنب يتبعها مصيبة هو يعفو عن كثير ( فالمعنى دقيق ) فكل مصيبةٍ أصابت الإنسان بسبب معصيةٍ أو ذنب ، لكن ما كل ذنب ٍ أو معصيةٍ يتبعها مصيبة

الله عز وجل عفو يعفو عن الإنسان ويسامحه ويعطيه فرصآ كثيرة
""";

  static const String ayahHadithTherteenTwo_2 = """
وَیَعۡفُوا۟ عَن كَثِیرࣲ
""";

  static const String elmTextTherteenTwo_3 = """
فربنا عز وجل يحاسب قليلآ ويعفو كثيرآ ، إذ يحاسبك عن واحدة ويسامحك بعشرة كي تتعظ وكي تقترب ، والله يعطي فرصآ كثيرة 

""";
// page3
  static const String ayahHadithTherteenThree_1 = """

 وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠ 
الشورى 30 

""";

  static const String elmTextTherteenThree_1 = """
وهذه الأيه قد تكون شعارآ للإنسان يضعها في بيته ، وفي مكتبه ، ودكانه حتى لا يتهم الخالق ألعظيم بشيئ ، الله عز وجل عادل 

المصائب التي تنزل بالإنسان ماهي إلا معالجة من الله عز وجل
""";

  static const String ayahHadithTherteenThree_2 = """

مَّا یَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ 
النساء 147 

""";
  static const String elmTextTherteenThree_2 = """
الله ماذا يفعل بالمصائب التي ينزلها بكم ؟ لا معنى لها بالنسبة له لكنها معالجة
""";

  static const String ayahHadithTherteenThree_3 = """

 وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠ 
""";

  static const String elmTextTherteenThree_3 = """
هذه الآية يجب ألا تغيب عن أذهاننا

  """;
  // page 4
  static const String elmTextTherteenFour_1 = """
من تعامل مع الله عز وجل بصدق واستقامه نال 
""";
  static const String subtitleTherteenFour_1 = """
١.. السرور والسعادة و التيسير
""";
  static const String elmTextTherteenFour_2 = """
تعامل معه بصدق وباستقامة تر من السرور والسعادة والتيسير ما لا سبيل إلى وصفه
""";
  static const String ayahHadithTherteenFour_1 = """

فَأَمَّا مَنۡ أَعۡطَىٰ وَٱتَّقَىٰ ۝٥
وَصَدَّقَ بِٱلۡحُسۡنَىٰ ۝٦
فَسَنُیَسِّرُهُۥ لِلۡیُسۡرَىٰ ۝٧

""";

  static const String subtitleTherteenFour_2 = """
٢.. الحياة الطيبة
""";
  static const String elmTextTherteenFour_3 = """
وهذه واحدة ، ترى الحياة الطيبة
""";

  static const String ayahHadithTherteenFour_2 = """

مَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَلَنُحۡیِیَنَّهُۥ حَیَوٰةࣰ طَیِّبَةࣰۖ *
الحج 40 
""";

  static const String subtitleTherteenFour_3 = """
٣.. دفاع الله عن الذين آمنو
""";
  static const String elmTextTherteenFour_4 = """
ترى أن الله يدافع عن الذين آمنو ، وهذه الثالثة

""";

  static const String ayahHadithTherteenFour_3 = """
 وَلَیَنصُرَنَّ ٱللَّهُ مَن یَنصُرُهُۥۤۚ  
""";

  static const String subtitleTherteenFour_4 = """
٤.. النصر والتأييد
""";

// page 5 -------------
  static const String elmTextTherteenFive_1 = """
والآيه الرابعه
""";

  static const String ayahHadithTherteenFive_1 = """
وَأَنَّ اللَّهَ مَعَ الْمُؤْمِنِينَ
[ الأنفال: 19]
""";

  static const String elmTextTherteenFive_2 = """
فهو معهم بالنصر ، والتأييد ، والحفظ ، والتوفيق ، والدفاع عنك ، والحياة الطيبة ، والتيسير ، فهذه كلها وعود الله عز وجل ، فإذا لم تتحقق هذه الوعود فلعلة أن هناك كسباً لا يرضي الله عز وجل
""";

  static const String ayahHadithTherteenFive_2 = """
  فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠
""";

  static const String elmTextTherteenFive_3 = """
من أصابته مصيبة فليبحث عن السبب وليتوب إلى الخالق لتنزاح عنه
تطبيقآ لهذه الآية: إذا اصابت الإنسان مصيبة من كل أنواع المصائب؛ أدبية، أو معنوية، أو مادية، أو جسمية، أو في أسرته، أو في بيته، أو في عمله، أو أي نوع من أنواع المصائب فالموقف الأخلاقي العلمي الدقيق أن يُحاسب نفسه حساباً عسيراً ، فإذا عرف السبب بطل العجب
قد ترى بعض الناس يقول: يا أخي في الدنيا حلو وحامض ، أو الدهر يومان يوم لك ويوم عليك ، وهذا كلام العوام ، كلام فلاسفة بعيدين عن الله عز وجل ، فهذا كلام ليس له معنى ، وليس له وزن في الدين إطلاقاً الوزن في الدين الإنسان إذا اصابه شيئ ليقف عند هذه الآية ، إله يقول لك :
""";

  static const String ayahHadithTherteenFive_3 = """

 وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ  
الشورى 30 
""";

  static const String elmTextTherteenFive_4 = """
ليبحث عن السبب فإذا وصل إليه ، يتوب منه ، وتزاح عنه المصيبة
""";

  static const String ayahHadithTherteenFive_4 = """
إِنَّ ٱللَّهَ لَا یُغَیِّرُ مَا بِقَوۡمٍ حَتَّىٰ یُغَیِّرُوا۟ مَا بِأَنفُسِهِمۡۗ 
الرعد 11 
""";

// page 6
  static const String elmTextTherteenSix_1 = """
نوع المصيبة يتوافق مع الذنب الذي اصابت الإنسان من أجله
:يوجد آية ثانية جميلة جداً
""";

  static const String ayahHadithTherteenSix_1 = """
 وَمَن یُؤۡمِنۢ بِٱللَّهِ 
""";

  static const String elmTextTherteenSix_2 = """
أن الله عادل ، وحكيم ، والله ليس له مصلحة أن يعذبنا ، ومن يؤمن بالله ، بكمالاته ، وحكمته ، ورحمته ، وعدالته وتربيته
 """;
  static const String ayahHadithTherteenSix_2 = """
  یَهۡدِ قَلۡبَهُۥۚ
""";

  static const String elmTextTherteenSix_3 = """
إلى حكمة المصيبة
""";

  static const String ayahHadithTherteenSix_3 = """
 وَمَن یُؤۡمِنۢ بِٱللَّهِ یَهۡدِ قَلۡبَهُۥۚ 
التغابن 11 
""";

  static const String elmTextTherteenSix_4 = """
وكأن ربنا عز وجل من حكمته أنه إذا ساق لإنسان مصيبة ينفث في روعه ، أو يلهمه أن هذه من أجل كذا ، أو أن نوع المصيبة يتوافق مع الذنب الذي أصابته من أجله

  """;

// page 7
  static const String elmTextTherteenSeven_1 = """
المؤمن الصادق يلهمه الله الحكمه من وراء المصيبة التي أصابته
أغلب المصائب تأتي من جنس الذنب ، فإذا وجد تكبرآ تجد إهانة ، وإذا وجد إسرافاً أو تقتيراً ، أو إهمالاً لزوجة ابنك في البيت فيأتي إهمال لابنتك من زوجها بالمقابل ، وإذا حصل إهمال للوالد يأتي إهمال للإبن ، وأغلب الظن تأتي المصائب بشكل يوحي للإنسان بسببها ، إما أن التوافق بين المصيبة وبين الذنب ، أو أن الله عز وجل يلقي في روع المؤمن الصادق: أن ياعبدي هذه من أجل كذا ، فانتبه
""";

  static const String ayahHadithTherteenSeven_1 = """

 وَمَن یُؤۡمِنۢ بِٱللَّهِ یَهۡدِ قَلۡبَهُۥۚ 
التغابن 11 

""";

  static const String elmTextTherteenSeven_2 = """
كلما كبر عقل الإنسان ازداد محبة لله وخوفاً منه
كلما كبر عقل الإنسان يزداد خوفه من الله ، فيضبط لسانه ، ويضبط سمعه ، وبصره ، وبيته  وعمله ، فلا كذب ، ولا غش ، وكلما كبر العقل تزداد المحبة لله عز وجل

ارجحكم عقلاً اشدكم حباً لله عز وجل
""";

  static const String ayahHadithTherteenSeven_2 = """
رأس الحكمة مخافة الله تعالى *

""";

  static const String footerTherteenSeven = """
---------------------
الراوي *
 عبدالله بن مسعود | المحدث : الألباني | المصدر : ضعيف الجامع
الصفحة أو الرقم : 3066 | خلاصة حكم المحدث : ضعيف 
""";

// page 8
  static const String ayahHadithTherteenEight_1 = """

 وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠ 
الشورى 30 

""";

  static const String elmTextTherteenEight_1 = """
لا أحد يتملق نفسه فيقول: أخي هذه ترقية ، أنا لي عند الله مقام ، فلولا هذه ما ارتقيت لهذا المقام

إذا أُصيب أخوك بمصيبة فالأدب أن تقول: هذه ترقية ، وإياك أن تتهم أخاك إذا المت به مصيبة أنه مقصر بذنب ، لا
هذا من سؤ أخلاق المؤمن مع إخوانه ، فإذا أصابت المصيبة أخاك فأحسن الظن به وقل: هذه ترقية إلى مستوى أعلى ، أما إذا أصابت الإنسان مصيبة فلا يتملق نفسه ، ولا يرش على الموت سكراً ، ليكن مع نفسه صريحاً وجريئاً ، وليبحث عن الذنب فإذا تعامل مع الله بهذه الطريقة قطع أربعة اخماس الطريق إلى الله ، وبالتعبير العامي _ بدأ يفهم على الله _
""";
  static const String ayahHadithTherteenEight_2 = """

قال له: يارب لقد عصيتك ولم تعاقبني
قال: "ياعبدي لقد عاقبتك ولم تدر ، ألم أحرمك لذة مناچاتي 
""";

  static const String footerTherteenEight = """
------------
""";

// page 9
  static const String elmTextTherteenNine_1 = """
كلما شعر الإنسان بمشكلة عليه أن يترك الحل الأرضي ويبحث عن العلة السماويه
الآن هنا مصائب من نوع جديد للمؤمنين ، مافيه شيئ ، كل شيئ على أحسن مايرام ولكن يحجبك عنه ، فالصلاة ما فيها شيئ ، تقرأ قرآناً ولا تشعر بشيئ ، وتذكر وما تحس بشيئ ، وبالذكر لا تذوق حلاوة ، وبالتلاوة لا تجد لذة ، ومعنى هذا فأنت محجوب ، ولماذا أنت هكذا ؟ 
اعلم أن عندك مشكلة فابحث عنها
  """;

// page 10
  static const String elmTextTherteenTen_1 = """
الحياة الطيبة ثمن الإستقامة على أمر الله عز وجل 
كل مصيبة وراءها ذنب ، ولكن ما كل ذنب وراءه مصيبة لأن الله عفو كريم ، يريحك قليلاً  ثم يبعث لك واحدة فانتبه ، يُريحك فترة طويلة شهراً أو شهرين ولا يحدث لك شيئاً ، إذ يكون عندك أخطاء ولكن يريحك مرة ثانية فتأتي مشكلة ثانية ، إلى أن تستقيم وجهتك إلى الله ، ويستقيم عملك تماماً فتجد الحياة أصبحت طيبة كما 
""";
  static const String ayahHadithTherteenTen_1 = """

قال الله عز وجل 
مَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَلَنُحۡیِیَنَّهُۥ حَیَوٰةࣰ طَیِّبَةࣰۖ 
الحج 97 
""";
  static const String elmTextTherteenTen_2 = """
هذا كلام رب العالمين ، فهذه الآيه ليست آية خلافية ، وليست آية معقدة تحتاج إلى مفسرين ، ومعاجم لغة ، لإنها آية واضحة ، وهي مفسرة بنفسها ، والقرآن بعض آياته متشابهه وأغلبه محكم ، لا تحتاج لمفسر
""";

  static const String ayahHadithTherteenTen_2 = """

 وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠ 
النحل 97 
""";

  static const String elmTextTherteenTen_3 = """
هذه بدون تفسير ، هذه إجعلها شعاراً لك ، وضعها في بيتك ، وفي مكتبك ، وجيبك
""";

// page 11
  static const String elmTextTherteenEleven_1 = """
من دقق في كل شيئ توجه إلى الله عز وجل ونال رضاه

كلما شعرت بشيئ غير طبيعي تذكر الآية ، ماذا فعلت؟ ماذا حكيت؟ أين كنت؟ ومن أين جئت؟ وكيف تكلمت؟ وكيف بعت هذه البيعة؟ ، فما من شيئ يقع إلا في حكمة منه ، ولكن نحن لا نعرف ، يقول لك فلان صار معه هذا ، وفلان صار معه هكذا ، فلو أنت دققت تجد كل شيئ بحساب دقيق ، وهذه الطريقة تعين على التوجُه إلى الله سبحانه وتعالى

  """;

// page 12
  static const String titleTherteenTwelve_1 = """
وقفة
----
""";

  static const String elmTextTherteenTwelve_1 = """
هناك مصائب تصيب أهل المعاصي والفجور ، وهناك مصائب تصيب أهل الإيمان والحبور ، مصائب أهل العصيان عقاب وهي نوعان
مصائب قصم ومصائب ردع

الإنسان أحياناً قد يبلغ من الكفر أو الإنحراف أو الإصرار على إيذاء الناس درجة بالغة  عندئذ هذا لا تنفعه إلا مصيبة القصم  
ربنا عز وجل يبطش به
""";

  static const String ayahHadithTherteenTwelve_1 = """

إِنَّ بَطۡشَ رَبِّكَ لَشَدِیدٌ ۝١٢ 
البروج 12 

""";

  static const String elmTextTherteenTwelve_2 = """
لكن المؤمنين لهم مصائب من نوع آخر
""";
  static const String subtitleTherteenTwelve_2 = """
  المصيبة الأولى
  """;
  static const String elmTextTherteenTwelve_3 = """
 مصيبة دفع إلى باب الله يكون هناك تقصير
""";

  static const String ayahHadithTherteenTwelve_2 = """

قال تعالى:
وَلَنَبۡلُوَنَّكُم بِشَیۡءࣲ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصࣲ مِّنَ ٱلۡأَمۡوَ ٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَ ٰتِۗ وَبَشِّرِ ٱلصَّـٰبِرِینَ ۝١٥٥ 
البقرة 155 
""";

// page 13
  static const String elmTextTherteenTherteen_1 = """
من قصر بالعمل ابتلاه الله بالهم، يكون هناك عبادة شكلية وصلاة صورية، تساهل ببعض الطاعات تقصير في الصلوات تلاوة القرآن عنده شكلية ليس فيها عمق ولا خشوع، من قصر بالعمل ابتلاه الله بالهم
مصيبة المؤمنين مصيبة دفع
""";
  static const String subtitleTherteenTherteen_1 = """
المصيبة الثانية
""";
  static const String elmTextTherteenTherteen_2 = """
 مصيبة الرفع ، هو مستقيم وسرعته عالية في طريق الإيمان ، لكن يمكن أن يرقى عند الله إلى درجات أعلى ، فلذلك إضافة إلى ايمانه وإخلاصه وإلى أعماله الصالحة يحمله الله بعض المتاعب كي يكون مثلاً أعلى في تحمله إياها وصبره عليها ، هذه مصيبة الرفع ، فالمؤمن بين الدفع والرفع ، إما أنه يدفعه إلى بابه ، وإما أنه يرقى به
""";
  static const String subtitleTherteenTherteen_2 = """
المصيبة الثالثة
""";
  static const String elmTextTherteenTherteen_3 = """
 مصيبة الكشف للأنبياء 

أما الأنبياء المكرمون هؤلاء تنطوي نفوسهم على خير وعلى حب وعلى كمال لا يظهر إلا بالمصائب 

إذاً هُناك خمسة أنواع من المصائب ، مصيبة القصم ومصيبة الردع للعصاة ، ومصيبة الدفع ومصيبة الرفع للمؤمنين ، والكشف للأنبياء

  """;
}
