class ElmTextDersEight {
  // page 1
  static const String titleEightOne = """
  المعيه الإلهيه
 -----------
""";

  static const String elmTextEightOne_1 = """
الشعور أن الله معك شعور لا يقدر بثمن

طبعا الله مع كل إنسان، هذه عامه لا ميزه فيها للإنسان 
""";

  static const String ayahHadithOne_1 = """
قال تعالى 
وَهُوَ مَعَكُمۡ أَیۡنَ مَا كُنتُمۡۚ
الحديد 4 

""";

  // page 2
  static const String elmTextEightTwo_1 = """
أما المعيه الخاصه 
""";

  static const String ayahHadithTwo_1 = """
قال تعالى 
 وَٱعۡلَمُوۤا۟ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِینَ ۝١٩٤
البقرة  194 

قال تعالى  
 وَٱللَّهُ مَعَ ٱلصَّـٰبِرِینَ ۝٢٤٩
البقرة 153 

قال تعالى 
 إِنَّ ٱللَّهَ مَعَ ٱلَّذِینَ ٱتَّقَوا۟ وَّٱلَّذِینَ هُم مُّحۡسِنُونَ ۝١٢٨
النحل 128 
""";

  static const String elmTextEightTwo_2 = """
هذه معيه خاصه  معية الحفظ  معية التوفيق  معية العطف  والرعايه  والنصر  والتأييد

فالبطل هو اللذي يجتهد ليستحق أن يكون الله معه

---------------------
""";

  // page 3
  static const String elmTextEightThree_1 = """
العوام يقولون: خاطرك ، الله معك
ٌ
هذه العباده كلمة( الله معك ) ليست قليله

إجتهد كي تستحق أن يكون الله معك ، فإذا كان الله معك فلا تخش بأسا ، موسى طفل صغير لا زال في المهد 
 """;

  static const String ayahHadithThree_1 = """
 قال تعالى 
فَإِذَا خِفۡتِ عَلَیۡهِ فَأَلۡقِیهِ فِی ٱلۡیَمِّ 
  القصص 7 

  """;
  // page 4
  static const String ayhaHadithFour_1 = """
  فَإِذَا خِفۡتِ عَلَیۡهِ 
""";

  static const String elmTextEightFour_1 = """
إذا خفت: أي ساورك خوف وقلق عليه فألقيه في اليم

رسولنا الكريم وهو مختبئ في الغار ماذا قال لصاحبه
""";

  static const String ayhaHadithFour_2 = """
 لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ 
التوبة 40 

""";

  // page 5
  static const String elmTextEightFive_1 = """
ماذا اراد كفار قريش ؟ ارادو قتل النبي صلى الله عليه وسلم  أخرجوه  قاتلوه  حاربوه  فلما شاهدهم النبي صلى الله عليه وسلم
:قال
""";

  static const String ayhaHadithFive_1 = """
  يا أَبَا جَهْلِ بنَ هِشَامٍ يا أُمَيَّةَ بنَ خَلَفٍ يا عُتْبَةَ بنَ رَبِيعَةَ يا شيبَةَ بنَ رَبِيعَةَ أَليسَ قدْ وَجَدْتُمْ ما وَعَدَ رَبُّكُمْ حَقًّا؟ فإنِّي قدْ وَجَدْتُ ما وَعَدَنِي رَبِّي حَقًّا فَسَمِعَ عُمَرُ قَوْلَ النبيِّ صَلَّى اللَّهُ عليه وسلَّمَ، فَقالَ: يا رَسولَ اللهِ، كيفَ يَسْمَعُوا وَأنَّى يُجِيبُوا وَقَدْ جَيَّفُوا؟ قالَ: وَالَّذِي نَفْسِي بيَدِهِ ما أَنْتُمْ بأَسْمع لِما أَقُولُ منهمْ، وَلَكِنَّهُمْ لا يَقْدِرُونَ أَنْ يُجِيبُوا ثُمَّ أَمَرَ بهِمْ فَسُحِبُوا، فَأُلْقُوا في قَلِيبِ بَدْرٍ
---------------------
الراوي : أنس بن مالك | المحدث : مسلم | المصدر : صحيح مسلم
الصفحة أو الرقم : 2874 | خلاصة حكم المحدث : [صحيح]
  """;

  // page 6
  static const String subtitleEightSix_1 = """
خلاصة الخلاصه
-----------
 """;
  static const String elmTextDersEightSix_1 = """
 عندما تكون مستقيما تصيبك العنايه الإلهيه

البطوله أن تكون على المنهج ، لإنك إن لم تكن على المنهج الصحيح فإن أقرب الناس إليك يقضي عليك ، أقرب الناس إليك يتنكر لك ، لإن كل من حولك بيد الله عز وجل ، فلذلك الإنسان العاقل لا ينجيه من الله إلا أن يكون مع الله

---------------------
  """;

  // page 7
  static const String elmTextDersEigthtSeven_1 = """
لاينجيه من الله إلا أن يكون وقافا عند أمر الله  أما ذكاؤه ، حيلته ، خبرته ، قوته ، جمعه ، هذا كله لا قيمة له عند الله عز وجل ، لإنه يؤتى الحذر من مأمنه ،  *وعلى نفسها جنت براقش ، وإذا اراد الله إنفاذ أمر أخذ من كل ذي لب لبه ، فإذا أراد الله أن يكرمك ألقى حبك في قلوبهم ، وإذا أراد أن يؤدبك ألقى البغض والشك في قلوبهم ، فإذا هم يتنكرون لك
""";

  static const String footerEightSeven_1 = """
---------------------
* قصة المثل
يقال أن براقش كانت كلبة، وقد أغار قوم على قومها، فنبحت، فنبهت قومها، فقاموا، وذهبوا إلى مغارة؛ ليختبوا فيها، وعندما جاء اللصوص أخذوا يبحثون عن أهل القرية، ولم يجدوا أحد، وعندما هموا بالانصراف نبحت الكلبة براقش، فانتبه لها اللصوص، فقتلوا عددا من قومها، وقتلوها أيضا، فقيل: جنت على أهلها براقش


 """;
  static const String elmTextDersEigthtSeven_2 = """
فإذا كنت بطلا فكن مع القوي ، والله هو القوي ، الله أبدي سرمدي قوي فكن معه ليكن معك

 """;
}
