class ElmTextDersEleven {
  static const String elmTextDersEleven1 = """
الرزق  
-----
لو تتبعت الأسباب الكبرى التي تدفع الناس إلى المعصية، لوجدت أن من أبرزها خشية الفقر، وخشية نقصان الرزق ، مع أن الرزق بيد الله سبحانه وتعالى ، والله سبحانه وتعالى ربطه بالإستقامة، وقد يحرم العبد بعض الرزق بالمعصيه

:قال تعالى 
وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰۤ ءَامَنُوا۟ وَٱتَّقَوۡا۟ لَفَتَحۡنَا عَلَیۡهِم بَرَكَـٰتࣲ مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِ 
سورة الأعراف 

:وقال تعالى 
 وَأَلَّوِ ٱسۡتَقَـٰمُوا۟ عَلَى ٱلطَّرِیقَةِ لَأَسۡقَیۡنَـٰهُم مَّاۤءً غَدَقࣰا ۝١٦ 
سورة الجن 

:وقال تعالى 
وَلَوۡ أَنَّهُمۡ أَقَامُوا۟ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِیلَ وَمَاۤ أُنزِلَ إِلَیۡهِم مِّن رَّبِّهِمۡ لَأَكَلُوا۟ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۚ  
سورة المائدة 

ويقاس على ذلك لو ان المسلمين أقامو القرآن الكريم لأكلو من فوقهم ومن تحت أرجلهم

---------------------

""";

//   static const String elmTextDersEleven2 = """
// """;

  static const String elmTextDersEleven3 = """
:الرزق بيد الله سبحانه وتعالى
من ابتغى أمرآ بمعصية كان أبعد مما رجا وأقرب مما اتقى  
إياك أن تقول إن اطعت الله أخسر عملي ، فهذا كلام الجوهال ، وكلام مشرك ، وكلام من أُفُقه ضيق ، فهذا التوهم من الشيطان  

:قال تعالى
إِنَّمَا ذَ ٰلِكُمُ ٱلشَّیۡطَـٰنُ یُخَوِّفُ أَوۡلِیَاۤءَهُۥ فَلَا تَخَافُوهُمۡ وَخَافُونِ إِن كُنتُم مُّؤۡمِنِینَ ۝١٧٥ 
سورة آل عمران 

 ---------------------
   """;

  static const String elmTextDersEleven4 = """
إياك ان تضن ان الرزق لن يأتي إلا بالرياء او نفاق او دهاء او سياسه او مكر او حيله او خداع  الرزق مضمون وموجود ومقسوم ، وكلمةالحق لا تقطع رزقا ولا تقرب اجلا

الله سبحانه وتعالى تكفل برزق العباد والزم ذاته العليه الزام ذاتي برزق العباد

:قال تعالى 
۞ وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَیَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلࣱّ فِی كِتَـٰبࣲ مُّبِینࣲ ۝٦ 
سورة هود 

الدابة جائت نكره تنكير شمول لتشمل هذه الكلمه كل شيئ يدب على وجه الأرض

---------------------
""";

  static const String elmTextDersEleven5 = """
وما من المن تفيد إستغراق افراد النوع 
لو دخلت إلى فصل وقلت هؤلا الطلاب لهم عندي جائزه أي اللذين امامك
اما إذا قلت ما من طالب في هذا الصف إلا وله عندي جائزه شملت الغائبين

إلا على الله رزقها، إذا جائت على قبل لفظ الجلاله دلت على الإلزام الذاتي
اي ان الله سبحانه وتعالى الزم ذاته العليه الزام ذاتي برزق العباد 

----------
""";

  static const String elmTextDersEleven6 = """
الله جل جلاله يرزق النملة السوداء على الصخرة الصماء، في الليلة الظلماء ، ولو تبحرت في اسم الرزاق لوجدت العجب العجاب ، لو تبحرت في اسم الرزاق لوجدت الشيئ اللذي لا يوصف ، فكل مخلوق يصله رزقه بطريقة أو بأخرى ، فالله سبحانه وتعالى يرزق بسبب، وبدون سبب، بل وإنه يرزق بضد السبب
 
 ---------------------
   """;
  static const String elmTextDersEleven7 = """

:قال تعالى 
  وَهُزِّیۤ إِلَیۡكِ بِجِذۡعِ ٱلنَّخۡلَةِ 
 سورة مريم 

بعضهم قال إن هذا من باب الأخذ بالأسباب ، فكيف أن الرزق محتوم ، ومقسوم ، وموزون ، ومع ذلك فالله سبحانه وتعالى أمرنا بالسعي أي بالأخذ بالأسباب ، فما عليها إلا أن تهز هذا الجذع
وبعضهم قال: إن الله سبحانه وتعالى ألان لها هذا الجذع ، فاهتز فسقطت التمرات امامها فأكلتها
 ---------------------
 """;
  static const String elmTextDersEleven8 = """
الآن من خلال حاجتك إلى الطعام والشراب تنطلق إلى العمل ، ومن خلال حاجتك إلى الزوجه تنطلق إلى الزواج ، ومن خلال حاجتك إلى تأكيد الذات تنطلق إلى اعمال تسعى إلى أن تكون لك نبراسا في المجتمع ، ومن أجل حاجتك إلى آلاف المواد تعيش في مجتمع ، كل هذا من أجل أن تُمتحن بالخير أو الشر ، وبالعطاء أو الحرمان ، وبالإحسان أو الإسائه ، وبالصدق أو الكذب ، وبالإخلاص أو الخيانة ، وبالإستقامة أو الانحراف ، بالكبر أو التواضع ، وبالإنصاف أو الجحود ، ومن خلال العمل ، ومن خلال الزواج ، ومن خلال تأكيد الذات ، ومن خلال بقائك في المجتمع تُمتحن أشد الامتحان
 ---------------------
 """;

  static const String elmTextDersEleven9 = """
:قال تعالى
ٱلَّذِی خَلَقَ ٱلۡمَوۡتَ وَٱلۡحَیَوٰةَ لِیَبۡلُوَكُمۡ أَیُّكُمۡ أَحۡسَنُ عَمَلࣰاۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡغَفُورُ ۝٢  
سورة الملك 

:وقال تعالى
أَحَسِبَ ٱلنَّاسُ أَن یُتۡرَكُوۤا۟ أَن یَقُولُوۤا۟ ءَامَنَّا وَهُمۡ لَا یُفۡتَنُونَ ۝٢ 
سورة العنكبوت 

إذا انت في الحياة الدنيا مبتلى من أجل ان تعمل عملآ صالحآ يؤهلك لجنة عرضها السماوات والأرض ، فأنت مخلوق للجنة ، للجنة وحدها
---------------------
  """;

  static const String elmTextDersEleven10 = """
:قال تعالى
وَمَا خَلَقۡتُ ٱلۡجِنَّ وَٱلۡإِنسَ إِلَّا لِیَعۡبُدُونِ ۝٥٦ 
 سورة الذاريات 

ليعرفوني فيُطيعوني فيسعدوا بقربي في الدنيا والآخرة ، وهذا هو الهدف

:انواع الرزق
 نوع ميسور بلا ثمن -
نوع ميسور بلا ثمن ، الهواء ، ولو كان الهواء بالثمن وبالقسائم ، وبالأحتكار لهلك الناس

نوع يحتاج إلى سعي -
نوع يحتاج إلى سعي طفيف كالماء ليس له ثمن ، وثمنه ثمن خدماته ، وتوفيره من مكان إلى مكان ، نوع يحتاج إلى ثمن ، ونوع يحتاج إلى عمل
وهناك انواع منوعه من الرزق أودعها الله تعالى في الارض ، وبعضها تستخدمه مباشرة ، وبعضها يحتاج إلى تدخل من جهد بشري ، ومن خلال هذا الجهد البشري المبني على العلم والعمل يُمتحن الإنسان فيرقى أو ينحدر 

 ---------------------
 """;

  static const String elmTextDersEleven11 = """
:الفرق بين الرزق والكسب

ماهو الفرق بين الرزق والكسب ؟ الرزق ماتنتفع به فقط فالطعام الذي أكلته ، والقميص الذي ترتديه ، والسرير الذي تنام عليه ، والطعام الذي تستهلكه ، هذا فقط وحده هو الرزق  

وأما الكسب فقد يكون لك في الحساب مئات الألوف ، أو بضعة ملايين ، أو مئات الملايين ، أو عشرات مئات الملايين لكنها كسب وليس رزقآ ، فالكسب حجمك المالي أما الرزق فهو مستهلكاتك ، الكسب كله تُحاسب عليه ولا تنتفع به ، لكن الرزق تُحاسب عليه ، وتنتفع به  
 ---------------------
   """;

  static const String elmTextDersEleven12 = """
أما انتفاعك به فعلى ثلاثة أقسام ، قسم تستهلكه كالطعام والشراب ، وقسم يبلى كالثياب ، وقسم يبقى كالصدقات

يقول إبن آدم مالي مالي مالي ، وليس لك من مالك إلا ما أكلت فأفنيت ، أو لبست فأبليت ، أو تصدقت فأبقيت ، وماسوى هذه الثلاثة ليست لك
 
 قال عليه الصلاة والسلام *
قال رسول الله ﷺ: لا تزول قدما عبد يوم القيامة حتى يسأل عن عمره فيم أفناه؟ وعن علمه فيم فعل فيه؟ وعن ماله من أين اكتسبه؟ وفيم أنفقه؟ وعن جسمه فيم أبلاه؟

الرزق أنواع كالطعام والشراب والزوجة والعلم

:قال تعالى 
وَمِنۡهُم مَّن یَقُولُ رَبَّنَاۤ ءَاتِنَا فِی ٱلدُّنۡیَا حَسَنَةࣰ وَفِی ٱلۡءَاخِرَةِ حَسَنَةࣰ وَقِنَا عَذَابَ ٱلنَّارِ ۝٢٠١
سورة البقرة 

لما سُئل أحد العلماء الكبار عن حسنة الدنيا
 قال
هي المرأه الصالحة ، فالمرأه الصالحه رزق ، والعلم رزق
---------------------
 أخرجه الترمذي *
باب في القيامة (4/ 612)، رقم: (2416)، وقال الألباني: صحيح لشواهده، المشكاة، رقم: (5197)
""";

  static const String elmTextDersEleven13 = """
وقفة  
---------
الرزق أداة ابتلاء ، واداة ثواب ، وأداة عقاب فالإنسان يُمتحن بما أُعطي ، ويُمتحن بما حُرم 

الغني مُمتحن بالغنى ، والفقير مُمتحن بالفقر

:ولكن السؤال الدقيق
 هل هذا الرزق يزيد أو ينقص ؟ 

الجواب : نعم، يزيد وينقص والأدلة كثيرة 
  
 ---------------------
   """;

  static const String elmTextDersEleven14 = """
 :زيادة الرزق يكون ب

 :الإيمان والتقوى 
الرزق يزيد بالايمان والتقوى

:قال تعالى
 وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰۤ ءَامَنُوا۟ وَٱتَّقَوۡا۟ لَفَتَحۡنَا عَلَیۡهِم بَرَكَـٰتࣲ مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِ
الأعراف 96 

 :الإستقامة
 يزيد ايضا بالاستقامه 

:قال تعالى 
 وَأَلَّوِ ٱسۡتَقَـٰمُوا۟ عَلَى ٱلطَّرِیقَةِ لَأَسۡقَیۡنَـٰهُم مَّاۤءً غَدَقࣰا ۝١٦ 
الجن 16 

 :إلتزام احكام الشرع
 يزيد بالتزام أحكام الشرع
 وَلَوۡ أَنَّهُمۡ أَقَامُوا۟ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِیلَ وَمَاۤ أُنزِلَ إِلَیۡهِم مِّن رَّبِّهِمۡ لَأَكَلُوا۟ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۚ 
المائدة 66

---------------------
   """;

  static const String elmTextDersEleven15 = """
 الإستغفار: والرزق يزيد بالاستغفار

  قال تعالى 
فَقُلۡتُ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ إِنَّهُۥ كَانَ غَفَّارࣰا ۝١٠
یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا ۝١١
وَیُمۡدِدۡكُم بِأَمۡوَ ٰلࣲ وَبَنِینَ وَیَجۡعَل لَّكُمۡ جَنَّـٰتࣲ وَیَجۡعَل لَّكُمۡ أَنۡهَـٰرࣰا ۝١٢ 
النوح 10,11,12 

يزيد بالاستقامه والايمان والطاعة ، ويزيد ايضا بالاستغفار

 :إقامة الصلاة
ويزيد الرزق بإقامةالصلاة 
 قال تعالى 
وَأۡمُرۡ أَهۡلَكَ بِٱلصَّلَوٰةِ وَٱصۡطَبِرۡ عَلَیۡهَاۖ لَا نَسۡءَلُكَ رِزۡقࣰاۖ نَّحۡنُ نَرۡزُقُكَۗ وَٱلۡعَـٰقِبَةُ لِلتَّقۡوَىٰ ۝١٣٢
طه 132 

بيت تقام فيه الصلوات ، هذا بيت في الأعم الأغلب الله سبحانه وتعالى يرزُقهُ 

---------------------
""";

  static const String elmTextDersEleven16 = """
 الصدقة-
  یَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰا۟ وَیُرۡبِی ٱلصَّدَقَـٰتِۗ 
 البقرة 276 

    الصدقة تزيد في الرزق  

    قال عليه الصلاة والسلام ***
    استمطرو الرزق بالصدقة 
    
    اي إذا اردتم الرزق الوفير 
الإنفاق بالحسابات المادية ينقص المال ، لكنه بالحسابات الربانية يُنميه يكثرُه ، لذلك مانقص مال من صدقه

 الإتقان-
شيئ أخر ، وهو أن الرزق يزيد بالإتقان ، فإتقان العمل جزء من الدين ، فالإتقان أحد اسباب نماء الرزق

 ---------------------
 لم اجد له تخريج***
   """;

  static const String elmTextDersEleven17 = """
 الآمانة-
والأمانه كما قال عليه الصلاة والسلام 
( الأمانة غنى )   * 

صلة الرحم- **
قَالَ رَسُولُ اللَّهِ ﷺ: مَنْ أَحَبَّ أَنْ يُبْسَطَ له فِي رِزْقِهِ، وأَنْ يُنْسَأَ لَهُ فِي أَثَرِهِ, فَلْيَصِلْ رَحِمَهُ

قلة الرزق مع توافر شروط زيادة الرزق تُعزى إلى حكمة الله عز وجل
---------------------
 لم اجد تخريج لهذا الحديث * 
  اخرجة البخاري **
 """;

  static const String elmTextDersEleven18 = """
قد يقول قائل ؛ فلان مستقيم ، والإستقامة أحد أسباب زيادة الرزق ، وفلان متصدق ، ومستغفر ، ومتقن ، ويصل رحمه ، وذو أمانة ، ويصلي ، ويأمر أهله بالصلاة ، ومع كل هذه الشروط نجد رزقه قليلاً ، فما تفسير ذلك؟ 
التفسير أنه إذا توافرت كل هذه الشروط ، ولم يكن الرزق وفيراً ، فهذه الحالة النادرة الخاصة تُعزى إلى حكمة الله تعالى ، وإن من عبادي من لا يُصلحُه إلا الفقر ، فإذا اغنيته أفسدتُ عليه دينه ، وإن الله ليحمي صفيه من الدنيا كما يحمي احدكم مريضه من الطعام ، وإن الله ليحمي عبده المؤمن من الدنيا ، كما يحمي الراعي الشفيق غنمه من مراتع الهلكة
------------
 """;

  static const String elmTextDerseEleven19 = """
:الحكمه أعظم أنواع الرزق

:قال تعالى 
 یُؤۡتِی ٱلۡحِكۡمَةَ مَن یَشَاۤءُۚ وَمَن یُؤۡتَ ٱلۡحِكۡمَةَ فَقَدۡ أُوتِیَ خَیۡرࣰا كَثِیرࣰاۗ
  البقرة 269 

فإذا آتاك الله الحكمة فعرفت الله سبحانه فقد أوتيت خيراً لا يعلمه إلا الله
  ------------
  """;

  static const String elmTextDersEleven20 = """
  الإعتقاد بأجل الموت وكتابة الرزق سبيل للعزة

إذا أعتقدنا أن حياتنا بيد الله ، وموتنا بيد الله ، ورزقنا بيد الله ، رفعنا رؤوسنا ، وكُنا أعزة ، وقد قيل للإمام الحسن البصري : ما سر عزك يا إمام ؟ فقال: علمت أن رزقي لا يأخذه أحد فاطمأنت نفسي
  
  ------------
  """;

  static const String elmTextDersEleven21 = """
كُل إنسان له رزقه المحدد فليطمئن  
أن كل إنسان له رزقه عند الله ، فهذه الشجرة كأن كُل تفاحة كتب عليها اسم آكلها ، كأن كل خوخة كُتب عليها اسم آكلها ، فواكه مسومة ، وانتقال هذا الطعام إليك باختيارك ، قد تأخذه شراءً ، وقد تأخذه هدية ، وقد تأخذه ضيافة ، وقد يأخذه بعض المنحرفين سرقة وتسولاً واغتصاباً ، وقد يأكله دناءة ، فانتقال هذا الطعام باختيارك

------------
  """;

//   static const String elmTextDersEleven22 = """
//   وققه
//   الدعاء
// سيدنا موسى عليه السلام عندما قال

// رَبَّنَا ٱطۡمِسۡ عَلَىٰۤ أَمۡوَ ٰلِهِمۡ وَٱشۡدُدۡ عَلَىٰ قُلُوبِهِمۡ فَلَا یُؤۡمِنُوا۟ حَتَّىٰ یَرَوُا۟ ٱلۡعَذَابَ ٱلۡأَلِیمَ ۝٨٨

// قال الله عز وجل
// قَالَ قَدۡ أُجِیبَت دَّعۡوَتُكُمَا
//   يونس 89

// من الداعي ؟ الداعي سيدنا موسى
// لماذا قال الله عز وجل؟
//  قَدۡ أُجِیبَت دَّعۡوَتُكُمَا

// لأن سيدنا هارون كان معه ، فلما دعا سيدنا موسى عليه السلام قال هارون : آمين ، والتأمين دعاء ، التأمين على دعاء الداعي دُعاء

//   ------------
//   """;

//   static const String elmTextDersEleven23 = """
// قَالَ قَدۡ أُجِیبَت دَّعۡوَتُكُمَا فَٱسۡتَقِیمَا وَلَا تَتَّبِعَاۤنِّ سَبِیلَ ٱلَّذِینَ لَا یَعۡلَمُونَ ۝٨٩
//   يونس 89

// ١- لا تستعجلو إجابة الدعاء
// لكل شيئ أوان ، وتلبية الدعاء مرهونة بمشيئة الله ، فمن تعجل الشيئ قبل أوانه عوقب بحرمانه ، لكن اطلب من الله واستسلم

//   ------------
//   """;

//   static const String elmTextDersEleven24 = """
//   ( فَٱسۡتَقِیمَا )
// :المعنى الأول
// بعضهم حمل هذه الأية على الثبات على الاستقامة ، هما مستقيمان ، ما معنى قولك لطالب مجتهد: اجتهد ؟ أي داوم على اجتهادك ، استمر على اجتهادك ،  اثبت على اجتهادك

//   ------------
//   """;

//   static const String elmTextDersEleven25 = """
// ( فَٱسۡتَقِیمَا )
// :المعنى الثاني
// تابعا نُصح فرعون ، المعنى الأول: اثبتا على تلك الاستقامة ، المعنى الثاني: تابعا نصح فرعون

// وَلَا تَتَّبِعَاۤنِّ سَبِیلَ ٱلَّذِینَ لَا یَعۡلَمُونَ ۝٨٩
// هؤلاء الذين لا يعلمون يستعجلون قضاء الله وقدره ، والإيمان بالقدر يُذهب الهم والحزن ، ولكل شيئ أوان ، لكل شيئ قدر ، الأمور بمواقيتها ، فالإنسان يجب ألا يتجاوز حدوده في تعيين وقت الإجابة ، ادع الله ثم اترك الأمر لله سبحانه
//   ------------
//   """;
}
