class ElmTextDersTwelve {
  // page 1
  static const String ayahHadithTwelveOne_1 = """
وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِیمࣲ
-----------------
      """;
  static const String elmTextTwelveOne_1 = """
أولاً ربنا جل جلاله هو ذات كاملة في أسمائه الحسنى وصفاته الفضلى فهو رحيم، كريم، عدل، غفور، قوي، عزيز، لطيف، فلا يستطيع مخلوق أن يتقرب إليه ويسعد بقربه إلا بالكمال، لذلك كان دين الله دين الكمال و دين الرحمة و دين العدل و دين المصلحة العامة و دين الإنصاف، فالله جل جلاله ذات كاملة، ولا يتقرب إليه المتقربون إلا بكمال هو وسيلتهم إليه، وأحكام الشريعة كلها عدل و رحمة و إنصاف و لطف، فكل قضية خرجت من العدل إلى الجور، ومن المصلحة إلى المفسدة، ومن الرحمة إلى القسوة فليست من الشريعة ولو أدخلت عليها ألف تأويل وتأويل، فلو قرأت الفقه في أبوابه كلها ودققت في كل مسائله، العامة والخاصة، الشخصية، والاجتماعية، والنفسية، والتعبدية، لوجدت أن كل هذه الأحكام ترشدك إلى الموقف الكامل، الموقف العدل، الموقف المنصف، الموقف الرحيم، الموقف اللطيف
  """;

// page 2
  static const String elmTextTwelveTwo_1 = """
 إذاً فمنهج الله عز وجل قائم على الخُلُق، والنبي عليه الصلاة والسلام لو لم يكن في أعلى درجة أخلاقية، لما قنعت أنت بهذا المنهج، فالمنهج بشكل نظري لايقنع إلا أن يجسد بسلوك، فلذلك كان للأنبياء مهمتان
مهمة بيانية ومهمة قيادية، فالمهمة البيانية أن يبين لك ماتفعل ومالاتفعل، لكن مهمة القدوة هي أن يكون كاملاً

  """;

  // page 3
  static const String elmTextTwelveThree_1 = """
لذالك يقول الله عز وجل
""";
  static const String ayahHadithTwelveThree_1 = """
 ((وَإِنَّكَ))
""";
  static const String elmTextTwelveThree_2 = """
يامحمد   

      و ﴿إن ﴾ : حرف مشبه بالفعل يفيد التوكيد 
""";
  static const String ayahHadithTwelveThree_2 = """
 
 لَعَلَىٰ خُلُقٍ عَظِیمࣲ ۝٤
القلم 4 

""";
  static const String elmTextTwelveThree_3 = """
يامحمد   
و(اللام) لام التوكيد أيضاً، فاللام الواقعة في جواب إن هي لام التوكيد
 على : تفيد الاستعلاء
  أي أن النبي عليه الصلاة والسلام ليس ذا خُلُق، بل هو على خُلُق وشتان بين المعنيين، إذا قلت : النبي على خلق أي  متمكن من مكارم الأخلاق، والإنسان أحياناً قد يقع في صراع بين أخذٍ و رد، وإقدامٍ وإحجام، وإنفاذٍ ومنع، ثم ينتصر على نفسه بعد شق النفس، هذا ذو خلُق، لكن الذي(على خلق عظيم) هو في أعماق الكمالات لأنه متمكن من أخلاقه فلا يحتاج إلى أن يشعر بالصراع مع نفسه 

""";
// page 4
  static const String ayahHadithTwelveFour_1 = """
وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِیمࣲ ۝٤
""";
  static const String elmTextTwelveFour_1 = """
فكم تبلغ أخلاق النبي؟ فالعظيم يصف النبي بأنه ذو خلق عظيم، وقد كان للنبي عليه الصلاة والسلام صفات أخرى كان من الممكن أن يمدحه بها، فقد كان خطيباً من الطراز الأول، وكان القائد الأول وكان السياسي الأول، وكان أعلم العلماء وأنزه القضاة وأعظم المجتهدين وكان ذا ذاكرة قوية، فقد حَفِظ القرآن الكريم من دقته إلى دفته وقد كان يتلى عليه مرة واحدة، فكل الصفات التي يفتخر بها الناس كان عليه الصلاة والسلام قمة فيها، فلماذا أهملها الله كلها، وحينما أراد أن يمدحه قال
""";
  static const String ayahHadithTwelveFour_2 = """
وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِیمࣲ ۝٤
""";

  static const String elmTextTwelveFour_2 = """
لأن الإيمان هو الخلق، والذي يفضلك في الخلق يفضلك في الإيمان

""";

// page 5
  static const String titleTwelveFive_1 = """
صور من أخلاق النبي صلى الله عليه وسلم
 ------------------------------
 """;

  static const String subtitleTwelveFive_1 = """
 :رحمته بالأطفال
 """;
  static const String elmTextTwelveFive_1 = """
كان عليه الصلاة والسلام يصلي صلاة الفجر وكان يطيل القراءة فيها وهذا من السنة، فسمع بكاء طفل صغير ينادي أمه ببكائه فقرأ الإخلاص وسلم 
""";

  static const String ayahHadithTwelveFive_1 = """
 قال:(سمعت طفلاً يبكي فرحمت أمه) *
""";
  static const String elmTextTwelveFive_2 = """
لقد كان النبي عليه الصلاة والسلام يلهوا مع الأطفال، فقال له أحدهم: تعال نلهوا، ولكنه حينما كان صغيراً دعي إلى اللهو،
 """;
  static const String ayahHadithTwelveFive_2 = """
 فقال:(أنا لم أخلق لهذا) **
""";

  static const String footerTwelveFive = """
---------------------
 لم اقف على تخريجه بهذه الرواية *
 وهناك رواية اصح
 قال صلى الله عليه وسلم
إني لأقوم في الصلاة وأنا أريد أن أطول فيها , فأسمع بكاء الصبي , فأتجوز فيها مخافة أن أشق على أمه
 رواه أبو داود 

  لم اقف على تخريج لهذا الحديث **
  """;

// page 6
  static const String elmTextTwelveSix_1 = """
وحينما جائته رسالة الهدى وحمل أمانة التبليغ دعته زوجته السيدة خديجة لأخذ قسط من الراحة
""";
  static const String ayahHadithTwelveSix_1 = """

فقال لها:(أنقضى عهد النوم ياخديجة)  *

""";

  static const String elmTextTwelveSix_2 = """
إنه شعور بثقل الرسالة وبعظم هذه المسؤولية 
لقد آذاه أهل مكة وأخرجوه منها، وأتمروا على قتله، ونكلوا بأصحابه وعذبوهم، وهجوه بأشعارهم، وناصبوه العداء عشرين عاماً، ولكنه لما فتح مكة وجد عشرة آلاف سيف تنتظر كلمة منه، وكان بإمكانه أن يلغي وجود كفار قريش جميعاً، لكنه
""";
  static const String ayahHadithTwelveSix_2 = """
قال: (ماتظنون أني فاعل بكم ) **
قالوا: أخ كريم وأبن أخ كريم، قال 
   (أذهبوا فأنتم الطلقاء ) 
""";
  static const String footerTwelveSix = """
---------------------
 لم اقف على تخريج الحديث *
  حديث **
  ( اذْهَبُوا فَأَنْتُمْ الطُّلَقَاءُ )
   ضعيف بهذا اللفظ ، ولكن تسمية من أطلقهم النبي صلى الله عليه وسلم وخلى عنهم يوم الفتح بالطلقاء: ثابت في السنة

""";

// page 7
  static const String elmTextTwelveSeven_1 = """
وحينما ذهب مكة فاتحاً كادت ذؤابة عمامته تلامس عنق بعيره تواضعاً لله عز وجل

وكان إذا دخل بيته بسامآ ضحاكا، وكان يقول
""";
  static const String ayahHadithTwelveSeven_1 = """
 * 
   أكرموا النساء فوالله ما أكرمهن إلا كريم، ولا أهانهن إلا لئيم، يغلبن كل كريم ويغلبهن لئيم، وأنا أحب أن أكون كريمآ مغلوبآ من أن أكون لئيمآ غالبآ

دخل بيته مرة **
فقال:( هل عندكم من طعام ) 

قالوا : لا 
 قال:( فإني صائم ) 
""";
  static const String footerTwelveSeven = """
 ------------
 صحة الحديث - الدرر السنية *
 الاسلام سؤال وجواب 
 رقم السؤال 100758
 لا نَعرف عن النبي صلى الله عليه وسلم أنه قال مثل هذا الكلام بهذا اللفظ ، ولا عن أحد من أصحابه أو التابعين ، وإنما يُروَى في ذلك شيءٌ قريب من اللفظ المذكور ، ولكنه أيضا لا يثبت عن النبي صلى الله عليه وسلم 

 حسن صحيح - الالباني **
""";

// page 8
  static const String titleTwelveEight = """
:جوده عليه السلام *
----------------
""";
  static const String ayahHadithTwelveEight_1 = """
حينما أكرمه الله بالمال سأله واحد من الناس
لمن هذا الوادي من الغنم؟ قال
        ( هو لك ) 
قال: أتهزأ بي ؟ قال
        ( هو لك ) 
قال: أشهد أنك رسول الله ، تعطي عطاء من لا يخشى الفقر
""";

  static const String footerTwelveEight = """
---------------------
 لم اجده بهذا اللفظ بل الاصح هو*
- ما سُئِلَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ علَى الإسْلَامِ شيئًا إلَّا أَعْطَاهُ، قالَ: فَجَاءَهُ رَجُلٌ فأعْطَاهُ غَنَمًا بيْنَ جَبَلَيْنِ، فَرَجَعَ إلى قَوْمِهِ، فَقالَ: يا قَوْمِ أَسْلِمُوا، فإنَّ مُحَمَّدًا يُعْطِي عَطَاءً لا يَخْشَى الفَاقَةَ
الراوي : أنس بن مالك | المحدث : مسلم | المصدر : صحيح مسلم | الصفحة أو الرقم : 2312 | خلاصة حكم المحدث : [صحيح] | التخريج : أخرجه مسلم (2312)

  """;

// page 9
  static const String elmTextTwelveNine_1 = """
أمتحن بالنصر فكان كاملآ ، وكان ذا خلق عظيم  وأمتحن بالقهر في الطائف فكان ذا خلق عظيم ، أمتحن بالفقر فكان ذا خلق عظيم ، أمتحن بإشاعة طارت في أرجاء المدينة بأن السيده عائشة وقعت في الفاحشة، فمن منا يتحمل هذا الخبر؟ تأخر الوحي اربعين يومآ فماذا فعل؟ كان صابرآ

""";

// page 10
  static const String elmTextTwelveTen_1 = """
تفاضل المؤمنين بأخلاقهم
المؤمنون يتفاضلون فيما بينهم بخلقهم من زاد عليك في الخلق زاد عليك في الإيمان ، والإيمان بلا خلق شيئ لا قيمة له على الاطلاق ، هو ثقافه، عادات، تقاليد، فلكلور
الدين بلا خلق يفقد قيمته، لذلك ترى قلة قليلة من أصحاب رسول الله وصلت راياتهم إلى اطراف الدنيا ، وترى كثره كثيرة من المسلمين اكثر من ملياري مسلم ليست كلمتهم هي العليا ، وللكفار عليهم ألف سبيل وسبيل

  """;

// page 11
  static const String elmTextTwelveEleven_1 = """
نحن الآن بحاجة إلى خلق عظيم ، لا إلى معلومات كثيرة وسلوك منحرف لا....فهذا الخلق هو الذي ينفعنا عند الله ، هو اللذي يكون سببآ لاستحقاقنا النصر من الله عز وجل
""";

  static const String ayahHadithTwelveEleven_1 = """

     وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِیمࣲ ۝٤ * 
القلم 4 * 

""";

// page 12
  static const String titleTwelveTwelve = """
:تواضعه الشديد
""";
  static const String elmTextTwelveTwelve_1 = """
كان إذا دخل اعرابي على النبي صل الله عليه وسلم يقول: أيكم محمد ؟ ألم يكن له مقعد خاص؟ لا
فقد كان يجلس مع أصحابه ، وكان عليه الصلاةوالسلام يجلس حيث ينتهي به المجلس

  """;

// page 13
  static const String titleTwelveThirteen = """
:قرائة السيره فرض عين
""";
  static const String elmTextTwelveThirteen_1 = """
 إقرأوا سيرة النبي أيها الأخوة ، اقرؤها لأن قرائتها فرض عين ، هل تصدقون ذلك؟؟ إن قرائة سيرة النبي فرض عين طالبوني بالدليل إن شئتم ، الدليل: أن هناك قاعدة فقهية تقول: ما لا يتم الفرض إلا به فهو فرض ، فالصلاة فرض ، والوضؤ فرض ، لأن الصلاة لاتتم إلا به ، وما لا تتم السنة إلا به فهو سنة ، لكن الله جل جلاله حينما أمرنا
""";
  static const String ayahHadithTwelveThirteen_1 = """
 قال:  لَّقَدۡ كَانَ لَكُمۡ فِی رَسُولِ ٱللَّهِ أُسۡوَةٌ حَسَنَةࣱ 
الأحزاب 21 
""";

  static const String elmTextTwelveThirteen_2 = """
فكيف يكون النبي أسوة حسنة لك؟ إن لم تعرف سيرته ، إن لم تعرف أخلاقه ، إن لم تعرف أخذه وعطائه، إن لم تعرف رحمته ، إن لم تعرف لطفه

  """;

// page 14
  static const String titleTwelveFourteen = """
لطفه عليه الصلاة والسلام
------------------""";

  static const String ayahHadithTwelveFourteen_1 = """

قال عليه الصلاة والسلام
    (( لا تحمرو الوجوه)) *
""";
  static const String elmTextTwelveFourteen_1 = """
لاتخجل إنسانآ ، وهذا من خلقه العظيم ، فيجب علينا أن نقرأ سيرة النبي كي نقلده ، لأن الله عز وجل لم يقبل دعوة محبته إلا بإتباع سنة النبي عليه الصلاة والسلام
""";
  static const String ayahHadithTwelveFourteen_2 = """
    قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِی یُحۡبِبۡكُمُ ٱللَّهُ وَیَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ **
ال عمران 31 
""";
  static const String footerTwelveFourteen = """
---------------------
 أورده البعض بمعنى لا تُخجِلوا الناس بالمواجهة 
 ولذلك كان النبي صلى الله عليه وسلم يقول
{ما بال أقوام}
 ولم نقف على تخريجه من مصدر معتمد  
  موقع ليتفقهوا في الدين *


  """;

  // page 15
  static const String elmTextTwelveFifteen_1 = """
في بيته، في ثيابه، في طعامه، كان عليه الصلاة والسلام يأكل كما يأكل العبد، ويجلس كما يجلس العبد، قال
""";
  static const String ayahHadithTwelveFifteen_1 = """
 لو دعيت إلى كراع بالغنيم لأجبت *
""";
  static const String elmTextTwelveFifteen_2 = """
لو دعي إلى مؤدم خارج المدينه للبى الدعوه، دخل مره إلى أحد أصحابه فقدم له خلآ وخبزآ 
""";
  static const String ayahHadithTwelveFifteen_2 = """
 فقال عليه الصلاة والسلام 
     نعم الإدام الخل  **
""";
  static const String elmTextTwelveFifteen_3 = """
ماعاب طعامآ قط في حياته ولم يمدحه ، فهناك كثير من الأشخاص تحدث عن الطعام بطريقة تجعلك تشتهيه ، أما هو عليه الصلاة والسلام فما عاب طعامآ قط ولا مدحه ، ومارُئي مادآ رجليه قط بين اصحابة وهو سيد الخلق
""";
  static const String footerTwelveFifteen = """
---------------------
الراوي *
 أبو هريرة | المحدث : البخاري | المصدر : صحيح البخاري

 الراوي **
  - | المحدث : الهيتمي المكي | المصدر : الزواجر عن اقتراف الكبائر
الصفحة أو الرقم : 2/37 | خلاصة حكم المحدث : صحيح

  """;

  // page 16
  static const String titleTwelveSixteewn = """
حلمه صل الله عليه وسلم
-------------------
""";

  static const String ayahHadithTwelveSixteen_1 = """
وعده شخص فانتضره ثلاثة أيام ، فلما رآه قال 
         ياأخي لقد شققت علي *
""";
  static const String elmTextTwelveSixteen_1 = """
أتعبتني أما الآن فلو تأخر أحدهم عن الموعد ربع ساعة لقامت عليه الدنيا ولم تقعد ، أما النبي عليه الصلاة والسلام فتأخر الرجل عليه ثلاثة أيام مازاد عن أن قال
""";
  static const String ayahHadithTwelveSixteen_2 = """
     لقد شققت علي ياأخي
""";
  static const String elmTextTwelveSixteen_2 = """
أما في بيته كان يركب الحسن والحسين على ظهره ويقول
 """;
  static const String ayahHadithTwelveSixteen_3 = """
      نعم الجمل جملكما ونعم الحملان أنتما **
""";
  static const String ayahHadithTwelveSixteen_4 = """
    
    وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِیمࣲ ۝٤ 
القلم 4 

""";
  static const String elmTextTwelveSixteen_3 = """
إقرؤوا سيرة النبي وقلدوه وأقتفوا أثرها ، واتبعوه كي نسعد في دنيانا وأخرانا
""";
  static const String footerTwelveSixteen = """
---------------------
:لم اجدها بهذا اللفظ إنما*
 يا فتى ! لقد شقَقْتَ عليَّ ، أنا ههنا منذُ ثلاثٍ أنتظرُك
الراوي : عبدالله بن أبي الحمساء | المحدث : الألباني | المصدر : ضعيف الترغيب

 الراوي **
جابر بن عبدالله | المحدث : الألباني | المصدر : السلسلة الضعيفة
ال  صفحة أو الرقم : 2661 | خلاصة حكم المحدث : منكر جداً بهذا السياق 

 """;
// page 17
  static const String titleTwelveSeventeen = """
وقفة 
----
""";
  static const String elmTwelveSeventeen_1 = """
تطبيق سنة رسول الله صل الله عليه وسلم تجعلنا في مأمن من عذاب الله تعالى 
""";
  static const String ayahHadithTwelveSeventeen_1 = """

 وَمَا كَانَ ٱللَّهُ لِیُعَذِّبَهُمۡ وَأَنتَ فِیهِمۡۚ 
الأنفال 33 

""";
  static const String elmTwelveSeventeen_2 = """
من أدق معاني هذه ألأية، يامحمد مادامت سنتك مطبقه في حياتهم ، هم في مأمن من عذاب الله ، أي مستحيل ، وألف ألف ألف مستحيل أن نعذب ونحن نطبق سنة رسول الله 
""";
  static const String ayahHadithTwelveSeventeen_2 = """
 وَمَا كَانَ ٱللَّهُ لِیُعَذِّبَهُمۡ 
""";
  static const String elmTwelveSeventeen_3 = """
هذه "وماكان الله" أشد انواع النفي في اللغة ، هذا اسمه نفي الشأن ، قُل لواحد: هل أنت جائع؟ يقول لك : لأ ، قل له أنت سارق ؟ هذا وضع ثان ، ليس معقولآ أن يقول لك: لا ، يقول لك: ما كان لي أن أسرق ، بعض النحاة عدوا أكثر من عشرين فعلآ ينفى بهذه الصيغة ، لا أسرق ، ولا أرغب ، ولا أتمنى ، ولا أقبل ، ولا أبارك ، ولا أرضى ، ولا أدعم ، مستحيل! ماكان لي أن أسرق ، هذا أشد أنواع النفي ، والله عز وجل يقول
""";
  static const String ayahHadithTwelveSeventeen_3 = """

وما كَانَ ٱللَّهُ لِیُعَذِّبَهُمۡ 

""";
// page 18
  static const String elmTwelveEighteen_1 = """
اي مستحيل والف الف مستحيل أن يعذب المسلمون ومنهج النبي مطبق في حياتهم
  """;

  static const String elmTextTwelveEighteen_2 = """
 يوجد مساجد ؟ نعم ، صلوات ؟ نعم ، اذان ؟ نعم ، حج ؟ نعم 
أما التعامل اليومي ، ياترى في الأسواق هل منهج الله عز وجل مطبق ؟ هل هناك أيمان كاذبه ؟ هل هناك بضاعة محرمة ؟ هل هناك معاص وآثام ؟ هل هناك مواد محرمة ؟ هل هناك طريقة محرمة أو ربا ؟
""";

  static const String ayahHadithTwelveEighteen_1 = """

 وَمَا كَانَ ٱللَّهُ لِیُعَذِّبَهُمۡ وَأَنتَ فِیهِمۡۚ  
الأنفال 33 

""";
  static const String elmTextTwelveEighteen_3 = """
لو انهم طبقو منهج رسول الله مستحيل أن يُعذبو

لايمكن أن نُعذب ومنهج النبي مطبق في حياتنا ، في التفاصيل ، في البيع ، في الشراء ، في الحفلات ، في الفرح ، في الترح ، في السفر ، في الحضر ، في الإقامة ، في الدراسة ، في المعالجة ، في الطب  في الولائم
 """;
}
