class ElmTextDersSeventeen {
  static const String elmTextDersSeventeen1 = """
قد يقول قائل لماذا ادعي ورزقي مقسوم مكفول من قبل ان اولد؟

الله سبحانه وتعالى امرنا بالدعاء
ادْعُونِي أَسْتَجِبْ لَكُمْ ۚ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ

 الدعاء هو العبادة
لم يقُل عن دعائي ، قال 
     ( عن عبادتي ) 

إذا العبادة هي الدعاء ، والدعاء هو العبادة

 الدعاء اعتراف بضعف العبد وافتقاره إلى ربه 
  
الإنسان حينما يدعو الله سبحانه وتعالى ، يعترف بضعفه وبقوة الله ، يعترف بفقره ، وبغنى الله عز وجل ، يعترف بجهله وبعلم الله 
فإذا عرف الإنسان نفسه ، وعرف افتقاره إلى الله ، وعرف ضعفه ، وعرف قوة الله ، ورحمته ، وعلمه ، وحكمته ، وغناه ، وقدرته ، فقد عبد الله عز وجل ، أي انه تلبس بالعبودية ، هذه هي العبادة

أبرز مظاهر العبادة الدعاء ، الصلاة عبادة ، الصوم عبادة ، الحج عبادة ، غض البصر عبادة ، ضبط اللسان عبادة ، أن تقيم بيعك وفق الشرع أنت عابد لله ، ألا تكذب ، وأن تصدق فهذه عبادة
لكن هناك عبادات شعائرية ؛ صلاة وصوم وحج وهناك عبادات تعاملية ؛ صدق وأمانة ، واستقامة ، وبيع حلال ، وكسب حلال ، وإنفاق حلال ، وغض بصر....إلخ

العبادات الشعائرية والتعاملية بمجملها عبادة ، أحد مظاهرها الدعاء  
إنك بالصلاة تتصل بالله في اليوم خمس مرات ، وبالصيام تتصل بالله في العام شهراً ، بالحج تتصل بالله في عمرك شهراً ، لكنك بالدعاء تتصل بالله عند كل حركةٍ وسكنة

أحد ابرز العبادات الدعاء ، وكلما اكثرت من الدعاء كنت أقرب إلى الله عز وجل
 
 """;
  static const String elmTextDersSeventeen2 = """
وفي الحديث
( الدعاء يرد القدر ) 
( لا يرد القضاء إلا الدعاء ) 

( العبادة هي الدعاء) *
( والدعاء مخ العبادة) *

لماذا كان الدعاء عبادة؟ 
لإن الإنسان بفطرته لا يدعو جهة لا يؤمن بوجودها 
أنت لا تدعو جهة لا تؤمن بوجودها ، وأنت لا تدعو جهة لا تسمعك ، وأنت لا تدعو جهة ليست قادرة على تحقيق ماتطلب منها ، وأنت لا تدعو جهة تسمعك وقادرة ، ولكنها لا تريد أن ترحمك 
لمجرد أن تدعو الله عز وجل حكمآ أنت مؤمن بوجوده ، ومؤمن بأنه يسمعك ، ومؤمن بأنه قادر على أن يلبيك ، ومؤمن بأنه يحب أن يلبيك ، خلقك ليرحمك

لذلك يقول الله عز وجل 
 قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ ۖ     
[ سورة الفرقان: 77]

لكن هناك تمهيد لابد منه ، أراد الله عز وجل لحكمة بالغة بالغة ، بالغة أن يكون الإنسان ضعيفا
 ( وَخُلِقَ الْإِنْسَانُ ضَعِيفًا )

هذا ضعف في أصل خلقه
والإنسان كما قال تعالى  
إِنَّ الْإِنْسَانَ خُلِقَ هَلُوعًا (19) إِذَا مَسَّهُ الشَّرُّ جَزُوعًا (20) وَإِذَا مَسَّهُ الْخَيْرُ مَنُوعًا (21) إِلَّا الْمُصَلِّينَ
المعارج: 22

لماذا خلقه الله هلوعاً، جزوعاً ، منوعاً ، ضعيفاً ؟ لإنه لو خلقه قوياً لاستغنى بقوته عن الله عز وجل ، فشقي بإستغنائه 
خلقه ضعيفاً ليفتقر بضعفه فيسعد بإفتقاره ، خلقنا ضعفاء ، وساق لنا بعض المصائب كي نتعرف إليه ، ونتصل به ، ونسعد بقربه ، ونذوق طعم القرب منه

------------
( والدعاء مخ العبادة) *
الرواية فيها ضعف 
الدعاء هو العبادة في الحديث الصحيح
  """;
  static const String elmTextDersSeventeen3 = """
علة الدعاء الإتصال بالله
---
هذه النقطة دقيقة جداً ، علة الدعاء أن تتصل به ، هناك نخبة من البشر يتصلون بالله عز وجل من دون مشكلة ، من دون مصيبة ، من دون ابتلاء ، هؤلا الأنبياء والمرسلون ، وكبار العلماء ، الصديقون ، الصحابة الكرام لكن عامة المسلمين يحتاجون إلى بواعث ، إلى دوافع ، إلى محفزات
أحياناً يضعف الإنسان أمام مشكلة ، ليس له إلا الله ، يدعو الله عز وجل فيستجيب له ، فتزداد عقيدته بالله ، يدعو الله فيستجيب له ، ويذوق طعم القرب منه ، فيلزم هذا الباب ، فكم من مشكلة سببت قرباً منه ، كم من مشكله سببت أن الإنسان بعد أن يعرف الله يزهد فيما سواه
 ( وَخُلِقَ الْإِنْسَانُ ضَعِيفًا )

هذا الضعف في أصل ضعفه ، لمصلحته ليلتجأ إلى ربه

القصد من الدعاء الحقيقي أن تتصل بالله ، وأن تذوق طعم القرب منه ، وأن ترى ألوهيته ، الأمر كله بيده

الدعاء يقوي العقيده 
أجمل كلمة قرأتها عن الدعاء أنه يقوي العقيده أنت ضعيف والأمور صعبة جداً وهناك مشكلة كبيره جدآ لا تحل ، قمت في الليل ، وركعت ركعتين ، وتوجهت إلى الله عز وجل ، وقلت : يارب، ليس، لي سواك، في اليوم التالي شعرت بتبدل جذري، الذي كان مصراً على منعك تساهل معك، ما الذي حصل؟ تشعر أن الله بيده كل شيئ تشعر أن الله بيده من هم دونك ومن هم فوقك بيده الأقوياء بيده الجبابره  

سيدنا موسى لم لم يقتله فرعون ؟ لم هابه ، وأجرى معه مناظرة ؟ وجاء بالسحرة ، الأمر بيد الله عز وجل 
 قَالَا رَبَّنَا إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَا أَوْ أَن يَطْغَىٰ
 قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ

 قَالَ أَصْحَابُ مُوسَى إِنَّا لَمُدْرَكُونَ قَالَ كَلا إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ
ما من مؤمن صادق إلا وله مع الله خبرة في هذا الموضوع يدعوه من كل جوارحه يسأله فيستجيب الله له ليعرفه أنه استمع إلى دعائه ، وأجابه ، وهو بيده كل شيئ ، هذه هي حكمة الدعاء أن تعرف أن الله معك ، حاضر ، ناظر ، سميع ، قريب ، مجيب وحينما يستجيب لك من أجل أن تحبه من أجل أن تثق به من أجل أن تكون معه من أجل أن تخافه وحده ولا تخاف من دونه أحداً 

 """;

//   static const String elmTextDersSeventeen4 = """

// ---------------------

// """;

//   static const String elmTextDersSeventeen5 = """

// ---------------------

//   """;

//   static const String elmTextDersSeventeen6 = """

// ---------------------
// """;

//   static const String elmTextDersSeventeen7 = """

// ---------------------
// """;

//   static const String elmTextDersSeventeen8 = """
// ---------------------

// """;

//   static const String elmTextDersSeventeen9 = """
// ---------------------

//   """;

//   static const String elmTextDersSeventeen10 = """

// ---------------------
// """;

//   static const String elmTextDersSeventeen11 = """

// ---------------------
//   """;

//   static const String elmTextDersSeventeen12 = """
// ---------------------
//   """;

//   static const String elmTextDersSeventeen13 = """
// ---------------------

//   """;
//   static const String elmTextDersSeventeen14 = """

// ---------------------
//   """;

//   static const String elmTextDersSeventeen15 = """
// ---------------------
//  """;

//   static const String elmTextDersSeventeen16 = """
// ---------------------

// """;
//   static const String elmTextDersSeventeen17 = """
// ---------------------

// """;
// static const String elmTextDersSeventeen18 = """

// """;
}
