class ElmTextDersFive {
// page 1
  static const String titleFiveOne = """
العدل
-----
  """;
  static const String ayahHadithFiveOne_1 = """

إِنَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَیۡنَ ٱلنَّاسِ بِمَاۤ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَاۤئِنِینَ خَصِیمࣰا ۝١٠٥  
النساء 105 

""";

  static const String elmTextFiveOne_1 = """
في تاريخ العالم كل الحركات الباطلة تلاشت وأنهارت وأصبحت في مزبلة التاريخ أما الدين ففي نمو دائم هذا الدين الذي جاء به عليه الصلاة والسلام يتنامى كالطود الشامخ، بل انه كلما قاومته يزداد شموخاً لأنه دين الله وهذه معركة البشر اليوم بين الحق والباطل، بين وحي السماء وبين تنظيمات الأرض، بين من يعمل لآخرة أبدية سرمدية وبين من يعمل للدنيا
""";
  static const String footerFiveOne = """
---------------------
لمعرفة القصة الكاملة لأسباب نزول هذه الاية يمكن العودة لتفسير القراءن الكريم للدكتور محمد راتب النابلسي 
""";

// page 2
  static const String ayahHadithFiveTwo_1 = """

قال تعالى 
وَقُلۡ جَاۤءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَـٰطِلُۚ إِنَّ ٱلۡبَـٰطِلَ كَانَ زَهُوقࣰا ۝٨١
الاسراء 81 
""";

  static const String elmTextFiveTwo_1 = """
علينا إقامة الحق فيما بيننا حتى نستحق ان ننتصر
""";
  static const String ayahHadithFiveTwo_2 = """
قال تعالى 
إِنَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ
النساء 105 
""";

//page 3
  static const String elmTextFiveThree_1 = """
أنت على حق والذي أنزله هو الحق وهذا الكتاب الذي أنزل عليك هو الحق لذلك العالم كله الآن مع معركته  مع هذا الكتاب يكاد يكون الصراع في العالم كله بين الحق والباطل بين منهج الله وبين منهج البشر، بين الشهوة وبين الحقيقة، بين الدنيا وبين الآخرة
""";

  static const String ayahHadithFiveThree_1 = """
  لِتَحۡكُمَ بَیۡنَ ٱلنَّاسِ 
النساء 105 
""";

  static const String elmTextFiveThree_2 = """
دققوا ايها الاخوة لم يقل الله عز وجل لتحكم بين المؤمنين

""";

// page 4
  static const String elmTextFiveFour_1 = """
أي انت في أمور الحق ينبغي ألا تفرق بين مسلم وغير مسلم هذا منهج الله لبني البشر فإذا طبق بين الناس سعدوا في الدنيا فإن طبقوه تعبداً لله سعدوا في الدنيا والآخره، وقد تأتي جهات لاتؤمن بالله اصلاً فتأخذ منهج الله وتطبقه فتقطف ثماره يانعة في الدنيا بل إن هذا المنهج الذي بين أيدينا منهج موضوعي بمعنى أن الكافر لو طبقه لاتعبداً بل منفعة قطف ثماره، والدول القوية أحد اسباب قوتها أنها بدافع من عقلها تطبق أحكام هذا المنهج لمصالحها فإذا هي قوية، منهج موضوعي لو طبقه ملحد لقطف ثماره، العدل أن تعطي الإنسان حقه أن تصون له كرامته أن تهيىء له أسباب العيش إلى ماهنالك
""";

// page 5
  static const String elmTextsFiveFive_1 = """
ما صرف الناس عن الدين إلا لأنهم فرقوا بين مسلم وغير مسلم
""";
  static const String ayahHadithFiveFive_1 = """
قال سبحانه وتعالى 
وَلَا یَجۡرِمَنَّكُمۡ شَنَءَانُ قَوۡمٍ عَلَىٰۤ أَلَّا تَعۡدِلُوا۟ۚ ٱعۡدِلُوا۟ هُوَ أَقۡرَبُ لِلتَّقۡوَىٰۖ
المائدة 8 
""";

  static const String elmTextsFiveFive_2 = """
من غش مطلقاً، ولو غششت كافراً، ولو غششت عابد صنم فلست من المسلمين
  """;

// page 6
  static const String elmTextFiveSix_1 = """
حينما أرسل النبي عليه الصلاة والسلام عبدالله بن رواحة ليقيم تمر خيبر أراد اليهود أن يغروه بحلي نسائهم لعله يخفض التقييم فيفوز بربح وفير، فقال هذا الصحابي الجليل: جئتكم من عند أحب الخلق إلي من عند محمد بن عبدالله ولأنتم أبغض إلي من القردة والخنازير ومع ذلك لن أحيف عليكم، فقال اليهود: بهذا قامت السماوات والأرض وبهذا غلبتمونا، والآن والله الذي لاإله إلا هو  لا يمكن أن ننتصر على أعدائنا إلا إذا كنا على حق، إلا إذا كنا منصفين، إلا إذا أزلنا المظالم فيما بيننا

  """;

// page 7
  static const String elmTextFiveSeven_1 = """
مسلمون موحدون يتجهون إلى قبلة واحدة، يشهدون أنه لا إله إلا الله، ومعظمهم يأكل حقوق بعضهم البعض، فهذا الإنسان حينما يعتدي على أخيه الإنسان يسقط من عين الله، ولئِن يسقط الإنسان من السماء إلى الأرض أهون من أن يسقط من عين الله، حينما يهون أمر الله على المسلمين نهون على الله عز وجل 

  """;
  // page 8
  static const String elmTextFiveEight_1 = """
على كلٍ موضوع الحق، الله هو الحق، وهذا الدين دين الحق، والقرآن حق، والنبي حق، والأوامر حق، والنواهي حق، وحينما نعتدي على بعضنا بعضاً ينبغي ألا نطمع أن ينظر الله لنا، أو أن يرحمنا، والمظالم في بلاد المسلمين لاتعد ولاتحصى، أي الضعيف يُستَغل، ضعيف التفكير يُستَغل، ضعيف القوة يُستَغل، فإذا أردنا أن ننتصر يجب أن نقيم الحق فيما بيننا حتى نستحق أن ننتصر

  """;

  // page 9
  static const String elmTextFiveNine_1 = """
من أسباب هلاك الأمم الظلم، وإن الله ينصر الأمة العادلة الكافرة على الأمة المسلمة الظالمة
معظم أسباب هلاك الأمم موجودة في المسلمين اليوم الأقوام السابقون كان الله عز وجل يهلك الأمة لمعصية واحدة، فإذا أجتمعت كل المعاصي في المسلمين فشيء طبيعي جداً أن يتخلى الله عنا، لايلتفت إلى دعوانا
""";
  static const String ayahHadithFiveNine_1 = """
:قال تعالى 
قُلۡ إِن كُنتُمۡ تُحِبُّونَ ٱللَّهَ فَٱتَّبِعُونِی یُحۡبِبۡكُمُ ٱللَّهُ وَیَغۡفِرۡ لَكُمۡ ذُنُوبَكُمۡۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ ۝٣١
ال عمران 31 
 """;

// page 10
  static const String elmTextFiveTen_1 = """
حتى نعمة الأمن قد نحرم منها بسبب الظلم
""";
  static const String ayahHadithFiveTen_1 = """
قال تعالى 
فَأَیُّ ٱلۡفَرِیقَیۡنِ أَحَقُّ بِٱلۡأَمۡنِۖ إِن كُنتُمۡ تَعۡلَمُونَ ۝٨١
الانعام 81 

قال تعالى 
ٱلَّذِینَ ءَامَنُوا۟ وَلَمۡ یَلۡبِسُوۤا۟ إِیمَـٰنَهُم بِظُلۡمٍ أُو۟لَـٰۤئِكَ لَهُمُ ٱلۡأَمۡنُ وَهُم مُّهۡتَدُونَ ۝٨٢
الانعام 82 
""";

  static const String elmTextFiveTen_2 = """
أما إذا ألبس المؤمن إيمانه بالظلم ليس آمناً، وليس ناجياً وسوف يعذب أشد العذاب
 """;
  static const String ayahHadithFiveTen_2 = """
   قال تعالى 
وَتِلۡكَ ٱلۡقُرَىٰۤ أَهۡلَكۡنَـٰهُمۡ لَمَّا ظَلَمُوا۟ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدࣰا ۝٥٩
الكهف 59 

   قال تعالى 
وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ ۝٣٠
الشورى 31 

   قال تعالى 
وَلَنُذِیقَنَّهُم مِّنَ ٱلۡعَذَابِ ٱلۡأَدۡنَىٰ دُونَ ٱلۡعَذَابِ ٱلۡأَكۡبَرِ لَعَلَّهُمۡ یَرۡجِعُونَ ۝٢١
 السجدة 21 
""";
  static const String elmTextFiveTen_3 = """
والعذاب الادنى أي البلاء والمحن والمصائب في الدنيا قبل الاخرة وهناك من يظن أن مايحصل له إبتلاء من الله وأن الله يحبه 
فيستمر في ظلمة لغيرة او حتى لنفسه في حين أن ذالك قد يكون تأديب أو عقاب من الله عز وجل
  """;

  // page 11
  static const String elmTextFiveEleven_1 = """
وكما قلنا سابقاً لايمكن أن نشم رائحة النصر إذا كان بعضنا يظلم بعضنا الآخر، كم من زوج يظلم زوجته؟ وكم من رب عمل يظلم عماله؟ وكم من صاحب أرض يظلم فلاحه؟ وكم من قوي يأكل الضعيف؟ وكم من غني يستغل الفقير؟ وكم؟ وكم؟ 
 """;

// page 12
  static const String elmTextFiveTwelve_1 = """
حينما يظلم بعضنا بعضاً لايمكن أن نشم رائحة النصر لأجل ذلك كله حينما يفهم الناس الدين فهماً صحيحاً يستحقون نصر الله عز وجل

قال بعض العلماء: والله ترك دانق من حرام خير من ثمانين حجة بعد حجة الإسلام هذا هو الدين، درء المفاسد مقدم على جلب المنافع، حينما يفهم الناس هذا الفهم يستحقون نصر الله عز وجل

""";
// page 13
  static const String titleFiveThirteen = """
وقفه  
----
""";
  static const String ayahHadithFiveThirteen_1 = """
 ۞ إِنَّ ٱللَّهَ یَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَـٰنِ 
النحل 90 
""";
  static const String elmTextFiveThirteen_1 = """
كما انك مأمور بالعدل فأنت مأمور بالإحسان، العدل: توزيع الأموال وفق النصيب المفروض، والإحسان 
""";
  static const String ayahHadithFiveThirteen_2 = """
قال تعالى 
وَإِذَا حَضَرَ ٱلۡقِسۡمَةَ أُو۟لُوا۟ ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینُ فَٱرۡزُقُوهُم مِّنۡهُ 
النساء 8 
""";

  static const String elmTextFiveThirteen_2 = """
العدل: قسري، والإحسان: طوعي، لكنك مأمور بالعدل والإحسان

العدل نصيب مفروض فهو قسري أما الإحسان فهو طوعي، والف قضيه لاتستقيم على العدل، لكنها تستقيم على الإحسان

""";
}
