import 'package:elm/core/data/model/khatira_page_content.dart';
import 'package:elm/core/data/static/theme/app_them.dart';
import 'package:flutter/material.dart';

class ElmTextDersThree {
  static final List<KhatiraPageContent> pages = [
    KhatiraPageContent(content: [
      // 1
      TextSpan(text: """
العطاء (المال والملك) ليس مقياس لحب الله
-----------------------------------
""", style: AppTheme.customTextStyleTitle()),
      // 2
      TextSpan(
        text: """
بعض أو معظم الناس يظن بأن من اعطاه الله مالاً وفيراً أو منصباً لائقاً أو زوجة جيدة أو تجارة عريضة أو صحة جيدة يظن بأنه محظوظ أو أن الله يحبه ويكرمه لايعرفون بأن المال أحيان كثيرة يكون استدراج وامتحان من الله لأن الله سبحانه وتعالى يعطي الدنيا لمن يحب ولمن لايحب ولايمكن أن تكون الدنيا والعطاء مقياساً لمحبة الله عز وجل فلينظر ناظر بعقله أن الله أكرم رسولنا عليه الصلاة والسلام أم اهانه حين زوى عنه الدنيا فإن قال أهانه فقد كذب، وإن قال أكرمه فلقد أهان غيره حيث أعطاه الدنيا، المال الذي يعطيه الله عز وجل ليس إكراماً بل هو ابتلاء وأي عطاء ينتهي عند الموت ليس بعطاء 
""",
        style: AppTheme.customTextStyleText(),
      ),
      // 3
      TextSpan(text: """
قال تعالى 
أَحَسِبَ ٱلنَّاسُ أَن یُتۡرَكُوۤا۟ أَن یَقُولُوۤا۟ ءَامَنَّا وَهُمۡ لَا یُفۡتَنُونَ ۝٢
العنكبوت 2 

""", style: AppTheme.customTextStyleHadith()),
      // 4
      TextSpan(text: """
 ولأنهم  لايعرفون بأن الله وزع الحظوظ في الدنيا توزيع ابتلاء وفي الآخرة توزيع جزاء
""", style: AppTheme.customTextStyleHadith()),
      // 5
      TextSpan(text: """
قال تعالى 
ٱنظُرۡ كَیۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲۚ وَلَلۡءَاخِرَةُ أَكۡبَرُ دَرَجَـٰتࣲ وَأَكۡبَرُ تَفۡضِیلࣰا ۝٢١
الاسراء 21 
""", style: AppTheme.customTextStyleHadith()),
      // 6
      TextSpan(text: """
الناس في الدنيا متفاوتون الصحة درجات، والشكل درجات، والقوة درجات، والمكانة الاجتماعية درجات، والذكاء درجات، والدخل درجات، وهكذا تقتضي الحكمة الإلهية أن يكون الناس درجات لاكن هذه الدرجات مؤقتة وقد يكون الفقير عند الله عز وجل أعظم  من أعلى مرتبة في الارض
""", style: AppTheme.customTextStyleText()),
      // 7
      TextSpan(text: """
هناك تفضيل في الصحة وفي المال وفي الجمال وفي الذكاء وفي القوة وفي المكانة وفي كل شيء؛ الحياة مراتب لاكن هذه المراتب الدنيوية مؤقتة وتنتهي بالموت الله سبحانه وتعالى يمتحن كل إنسان ليرى صدقه من كذبه
""", style: AppTheme.customTextStyleText()),
      // 8
      TextSpan(text: """ قال تعالى 
۞ إِنَّ قَـٰرُونَ كَانَ مِن قَوۡمِ مُوسَىٰ فَبَغَىٰ عَلَیۡهِمۡۖ وَءَاتَیۡنَـٰهُ مِنَ ٱلۡكُنُوزِ مَاۤ إِنَّ مَفَاتِحَهُۥ لَتَنُوۤأُ بِٱلۡعُصۡبَةِ 
القصص 76 
""", style: AppTheme.customTextStyleHadith()),
      // 9
      TextSpan(text: """
 وكما قلنا سابقاً أن المال والملك ليس مقياس لحب الله فلقد أعطى قارون المال وهو لايحبه، وأعطى فرعون الملك وهو لايحبه أعطى الأنبياء العلم والحكمة وهو يحبهم فانظر عطائك من أي نوع؛ هناك من يملك الرقاب وهناك من يملك القلوب الأنبياء بكمالهم ملكوا القلوب والأقوياء بقوتهم ملكوا الرقاب والأنبياء لهم اتباع والأقوياء لهم اتباع
""", style: AppTheme.customTextStyleText()),
      // 10
      TextSpan(text: """
ويقول رسولنا الكريم
 تعس عبد الدينار وعبد الدرهم تعس عبد الخميصة
رواة البخاري 

وقال سبحانه وتعالى 
وَتَأۡكُلُونَ ٱلتُّرَاثَ أَكۡلࣰا لَّمࣰّا ۝١٩
وَتُحِبُّونَ ٱلۡمَالَ حُبࣰّا جَمࣰّا ۝٢٠
الفجر 19 
""", style: AppTheme.customTextStyleHadith()),
      // 11
      TextSpan(text: """
تأكلون التراث أي الإرث فالمنازعات الآن بين الأسر والعداوات والمحاكمات والقضاء مثقل بمشكلات  الإرث كل طرف يحب أن يأخذ كل الإرث وحده وأن يحرم الباقين ولايرضى المرء أن يأخذ ماله يريد أن يأخذ ماله ومال غيره وعلامة المؤمن أنه يكتفي بماله بما قسم له الله

""", style: AppTheme.customTextStyleText()),

      // 12
      TextSpan(text: """
وأخيراً وليس آخراً عزيزي القارىء إذا أردت أن تعرف من هم الذين يحبهم الله انظر في درسنا القادم
""", style: AppTheme.customTextStyleText())
    ])
  ];
}
