class ElmTextDersOne {
// page 1
  static const String titleOneOne = """
عوامل تفكك وفشل الأسرة والقبيلة
--------------------------
  """;
  static const String elmTextOneOne_1 = """
هناك عدة عوامل واسباب لتحطيم وفشل بعض او معظم الاسر والقبائل بشكل عام وبعض أو معظم مالكي الاراضي بشكل خاص وبيعهم للارض بأبخس الاثمان وتماديهم لدرجة انهم يظلموا متعمدين او دون ان يشعروا مما يؤدي إلى كثرة المشاكل والثارات 

  """;

  static const String elmTextOneOne_2 = """
          (1)
عدم فهم بعض أفراد المجتمع لأهمية دور العاقل أو الوكيل أو شيخ القبيلة وضرورة وجوده كرئيس مصغر للحكومة الاسرية يدير شؤونها وينظم اهدافها وضرورة احترامه وتقديره واحترام توجيهاته وتقدير مشاعره وكل جهود يبذلها لمصلحة الجميع

""";

  static const String elmTextOneOne_3 = """
وبالمقابل عدم فهم هذا العاقل او الوكيل او شيخ القبيلة لمسؤليته تجاه اسرته ومجتمعه وماذا يعني له شأن انه مقلد بعهد الله تعالى وميثاقه وأن عليه الرقابة الالهية المستمرة تجاه تصرفاته وخطواته 
""";

// page 2
  static const String ayahHadithOneTwo_1 = """
 و َقِفُوهُمۡۖ إِنَّهُم مَّسۡءُولُونَ ۝٢٤ 
الصافات 

 فَوَرَبِّكَ لَنَسۡءَلَنَّهُمۡ أَجۡمَعِینَ ۝٩٢ 
 عَمَّا كَانُوا۟ یَعۡمَلُونَ ۝٩٣ 
 سورة الحجر 

  """;
  static const String elmTextOneTwo_1 = """
          (2)
القصور لدى البعض بأهمية مسألة العمل الجماعي والتعاوني والتكافل الاجتماعي وأهمية التوحد والاعتصام بحبل الله جميعاً وعدم التفرق الذي يذهب ريحكم.....الخ
والتعاون على البر والتقوى
وكل ذالك بسبب عدم تدبرهم لقوله تعالى
""";
// page 3
  static const String ayahHadithOneThree_1 = """
وَلَا تَنَـٰزَعُوا۟ فَتَفۡشَلُوا۟ وَتَذۡهَبَ رِیحُكُمۡۖ وَٱصۡبِرُوۤا۟ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِینَ ۝٤٦
الانفال  

""";

  static const String elmTextOneThree_1 = """
          (3)
قلة الوعي لدى بعض الاسر بالمجتمع وعدم الاستشعار لدى معظم الناس لخطورة الشيطان ووساوسه وقد حذرنا الله 
  """;

  static const String ayahHadithOneThree_2 = """
 بقوله سبحانه وتعالى 
إِنَّ ٱلشَّیۡطَـٰنَ لَكُمۡ عَدُوࣱّ فَٱتَّخِذُوهُ عَدُوًّاۚ إِنَّمَا یَدۡعُوا۟ حِزۡبَهُۥ لِیَكُونُوا۟ مِنۡ أَصۡحَـٰبِ ٱلسَّعِیرِ ۝٦

فاطر  
""";
// page 4
  static const String elmTextOneFour_1 = """
          (4)
مرض العظمة والغرور وعدم الاعتراف بمنجزات الآخرين حتى وإن كانت­ عظيمة«يرونها بعين الاحتقار» ويستصغرونها وكأنها ليست بشيء ممكن ان يهدموا كل ماضيك الجميل مقابل موقف لم يعجبهم ينظرون للوجه المظلم ويتركون الوجه المشرق إن صح التعبير

  """;

  static const String elmTextOneFour_2 = """
          (5)
الكبر والاستعلاء وهذا من عمل الشيطان 
  """;
  static const String ayahHadithOneFour_1 = """
قال تعالى 
أَنَا۠ خَیۡرࣱ مِّنۡهُ خَلَقۡتَنِی مِن نَّارࣲ وَخَلَقۡتَهُۥ مِن طِینࣲ ۝١٢
الأعراف  

قال تعالى 
كَذَ ٰلِكَ یَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرࣲ جَبَّارࣲ ۝٣٥
غافر  

""";
// page 5
  static const String elmTextOneFive_1 = """
          (6)
مرض الأنانية اخطاء الآخرين كبيرة وعظيمة وأخطائهم صغيرة هذا إن اعترفوا بأنهم أخطأو

  """;
  static const String ayahHadithOneFive_1 = """
تِلۡكَ إِذࣰا قِسۡمَةࣱ ضِیزَىٰۤ ۝٢٢ 
النجم 

""";

  static const String elmTextOneFive_2 = """
          (7)
الشك والوهم التسرع في الحكم على الآخرين الأحكام الجائرة المبنية على سوء الظن والشك والوهم لأنهم لم يتدبروا
قوله سبحانه وتعالى 
  """;

  static const String ayahHadithOneFive_2 = """
 إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمࣱۖ 
الحجرات  
""";
// page 6
  static const String ayahHadithOneSix_1 = """
 [إلتمس لأخيك سبعين عذراً] *
  """;
  static const String footerOneSix = """
---------------------
 مجموع فتاوى إبن باز *
لا أعلم له أصلًا، والمشروع للمؤمن أن يحترم أخاه إذا اعتذر إليه ويقبل عذره إذا أمكن ذلك، ويحسن به الظن حيث أمكن ذلك، حرصًا على سلامة القلوب من البغضاء، ورغبة في جمع الكلمة والتعاون على الخير، وقد روي عن عمر  أنه قال: (لا تظن بكلمة صدرت من أخيك شرًا وأنت تجد لها في الخير محملًا)
  """;

// page 7
  static const String elmTextOneSeven_1 = """
       (8)
    :بعض النساء 
  """;
  static const String ayahHadithOneSeven_1 = """
 [إِنَّ كَیۡدَكُنَّ عَظِیمࣱ ۝٢٨]
يوسف 

الله سبحانه وتعالى يقول 
 وَلِلرِّجَالِ عَلَیۡهِنَّ دَرَجَةࣱۗ وَٱللَّهُ عَزِیزٌ حَكِیمٌ ۝٢٢٨
البقرة  
""";

  static const String elmTextOneSeven_2 = """
 الرجل يزيد عن المرأة بدرجة واحدة هي درجة القيادة درجة القرار فلابد من إنسان واحد يقول لا أو نعم، لأن الرجل بعد نظره كبير، وقراره حاسم، وإدراكه أعمق، ومعرفته بالحياة أدق، وخبرته بالمشكلات أعمق، فلابد من صاحب قرار والقرار هو هذه الدرجة، درجة القيادة

""";
// page 8
  static const String elmTextOneEight_1 = """
          (9)
القيل والقال [والهمز واللمز]
 والكلام الذي يجرح مشاعر الآخرين والذي يسبب الجفاء والبعد والقِمر والتعنت وذلك لعدم تدبرهم لقوله سبحانه وتعالى
""";

  static const String ayahHadithOneEight_1 = """
وَیۡلࣱ لِّكُلِّ هُمَزَةࣲ لُّمَزَةٍ ۝١ 
الهمزة 
""";

  static const String elmTextOneEight_2 = """
 والويل وادي في جهنم وبعضهم قالوا أن الويل الهلاك والشقاء والخسارة
  """;

// page 9
  static const String elmTextOneNine_1 = """
          (11)
الإسراف والتبذير وعدم الترتيب والإقتصاد في المعيشة
""";

  static const String ayahHadithOneNine_1 = """
إِنَّ ٱلۡمُبَذِّرِینَ كَانُوۤا۟ إِخۡوَ ٰنَ ٱلشَّیَـٰطِینِۖ 
الاسراء 27 

وَلَا تُسۡرِفُوۤا۟ۚ إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ ۝١٤١ 
الانعام 141 
    
إِنَّ ٱللَّهَ لَا یَهۡدِی مَنۡ هُوَ مُسۡرِفࣱ كَذَّابࣱ ۝٢٨ 
غافر 28 
""";
  static const String elmTextOneNine_2 = """
   وذلك مايجعل النفس طماعة وتتمادى على حق الغير
""";

// page 10
  static const String elmTextOneTen_1 = """
(12)
برود الهمة وضعف الإرادة للعمل أو المتاجرة وتوسيع مداخل الكسب الحلال وهذا يعود على الآباء الذين لم يربوا أولادهم على هذا الشيء منذ الصغر
""";

  static const String ayahHadithOneTen_1 = """
 [من شب على شيء شاب عليه] *
""";

  static const String footerOneTen = """
---------------------
مقولة لها شواهد من القراءن والسنة *
منها قول الله تعالى: (بَلْ قَالُوا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّهْتَدُونَ)
 ومن الأدلة قوله عليه الصلاة والسلام: (كل مولود يولد على الفطرة فأبواه يهودانه أو ينصرانه أو يمجسانه)
  """;

// page 11
  static const String elmTextOneEleven_1 = """
          (13)
الحسد وهو تمني زوال النعمة عن الغير دائماً ينظرون لما في يد الغير كثير ومافي أيديهم قليل ولايشكرون الله على ماأنعم عليهم حتى إذا كان مافي يد الغير
خاص[فضل وكرم من الله] لأنهم ماتدبروا قوله سبحانه وتعالى
  """;

  static const String ayahHadithOneEleven_1 = """
 وَلَا تَتَمَنَّوۡا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲۚ 
النساء 32 
 
أَمۡ یَحۡسُدُونَ ٱلنَّاسَ عَلَىٰ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۖ
النساء 54
  """;

// page 12
  static const String elmTextOneTwelve_1 = """
(14)
ضعف الإيمان [ايمان البعض شكلي] يظن البعض بأن الرزق يحتاج إلى دهاء وذكاء وحيلة ومكر وخداع وإذا لم يستخدم عقله سيضيع مستقبله أو مستقبل أبنائه
""";

  static const String ayahHadithOneTwelve_1 = """
قال تعالى 
ٱلشَّیۡطَـٰنُ یَعِدُكُمُ ٱلۡفَقۡرَ 
البقرة 268 
 
 وماتدبروا قوله سبحانه وتعالى 
 وَیَمۡكُرُونَ وَیَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَیۡرُ ٱلۡمَـٰكِرِینَ ۝٣٠
الانفال 33 
 """;

  static const String elmTextOneTwelve_2 = """
  ولم يثقوا بوعود الله في القرآن
 """;

  static const String ayahHadithOneTwelve_2 = """
 قال تعالى 
 وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا 
هود 6 
   
 قال تعالى 
وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰۤ ءَامَنُوا۟ وَٱتَّقَوۡا۟ لَفَتَحۡنَا عَلَیۡهِم بَرَكَـٰتࣲ مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِ
الاعراف 96
  
 قال تعالى 
وَلَوۡ أَنَّهُمۡ أَقَامُوا۟ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِیلَ وَمَاۤ أُنزِلَ إِلَیۡهِم مِّن رَّبِّهِمۡ لَأَكَلُوا۟ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۚ 
المائدة 66

 قال تعالى 
وَأَلَّوِ ٱسۡتَقَـٰمُوا۟ عَلَى ٱلطَّرِیقَةِ لَأَسۡقَیۡنَـٰهُم مَّاۤءً غَدَقࣰا ۝١٦  
الجن 16 

  """;

  // page 13
  static const String elmTextOneThirteen_1 = """
          (15)
  قلة الاحترام، الصغير لايحترم الكبير
 
  """;

  static const String elmTextOneThirteen_2 = """
          (16)
تدخل الأبناء والصغار بخلافات الآباء وعدم احترام مجالس الكبار وعدم توقير كبار السن 

  """;

  static const String ayahHadithOneThirteen_1 = """
قال تعالى 
 إِنَّ مِنۡ أَزۡوَ ٰجِكُمۡ وَأَوۡلَـٰدِكُمۡ عَدُوࣰّا لَّكُمۡ فَٱحۡذَرُوهُمۡۚ 
التغابن 14 

 """;

  // page 14
  static const String elmTextOneFourteen_1 = """
          (17)
التنافس والمباهاة والتفاخر بالمنازل والمأكل والملبس والسيارات ووسائل التواصل الاجتماعي [الهواتف النقالة والالكترونيات] لاأكثر ولا أقل
 """;
  static const String elmTextOneFourteen_2 = """
          (18)
الاستعجال والمسابقة في بيع الأرض تحت شعار
[بيع ولاتخلي اسمك يضيع] *

""";

  static const String footerOneFourteen = """
---------------------
 مثل يمني *
  """;

  // page 15
  static const String elmTextOneFifteen_1 = """
          (19)
الشماتة [الشماتة أيضاً لها دور كبير لأن كل شيء يمكن تداركه بالاستغفار والتوبة إلا الشماتة لايمكن تداركها حتى وإن لم تنطق بكلمة يكفي بأن تحدث نفسك بأن فلان فاشل أو ضعيف أو سارق أو.. أو.. أو..] خاصة من يتشفى أو يفرح لمصيبة حصلت لأخيه وضع نفسه في خندق المنافقين دون أن يشعر
 """;

  static const String elmTextOneFifteen_2 = """
          (20)
كل من أخطأ أو تعثر أو فشل أو عجز عن تحقيق طموحاته يجعل من الآخرين شماعة يعلق عليها أخطائه وفشله الذريع

""";
// page 16
  static const String elmTextOneSixteen_1 = """
          (21)
عدم الاهتمام بالعلم وتوجيه الابناء التوجيه الصحيح وتشجيعهم على العلم والتعلم والمعرفة وتوعيتهم ولفت انتباههم لأهمية العلم وقيمة المتعلم في المجتمع 
*
إذا أردت الدنيا فعليك بالعلم 
وإذا أردت الآخرة فعليك بالعلم
 وإن اردتهما معاً فعليك بالعلم
""";

  static const String footerOneSixteen = """
---------------------
ذٌكر عن الإمام الشافعي *
""";

// page 17
  static const String elmTextOneSeventeen_1 = """
          (22)
نبتة القات عندنا في اليمن وببعض الدول المجاورة والقنوات الفضائية وسهر الليل بعضهم يتأثر نفسياً بسبب سهر الليل ربنا سبحانه وتعالى يقول 

  """;
  static const String ayahHadithOneSeventeen_1 = """
وَجَعَلۡنَا ٱلَّیۡلَ لِبَاسࣰا ۝١٠
وَجَعَلۡنَا ٱلنَّهَارَ مَعَاشࣰا ۝١١ 
النبأ 10 

""";

// page 18
  static const String elmTextOneEighteen_1 = """
          (23)
التسويف وعدم استغلال الوقت الاستغلال الصحيح تجاهلوا بأن أثمن شيء في حياة الإنسان هو الوقت [العمر] الله سبحانه وتعالى اقسم بمطلق الزمن


  """;
  static const String ayahHadithOneEighteen_1 = """
وَٱلۡعَصۡرِ ۝١ 
إِنَّ ٱلۡإِنسَـٰنَ لَفِی خُسۡرٍ ۝٢ 
العصر 

  """;
  static const String elmTextOneEighteen_2 = """
وأقسم أيضاً بعمر النبي 
""";

  static const String ayahHadithOneEighteen_2 = """
(لَعَمۡرُكَ إِنَّهُمۡ لَفِی سَكۡرَتِهِمۡ یَعۡمَهُونَ ۝٧٢) 
الحجر 78 

  """;
  static const String elmTextOneEighteen_3 = """
العمر الثمين الذي قضّاه كله لله والعظيم لايقسم إلا بعظيم والبعض أشغلوا أنفسهم بقضايا وأمور ليس لها أي فائدة ونسوا أن أخطر قضية في حياة الإنسان [الموت]

""";

// page 19
  static const String elmTextOneNinteen_1 = """
وفي الأخير لا للتعميم لأن التعميم من العمى[عمى البصيرة] وإنما نقول نعم للتبعيض وكل هذه العوامل التي ذكرناها أنفاً لاتنطبق على الجميع وإنما تنطبق على البعض وكل من يرى في نفسه شيء من هذا سيجد نفسه بين السطور

""";

// 20
  static const String subtitleOneTwenty = """
وقفه 
----
  """;
  static const String elmTextOneTwenty_1 = """
رسولنا الكريم بين لنا سبيل التعاون وحذرنا من سبل التفرقه فكل ما من شأنه أن يقوي العلاقة بين المؤمنين امر النبي به، وكل ما من شأنه ان يبعد فيما بينهم نهى النبي عنه، فنهى عن الغيبه لأنها تمزق المجتمع، ونهى عن النميمة، ونهى عن السخرية، ونهى عن الغمز واللمز
امرنا بأسباب الحب، ونهانا عن اسباب البغضاء
وكل ما من شأنه ان يضعف العلاقة بين المؤمنين نهى النبي عنه
""";
// قبل الوققة او بعد الوقفة

  // page 21
  static const String elmTextOneTwentyOne_1 = """
▪️اللمز هو إشاعة العيوب والتعيير وكشف العورات 
""";
  static const String ayahHadithOneTwentyOne_1 = """

          ولا تلمزوا أنفسكم 

 """;
  static const String elmTextOneTwentyOne_2 = """
▪️دعوة الله عز وجل المؤمنين إلى أن يكونوا كالجسد الواحد 
  """;
  static const String ayahHadithOneTwentyOne_2 = """
          أنفسكم 

قال الله عز وجل 
          ولا تأكلوا أموالكم بينكم بالباطل 
""";
  static const String elmTextOneTwentyOne_3 = """
أي إن أكلت مال أخيك فكأنما أكلت مالك لأنه أخوك إن قوي فقوته لك، وإن أضعفته تضعف أنت معه، فإذا أكلت ماله فكأنما أكلت مالك 
""";
  static const String ayahHadithOneTwentyOne_3 = """
          ولا تلمزوا أنفسكم 
""";

  static const String elmTextOneTwentyOne_4 = """
يُقاس عليها 
""";
  static const String ayahHadithOneTwentyOne_4 = """
          ولا تقتلوا أنفسكم 
""";
  static const String elmTextOneTwentyOne_5 = """
أنت أخرجت عنصراً مؤمناً من المجتمع، فضعف المجتمع 
ولا تلمزوا أنفسكم آية لها عدة معان 
1__على الإنسان أن لا يكون طعاناً أو لعاناً أو منتقداً 
حيثما وردت هذه الآية ومثيلاتها 
""";

  static const String ayahHadithOneTwentyOne_5 = """
          ولا تقتلوا انفسكم 
          ولا تلمزوا أنفسكم 
          ولا تأكلوا أموالكم بينكم بالباطل 
""";
// page 22
  static const String elmTextOneTwentyTwo_1 = """
فالله سبحانه وتعالى عد المجتمع الإسلامي مجتمعاً واحداً، فإذا أضعفت أحد أفراده أضعفت المجتمع كله، وهذا معنى 
2__على الإنسان ألا يفعل عملاً يلام عليه 
والمعنى الثاني لا تفعل شيئاً تستحق أن تُعير به 
""";
  static const String ayahHadithOneTwentyTwo_1 = """
          ولا تلمزوا أنفسكم 
""";

  static const String elmTextOneTwentyTwo_2 = """
إياك أن تفعل شيئاً تدعو الناس به إلى ذمِك فلا تضع نفسك موضع التُهمة ثم تلوم الناس إذا أتهموك، وإياك وما يُعتذر منه، وأي عمل يصغرك تضطر أن تعتذر وأن تقول: لم أكن أعرف فسامحونا، ولا تؤاخذونا، فهذه الأعمال التي تحملك على أن تعتذر منها لا تليق بك 

▪️المؤمنون بمثابة الجسد الواحد 
""";

  static const String ayahHadithOneTwentyTwo_2 = """
          ولا تلمزوا أنفسكم 
          """;

  static const String elmTextOneTwentyTwo_3 = """
لن تجد إنساناً يحتقر نفسه لكنه يحتقر أخاه، يطعن بأخيه، فإن طعنت بأخيك طعنت بنفسك 
لم يقُل: ولا تلمزوا إخوانكم، ولكنه قال: هذا أخوك سمعته من سمعتك 

▪️الله سبحانه وتعالى يحبنا أن نكون منتظمين ومتعاونين كالجسد الواحد 
الله عز وجل أرادنا أن نكون جماعة، وأرادنا أن نكون متعاونين، متباذلين، متناصرين،متضامنين، متناصحين، ولا يُحبنا الله عز وجل إلا بهذا النظام والتعاون، قال تعالى: 
""";

  static const String ayahHadithOneTwentyTwo_3 = """
وتعاونوا على البر والتقوى ولا تعاونوا على الإثم والعدوان 
""";

// page 23
  static const String elmTextOneTwentyThree_1 = """
▪️السخرية علامة جهل وشرك وتجبر 

▪️الجاهل من يسخر من الإنسان الفقير المستضعف

▪️موضوع السخرية موضوع فيه شرك بالله وتجبر على عباده 

▪️الإنسان العاقل لا يسخر من أحد حتى ممن يعص الله فلعل الله يتوب عليه 

▪️المؤمن الحقيقي هو المؤمن الذي يبعد عن السخرية وتعليقاتها 

▪️كل إنسان يعتز بشيئ ويحتقر ما عند الآخرين يقصمه الله عز وجل 

▪️على الإنسان ألا يحتقر الآخرين أو ينتقص منهم 
السخرية لا تقتصر على اللسان، فأحياناً بحركة تحاكي بها حركة إنسان فهي سخرية، وأحياناً بإشارة، وغمز وحركة عينين، وتحريك عضلات الوجه فيها سخرية، قال بعض علماء التفسير في قوله تعالى: 
 """;

  static const String ayahHadithOneTwentyThree_1 = """
ياويلتاه ما لهذا الكتاب لا يُغادر صغيرة ولا كبيرة إلا أحصاها 
""";

  static const String elmTextOneTwentyThree_2 = """
الصغير الإبتسام، والكبير القهقهة، فلو أبتسمت لموقف من مؤمن أخطأ فيه، أو كنت متمكناً في علم من العلوم وسألك إنسان سؤالاً دل على جهله بهذا العلم فلا تسخر منه، بل علِمهُ، فهناك من تأخذه العزة بإختصاصه، فيسخر ويتهكم، لا، لا، الله عز وجل علمك وحجب عنه العلم والله قادر على أن يعكس الآية 

▪️المؤمن الحقيقي من ابتعد عن موضوع السخرية جملة وتفصيلا 
موضوع السخرية جملة وتفصيلاً، بقضه وقضيضه لا يدخل في حياة المؤمن أبداً، ولا يسخر حتى ممن يعص الله عز وجل، بل يدعو له بالهدى والتوفيق 
""";

// page 24
  static const String elmTextOneTwentyFour_1 = """
▪️الكمال يقتضي إذا وقع أخ في ذنب وتاب منه فعليك أن تتجاهله تجاهلاً كاملاً 
إخوة يوسف عليه السلام ماذا فعلوا بأخيهم؟ ألقوه في الجب لماذا؟ ليموت، أي أرادوا قتله، فلما دخلوا عليه قال: 
""";

  static const String ayahHadithOneTwentyFour_1 = """
وقد أحسن بي إذ أخرجني من السجن 
""";

  static const String elmTextOneTwentyFour_2 = """
ولماذا لم يذكر الجب؟ الجب أخطر، والإنسان تكون حياته مضمونة في السجن، وغذاؤه موجود لكن تؤسر حريته، أما في الجب فموته محقق، لماذا يا أيها النبي الكريم لم تذكر موضوع الجب بل ذكرت موضوع السجن؟ 
ياأبت هذا تأويل رؤياي من قبل قد جعلها ربي حقا وقد أحسن بي إذ أخرجني من السجن 
إنه ماذكر الجب لئلا يذكر إخوته لكماله وأدبه الرفيع لم يقل: وقد أحسن بي إذ أخرجني من البئر 
بل قال 
""";

  static const String ayahHadithOneTwentyFour_2 = """
إذ أخرجني من السجن 
""";

// page 25
  static const String elmTextOneTwentyFive_1 = """
▪️المؤمن الحقيقي من كان أداة بناء في المجتمع لا معول هدم 
إذا جلست مع إنسان فابحث عن نقاطه الإيجابية ولا تلتفت إلى عيوبه، وأثن عليها تنمُ، أما إذا تغافلت عن إيجابياته ونقبت في عيوبه فهذا موقف سلبي هدام، فلا تكن معول هدم في المجتمع ولكن كُن أداة بناء 

▪️الغيرة والحسد من أشد الأمراض فتكاً 
الغيرة والحسد أوسع أمراض البشر انتشاراً، لو أردت أن تحلل معظم المشكلات بين الناس والخصومات، والعداوات، وأنواع الطلاق، والأعمال التي تسبب الآذى لوجدت أن السبب الرئيسي هو الغيرة والحسد 
""";

  static const String ayahHadithOneTwentyFive_1 = """
إذ قالوا ليوسف وأخوه أحب إلى أبينا منا ونحن عصبة إن أبانا لفي ضلالٍ مُبين

""";

  static const String elmTextOneTwentyFive_2 = """
▪️الغيبة والنميمة أساس تمزق المجتمع 
إن نظام العلاقات الإجتماعية إذا شاعت فيه الغيبة والنميمة تمزق المجتمع 

▪️الإنسان المؤمن يسعى دائماً للحرص على وحدة المؤمنين وسُمعتهم

▪️المؤمن العاقل من يطلب الدليل قبل أن يظن بغيره 
ياايها الذين آمنوا اجتنبوا كثيراً من الظن إن بعض الظن إثم 
الظن أن تعتقد شيئاً من دون دليل ولو دققت في علاقات الناس فتسعة أعشار أحكامهم مبنية على الظن، ومع ذلك فالمؤمن يطلب الدليل 

""";

// page 26
  static const String elmTextOneTwentySix_1 = """
▪️الحكم على الآخرين يحتاج إلى دليل قطعي لا يرد 
""";
  static const String ayahHadithOneTwentySix_1 = """
ياأيها الذين آمنوا إن جاءكم فاسق بنبأ فتبينوا أن تُصيبوا قوماً بجهالة فتصبحوا على ما فعلتم نادمين 
""";

  static const String elmTextOneTwentySix_2 = """
▪️الغيبة، النميمة، وسؤ الظن، من الأسس الكبرى التي تفتت المجتمع
""";
  static const String ayahHadithOneTwentySix_2 = """
           ولا يغتب بعضكم بعضا 
""";

  static const String elmTextOneTwentySix_3 = """
▪️المؤمن الصادق لا يبني مواقفه وتصرفاته إلا على حقيقة يقينية 
الإنسان يعطي ويمنع، ويصل ويقطع، ويغضب ويرضى، هذه المواقف إذا بُنيت على ظن أو على وهم والطرفُ الآخرُ كان بريئاً تفتت المجتمع، فالمؤمن الصادق لا يبني مواقفه وتصرفاته، وصلته ومنعه، وعطاءه، ورضاه وغضبه إلا على حقيقةٍ يقينية 

▪️من أكبر أسباب تفتت المجتمع وضعفه الظن الآثم 

▪️من أساء الظن بأخيه كأنما أساء الظن بربه 

▪️العاقل من ينشغل بنفسه عن الآخرين لا من يتتبع أخبارهم 

▪️الإسلام بناء أخلاقي ومنهج والتزام 

▪️العبادات الشعائرية هي مناسبات لقبض ثمن العبادات التعاملية 
الحقيقة الخطيرة أن العبادات الشعائرية لا تقطف ثمارها إلا إذا صحت العبادات التعاملية لذلك:
""";
  static const String ayahHadithOneTwentySix_3 = """
سأل النبي مرة أصحابه من المفلس؟ قالوا: من لا درهم له ولا متاع، قال: لا، المفلس من اتى بصلاة، وصيام، وصدقة، وقد ضرب هذا، وشتم هذا، وأكل مال هذا، فيأخذ هذا من حسناته، وهذا من حسناته، فإن فنيت حسناتُهُ طرحوا عليه سيئاتهم حتى يُطرحُ في النار(اخرجه مسلم والترمذي عن ابي هريرة)
""";

// page 27
  static const String elmTextOneTwentySeven_1 = """
▪️المؤمنون نصحة متوادون لا استعلاء بينهم 
إستبداد بالرأي لا يوجد، واستعلاء، وتشنج، وسيطرة كلها لا توجد،
""";
  static const String ayahHadithOneTwentySeven_1 = """
 سيدنا الصديق على جلال عظمته قال لسيدنا عمر: مد يدك لأبايعك 
قال: أنا؟ غير معقول والله لأن أقطع إرباً إرباً أهون من أن أكون أميراً على قوم فيهم أبو بكر، هل أكون أميراً؟ 
قال له: امدد يدك لأبايعك، فقال سيدنا عمر: أنت أعقل مني، قال له: بل أنت أقوى مني، قال له قوتي مع فضلك وأنا بخدمتك 
""";
  static const String elmTextOneTwentySeven_2 = """
وهكذا المؤمنون 
هذه صفة جماعة المؤمنين، إذا عز أخوك فهُن أنت، فأنت في خدمة أخوانك، فأنت جندي تعمل في خدمة الحق 

▪️ألمؤمنون ليس بينهم من يستبد برأيه 
حين أنزل النبي عليه الصلاة والسلام جيش المسلمين في موقعة بدر في مكانٍ ما، جاءه صحابيٌ جليل اسمه الحُباب بن المنذر، جاءه في أعلى درجات الحب، وفي أعلى درجات الأدب، والغيرة على المسلمين 
""";

  static const String ayahHadithOneTwentySeven_2 = """
قال: يارسول الله أهذا الموقع وحي أوحاه الله إليك أم هو الرأي والمشورة؟ قال عليه الصلاة والسلام: 
          بل هو الرأي والمشورة 
قال: يارسول الله ليس بموقع 
""";

  static const String elmTextOneTwentySeven_3 = """
ماذا فعل النبي؟ هل غضب منه؟ لا 
وهل أبعده؟ لا أبداً 
بل قال له: 
""";

  static const String ayahHadithOneTwentySeven_3 = """
          الرأي والمشورة 
قال: يارسول الله ليس بموقع 
""";
  static const String elmTextOneTwentySeven_4 = """
لذلك أعطى النبي أمره للجيش أن يستقر في الموقع الذي أشار عليه الحُباب 
لماذا شاء الله أن تقع هذه الحادثة؟ كان من الممكن أن يوحي الله لنبيه الموقع المناسب وحياً عن طريق جبريل، لأن جبريل جاءه في آلاف المرات بموضوعاتٍ أقل من هذا الموضوع، وكان من الممكن أن يلهمه المكان المناسب، لكن شاءت حكمة الله أن يكون هذا الأمر على ما كان ليقف النبي الموقف الكامل ممن نصحه، وليعلم النبي أصحابه، وأمته من بعده، والدعاة إلى الله من بعده، والأمراء المؤمنون بعضهم لبعض نصحة متوادون، أي إذا جاءك إنسان مخلص ناصح فأصغ إليه، واشكره وأعطه أذناً صاغية، تفهم نصيحته، فهذه صفات المؤمنين
""";

// page 28
  static const String elmTextOneTwentyEight_1 = """
▪️الإنسان يحجب عن رب العباد عندما يؤذي العباد وذلك أكبر عقاب من الله للإنسان 
خدمة الخلق قربى إلى الرب وإيذاء الخلق بعد عن الله عز وجل، أنت حينما تؤذي عباد الله، حينما تبتز أموالهم، حينما تحتال عليهم، حينما تنتهك أعراضهم، حينما تلقي في قلوبهم الخوف، حينما تحمر وجوههم، حينما تسحقهم، حينما تبني ثروتك على إفقارهم، حينما تبني مجدك على أنقاضهم، حينما تبني عزك على إذلالهم، أنت عندئذٍ أخذت أكبر عقاب من الله وهو أن الله عز وجل حجبك عنه وطردك من رحمته، فكن عبد الله المظلوم إذا كان الطريق إلى الله سالكاً ولا تكن عبد الله الظالم إذا كان الطريق إلى الله مقطوعاً 

▪️المنازعات والسكوت عليها سبب أساسي في تفتت عضد المسلمين 
لا شيء يعين الظالم على ظلمه كسكوت الآخرين على هذا الظلم، فلو أن كل مسلم رأى انحرافاً، أو رأى ظلماً بين مؤمنين ووقف إلى جانب المظلوم، لصار الظالم يفكر ألف مرة قبل أن يقدم على ظلم أخيه، إذاً السلبية المقيتة التي تفشت بين المؤمنين، تجد أخوين متحاربين لشهور أو سنين وبقية الأخوة متفرجون، وأسرتين متعاديتين سنوات طويلة وبقية أطراف الأسرة متفرجون، هذا الموقف الإنهزامي أو السلبي ليس موقفاً إيمانياً يليق بالمؤمن 

▪️على المؤمن إذا نشبت فتنة بين المؤمنين أن يساهم في حلها 
واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة 
إن الفتنة يجب أن يكون لك يد في حلِها، مساهمة، أو تمنياً، أو حركة، أو كلمة، أو زيارة، أو كتابة كتاب، أو تحركاً 

▪️لا يفشو الباطل او تتسع دائرة الظلم إلا إذا لقي الباغي إحتراماً من الجميع 
""";

  static const String ayahHadithOneTwentyEight_1 = """
الله سبحانه وتعالى يقول 
          فقاتلوا التي تبغي 
          """;
  static const String elmTextOneTwentyEight_2 = """
هذه الآية ليست محصورة في القتال، الآية تشمل كل أنواع الخصومات، ولو أن الطرف الثالث وقف موقفاً مُنصفاً من نزاع بين مؤمنين، أو بين أطراف عدة من المؤمنين لحُسِمَ هذا الخصام ولعادت المياه إلى مجاريها، والتف المؤمنون وصاروا قوةً لا يُستهان بها، فما الذي ضعضع قوة المسلمين، وفرقهم وشتت شملهم؟ إنها هذه المنازعات فيما بينهم، وهذه الآية هي حل لهذه المشكلة 

▪️على الإنسان مقاطعة الباغي وزجره ليتقلص الظلم وينمو العدل 
فهُناك خصومات، وتدابر، وبغضاء، وطعن، وغيبة، والأطراف الباقية متفرجة تستمتع بهذه الخصومات، ولكن الموقف الإيماني يقتضي أن تنصح الطرفين بأن يلزما العدل، ويلزما ما أمر الله به 
""";
  static const String ayahHadithOneTwentyEight_2 = """
           فإن بغت احداهما 
           """;
  static const String elmTextOneTwentyEight_3 = """
يجب أن تقاطع الباغي، وأن تزجره، وأن توقفه عند حدِه، فبهذه الطريقة يتقلص الظلم وتضيق دوائره، وينمو العدل وتتسع دوائره، ولذلك: 
""";
  static const String ayahHadithOneTwentyEight_3 = """
وما كان ربك ليهلك القرى بظلم وأهلها مُصلحون 
""";

// page 29
  static const String elmTextOneTwentyNine_1 = """
▪️طاعة الله عز وجل تزيل أسباب الخصومة بين المتخاصمين 
لو أن كل مؤمن أقام الإسلام في بيته، وأقامه في عمله، والتزم كل حدود الله عز وجل لوجد نفسه مع أخيه المؤمن قلباً وقالباً، فالطاعة لله تجمع، والمعصية تفرق، ولو كل مؤمن أخذ ما له وترك ما ليس له لالتقى المؤمنون، ولو أن كل أبٍ عرف ما عليه وما له لعم الوئام بين هذه الأسرة، ولو أن كل أخٍ أخذ ما له وترك ما ليس له لتوافق الأخوة، فما الذي يسبب الخصومة بين الأشقاء؟ إنه عدم العدل بينهم، فلو أن الأب التزم العدل بين أولاده لما أوقع بينهم العداوة والبغضاء، ولائتلف الأولاد ولأحب بعضهم بعضاً، فالذي يزيل أصل الخصومة طاعة الله عز وجل، أن تأخذ ما لك وتدع ما ليس لك 

▪️عدم وقوع العداوة بين الإنسان وأخيه إلا بذنبٍ اقترفه أحدهما 
لو تصورنا أخوين بينهما خصومة فإن المتسبب بالخصومة هو البعيد عن طاعة الله عز وجل، وأقربهما إلى الله أشد حُباً لصاحبه، فما من خصومةٍ بين مؤمنين إلا بسبب ذنب، وهذا الذنب يسبب أخذ ما ليس له، أو أن يستطيل بلسانه على أخيه إرضاءً لغروره، أو لهوى في نفسه، أو لنزوةٍ طارئةٍ في سلوكه، فلذلك فإن الإنسان إذا تواضع لله عز وجل وعرف حده نشأت علاقة طيبة بينه وبين المؤمنين، وأية خصومة أساسها المعصية وحُب الدنيا، والأهواء والمصالح المتنازع عليها 

▪️الخصومات دليل ضعف الإيمان وقلة العلم 
مادام هناك خصومات بين الإخوة المؤمنين، ومنافسات، وعداوة، وبغضاء، وحقد وغل، فليعلم هؤلاء المؤمنون أنهم ليسوا على المستوى المطلوب، وأن هذا الإيمان لن ينفعهم، لأن علامة إيمانهم المحبة بينهم، علامة إيمانهم التعاون بينهم، علامة إيمانهم التناصر، والتضامن، والتآخي، وحينما يضعف تطبيق منهج الله تنشأ العداوة، وتنفجر البغضاء، وحينما نتمسك جميعاً بحبل الله عز وجل يحل الوئام محل الخصام، فالمتبع لمنهج الله عز وجل يتعاون، ولا يتنافس، يقدر ما عند الآخرين، ولا يحتقر، بينما الذي لا يتبع يتنافس، ولا يتعاون، وذو نزعة عدوانية، وليس مسالماً

▪️مشكلاتنا سببها خروج عن منهج الله وكل خروج سببه الجهل 
يجب أن نعلم علم اليقين أن كل مشكلاتنا على الإطلاق سببها خروج عن منهج الله، وأن كل خروج عن منهج الله سببه الجهل، وأن الجهل هو أعدى أعداء الإنسان، وأن الجاهل يفعل في نفسه ما لا يستطيع عدوه أن يفعله به
""";
}
