class ElmTextDersEighteen {
  //---- page 1
  static const String titleEighteenOne = """
ماقدرو الله حق قدره إن الله لقوي عزيز 
""";
  static const String elmTextEighteenOne_1 = """
الله سبحانه وتعالى هو العزيز ، القاهر الذي لا يُغلب ولا يُقهر ، المنيع الذي لا يرام جنابه ، فلا ينال جنابه لعزته وعظمته ، وجبروته وكبريائه ، العزيز الذي لا مثل له ولا نظير ، الغالب الذي لايعجزه شيئ ، القوي القاهر الذي لا يقف له شيئ 
وهو سبحانه العزيز الذي له العزة كلها  
عزة القوة .. وعزة الغلبة .. وعزة الامتناع 

""";
// page 2
  static const String ayahHadithEighteenTwo_1 = """
ولايحزنك قولهم إن العزة لله جميعا هو السميع العليم 
  """;

  static const String elmTextEighteenTwo_1 = """
الله جل جلاله هو العزيز ، وله العزة جميعا ، فنواصي العباد بيده ، ومشيئته نافذة فيهم ، وهو القاهر لهم على ما أراد 
فمن اراد العز في الدنيا والآخره فليطلبه من رب العزة تبارك وتعالى مالك الدنيا والآخرة ، وذلك يحصل بكمال الإيمان والتقوى ، ولزوم طاعة الله عز وجل 
""";

  static const String ayahHadithEighteenTwo_2 = """
 من كان يريد العزة فلله العزة جميعا إليه يصعد الكلم الطيب والعمل الصالح يرفعه 
""";

  static const String elmTextEighteenTwo_2 = """
ومع عظم الطاعة وحسنها وكمالها ودوامها تزداد العزة

""";
// page 3
  static const String elmTextEighteenThree_1 = """
ملايين الأموال أُنفقت لمحاربة الدين والإسلام بطرق وأساليب مختلفة منها عبر المسلسلات التي تعبث بعقول الناس وتحاول إضهار صورة المتدين بصورة بشعة بوحشية وقسوه وعدم رفق مع الآخر لأجل تشويه الإسلام ومحاربته 

جائت لقطة القطه بدقيقة وانتشرت ليراها أكثر من مليار وستميةمليون خلال ٢٤ ساعة لمشهد عفوي بسيط نسفت كل مكايد الأعداء واضهرت الوجه الحقيقي للمسلم
""";

  static const String ayahHadithEighteenThree_1 = """
 بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون
 
  صدق الله العظيم القائل ايضا 
  
 إن الذين كفرو ينفقون اموالهم ليصدوا عن سبيل الله فسينفقونها ثم تكون عليهم حسره ثم يغلبون

 """;

  // page 4
  static const String ayahHadithEighteenFour_1 = """
ولما بلغ أشده اتيناه حكما وعلما وكذلك نجزي المحسنين  
""";

  static const String elmTextEighteenFour_1 = """
هكذا نجزيهم على مر الايام ، على مر العصور ، في كل الأقاليم ، في كل البلاد ، في البلاد المتقدمه والبلاد المتخلفه ، وفي شرق الأرض وفي غربها ، في شمالها وفي جنوبها على البر وفي البحر وفي الجو 
""";
  static const String ayahHadithEighteenFour_2 = """
إن الذين امنو وعملو الصالحات سيجعل لهم الرحمن ودا 
""";

  // page 5
  static const String elmTextEighteenFive_1 = """
هذه بشرى للمؤنين الباب مفتوح والطريق اليه سالك ، والاله موجود ، والله هو هو ومعاملته هي هي ، وقوانينه هي هي لاتتبدل ولا تتغير ، ولا تُعدل ولا تُجمد ، ولاتوقف ، ولا يُضاف عليها ، ولا يُحذف منها لذلك ابشر 
كن له كما يُريد يكُن لك كما تريد ، سلم له فيما يريد يجعل حياتك كما تريد

  """;

//-- page 6
  static const String ayahHadithEighteenSix_1 = """
من عمل صالحآ من ذكر او أنثى وهو مؤمن فلنحيينه حياة طيبه 
""";
  static const String elmTextEighteenSix_1 = """
الحياة الطيبه لاتعني انه غني ، تعني انه موصول بالله ، تعني انه متوكل على الله ، تعني انه يحب الله ، تعني انه خاضع لمنهج الله ، تعني انه يتأمل بحياة سعيده ، قادمه بعد الموت ، هذه حاله دقيقه جدآ

""";

// page 7
  static const String elmTextEighteenSeven_1 = """
علاقة الرجل بالمرآه في منهج الله عز وجل علاقه مستمره ، ليس هناك  علاقه طارئه أبدآ
العلاقه الطارئه ليست من منهج الله عز وجل
هذه المرأه ربطت مصيرها مع زوجها
هي زوجته ، وأم اولاده ، تكبر معه ، تتقاسم معه مافي حياته من حلو ومر ، وفي كل مرحله لها جمالها ، ولها مكانتها ، ولها قيمتها ، ولو عرضت على أية امرأه في الأرض الزواج أو ان تكون متعه رخيصه لا ترضى إلا الزواج
  """;

  // page 8
  static const String elmTextEighteenEight_1 = """
ولكن للجهل اللذي يهيمن على فتيات المسلمين غير اللذين عرفوا بناتهم بمنهج الله عز وجل قد يؤثرن التفلت وقد يؤثرن الخروج ، قد يؤثرن علاقات لاترضي الله عز وجل ، هذا كله من الجهل ومن التغذيه غير الإسلاميه اللتي تتغذى بها البنات كل يوم إلى منتصف الليل
هذه التغذيه في مجموعها تهيئ تصورات للفتاه تجعلها تتفلت من منهج الله
""";

// page 9
  static const String titleEighteenNine_1 = """
إيثار الدنيا على الآخرة سبب تفتت وتفرق المسلمين 
""";

  static const String ayahHadithEighteenNine_1 = """
وماتفرقو إلا من بعد ماجائهم العلم بغياً بينهم 

        ( بغياً بينهم ) 
""";

  static const String elmTextEighteenNine_1 = """
أي تفرقو بسبب البغي أي الحسد وطلب المكاسب الدنيوية ، إذاً الحق يجمع والباطل يفرق ، والآخرة تجمع والدنيا تفرق ، والقيم تجمع والحاجات تفرق ، فإذا اردنا أن نجتمع فلنطلب الدار الآخرة ، وإذا اردنا ان نجتمع فليكن الحق إمامنا ، أما إذا اردنا الدنيا نتنافس ، ونختلف ، ويطعن بعضنا ببعض ، ونتراشق التُهم  
وإذا اردنا أن نجتمع فيجب علينا أن تتحد أهدافنا ووسائلنا ، أما إذا تفرقنا ، فكل إنسان طلب مصالح شخصية ، ولو كان الإطار حقاً والغلاف حقاً ، وهذا ما يؤدي إلى تفكيك الأمة 
""";
// page 10
  static const String elmTextEighteenTen_1 = """
والإنسان بقدر إخلاصه إنه يُرجح مصالح المسلمين العامة على مصلحته الخاصة ، وكلما ضعف إخلاصه رجح مصلحته الخاصة على مصالح المسلمين 
ولذلك فنحن الآن بحاجة إلى أن نتعاون ، وأن نتكاتف ، أن يعذر بعضنا بعضاً ، وأن نتعاون فيما أتفقنا ، وأن يعذر بعضنا بعضاً فيما اختلفنا ، نحتاج أن نحترم جميع الدعاة ، وجميع العلماء من دون أن ننتقص منهم ، وألا نجعل من مجالسنا نهشاً لأعراضهم ومكانتهم فليس هذا في صالح المؤمنين إطلاقاً
  
  """;

// page 11
// 1
  static const String titleEighteenEleven_1 = """
ذاهب إلى ربي
-----------
 """;
  static const String elmEighteenEleven_1 = """
سيدنا ابراهيم قال
  """;
  static const String ayahHadithEighteenEleven_1 = """
        إني ذاهب إلى ربي سيهدين 
  """;
  // 2
  static const String elmEighteenEleven_2 = """
العلماء قالوا: إنه إن أيقن بالموت فذهابه إلى الله عز وجل يعني أنه ملاق الله عز وجل، وسيهديني إلى الجنة، وإن خاف قومه، وتوجه بعيداً عنهم 
""";

  static const String ayahHadithEighteenEleven_2 = """
        إني ذاهبٌ إلى ربي 
 """;
  // 3
  static const String elmEighteenEleven_3 = """
لينجيني من مكرهم، وبأسهم، وكيدهم
""";
  static const String ayahHadithEighteenEleven_3 = """
        إني ذاهب إلى ربي سيهدين 
 """;
// 4
  static const String elmEighteenEleven_4 = """
لكن هذه كيف تقع معنا؟ كيف يقول أحدنا: إني ذاهبٌ إلى ربي؟ أي إذا توجه أحدنا إلى بيتٍ من بيوت الله ليصلي، توجه ليحضر مجلس علم، توجه إلى الفلاة ليناجي ربه، توجه إلى غرفة قصية في البيت ليصلي قيام الليل، إن توجه إلى غرفة قصية في البيت ذهب إلى ربه، وإن توجه إلى فلاةٍ ليناجي ربه وليذكره ذهب إلى ربه، وإذا توجه إلى بيت من بيوت الله لا يقصد منفعة، ولا دنيا، ولا حل مشكلةٍ؛ إنما يقصد مرضاة الله عز وجل فكأنه ذاهبٌ إلى الله عز وجل.. 
وإذا توجه الإنسان إلى بيوت الله لا يرجوا دنيا؛ بل لا يخرج إلا ابتغاء مرضاة الله، فالله جل جلاله سيرحمه، سيتجلى عليه، سينور قلبه، سيوفقه في أعماله الدنيوية، سيمنحه الرضى، يمنحه القرب 
من ذهب إلى البلاد المقدسة لأداء فريضة الحج لا يبتغي تجارة؛ لا يذهب إلا ابتغاء وجه الله عز وجل، فكأنه ذاهب إلى الله عز وجل 
""";

// page 12
  static const String titleEighteenTwelve_1 = """
وذكرهم بأيام الله 
------------
 """;

  static const String elmEighteenTwelve_1 = """
  ماهي أيام الله؟ 
أيام الله؛ الأيام التي نصر الله بها قوم سيدنا موسى، فحين نجاهم من فرعون، حين صار البحر لهم طريقاً يبسا، هذه أيام الله لقوم موسى عليه وعلى نبينا أفضل الصلاة والسلام 

ايام الله للمؤمن قد تكون في امتحان عصيب، وتدعو الله سبحانه وتعالى فيستجيب لك، هذا يومٌ من أيام الله

 قد يكون ابنك في مرض عُضال، وتدعو الله سبحانه وتعالى فيستجيب لك ويشفيه، هذا يومٌ من أيام الله 

 قد تكون في ضائقةٍ ماديةٍ خانقة فيأتيك رزق من حيث لا تحتسب، هذا يومٌ من أيام الله 

 قد تسأل الله الهدى فيجمعك برجلٍ على حق، هذا يومٌ من أيام الله 

 قد تسأل الله زوجة صالحة فيرزقك الله زوجة صالحة، هذا يومٌ من أيام الله 

 قد تسأل الله بيتاً يؤويك فيهبك الله هذا البيت، هذا يومٌ من أيام الله 

 قد تقع في ورطة وترى الهلاك فيها فتدعو الله مخلصاً فينجيك منها ومن كل كرب، هذا يومٌ من أيام الله، فالمؤمن لا ينسى أيام الله، يذكرها دائماً، يطأطئ رأسه تواضعاً لله، وكلما ذكر أيام الله يزداد لله شكراً.. 

إذا فتح شخص دفتراً وكتب فيه أيام الله عنده، يوم نجاه الله عز وجل من المرض الفلاني، يوم زوجه فلانة، يوم أعطاه هذا المحل التجاري، يوم هيأ له هذا المنزل، يوم وقع في مشكلة كبيرة جداً فنجاه الله منها، فإن ذلك يحفزه على دوام الشكر، ذكر نفسك بأيام الله 
""";
  static const String ayahHadithEighteenTwelve_1 = """
        وذكرهم بأيام الله 
        """;
  // 2
  static const String elmEighteenTwelve_2 = """
من أجل أن تحبه، من أجل أن تطمئن له، من أجل أن تعرف أن الذي أنقذك فيما مضى سيحفظك فيما هو آتٍ فلا تقلق..
  """;

// page 13
  static const String titleEighteenThirteen_1 = """
عن الله أحدثك
------------
 """;
  static const String elmTextEighteenThirteen_1 = """
يراك وأنت تطرق باباً تلوا باب، تفشل هنا وتحزن هناك، هذا يعاتبك وذاك يكيد لك، ولكنه ينتظر إقبالك، وأنت تتعثر وتنهض وتقع وتبكي، ثم ماتلبث أن تأتيه مكسوراً، فتناديه فيفتح بابه لك، كأنه يقول لك، إن جافوك فأنا حبيبك، وإن آلموك فأنا طبيبك، مرحباً بك آيباً تائباً...

عن الله أحدثك
 """;

  // page 14
  static const String titleEighteenFourteen_1 = """
الأخسرين اعمالا 
 """;
  static const String elmTextEighteenFourteen_1 = """
الحقيقة الإنسان حينما ينتقل إلى عملٍ ما، ينطلق من تصور أن هذا العمل في مصلحته، وله منه مكسب كبير، إن كانت رؤيته غير صحيحة، إن كانت رؤيته ضبابية، إن كانت رؤيته ليست كما يريد الله عز وجل، هذا هو الضلال وقع في الانحراف؛ أما إذا تمتع الإنسان برؤيةٍ صحيحة كان مهتدياً، ماهو الهدى؟ أن ترى وفق ما أراد الله عز وجل 
""";
  static const String ayahHadithEighteenFourteen_1 = """
قل هل ننبئكم بالأخسرين أعمالا الذين ضل سعيهم في الحياة الدنيا وهم يحسبون أنهم يحسنون صنعا 
""";
  static const String elmTextEighteenFourteen_2 = """
هذه مصيبة كبيرة، أن تنظر إلى الشيئ من زاويةٍ مغلوطة، أو أن تراه رؤية مغلوطة، أو أن تظنه خيراً وهو شر، أن تظنه حقاً وهو باطل، الضلال في حقيقته رؤية غير صحيحة، لذلك البطولة أن تُصلح رؤيتك دائماً وفق ما أراد الله عز وجل، فالله سبحانه وتعالى أعطاك ميزان العقل، وأعطاك ميزان الفطرة، وأعطاك ميزان الشرع، فإذا وافق عقلك ميزان الشرع أنعم به من عقل، إذا وافقت فطرتك ميزان الشرع أنعم بها من فطرة، أما الميزان الذي لا يُخطئ، فهو الشرع الذي أنزله الله على نبيه 
أما إذا هداك عقلك إلى خلاف الشرع هذا العقل قد ضل، وقد أنحرف، وقد طغى، وقد بغى 
إذاً الخطورة أن يزين الشيطان للإنسان عمله، فيرى عمله صائباً، يرى عمله صحيحاً، يرى عمله فيه فلاحٌ ونجاح، هنا الخطورة، لأنه ما من إنسان يُقدِمُ على شيءٍ إلا ويتوهمُ أنه صواب 
""";

  static const String ayahHadithEighteenFourteen_2 = """
        أفمن زين له سؤ عمله فرآه حسنا 
        """;
  static const String subtitleEighteenFourteen_1 = """
مصيبة المصائب 
""";
  static const String elmTextEighteenFourteen_3 = """
يعني أن يفعل الإنسان المعصية، ثم يتسائل: أهذه معصية؟ هذا شيء مؤلم جداً، لكن الفرق كبير بين من يعصي الله، ويعلم أنه يعصيه، وبين من يعصي الله، ويعلم أنه على صواب، وإن هذا هو عين الذكاء، وأن هذا هو عين الفلاح، وأن هذا هو عين التفوق، يعصي الإله، ويرى نفسه مصيباً في هذه المعصية، هذه مصيبة المصائب، أن تفعل السيئات، وأنت تعتقد أنك تفعل الصالحات، أن تأكل المال الحرام، وتعد هذا ذكاء ومهارة منك، أن توقع بين الناس، وتعد هذا حيلة محكمة بيدك، أن تبني مجدك على أنقاض الناس، وتعد نفسك أذكاهم جميعاً، أن تستغل الناس لمآربك الشخصية، وتعد هذا تفوقاً منك، أن ترى الشر خيراً، وأن ترى الخير شراً، أن ترى الحق باطلاً، وأن ترى الباطل حقاً، أن ترى الإساءة إحساناً، وأن ترى الإحسان إساءة، أن ترى الضعف صفة أخلاقية، وأن ترى الأخلاق ضعفاً في الإنسان، أن ترى أن المعتدي هو الذكي، وهو الذي يستحق الإحترام، إنها مصيبة؛ أن تفعل السيئات وأنت لا تدري، تقول ماذا فعلت؟! 
  
  """;
  // 15
  static const String elmTextEighteenFifteen_1 = """
▪️العقل المفلسف للشهوة وللمعصية أخطر عقل 
""";
  static const String ayahHadithEighteenFifteen_1 = """
        أفمن زين له سؤ عمله فرآه حسنا 
        """;
  static const String elmTextEighteenFifteen_2 = """
فمن هو المزين؟ الشيطان، والإنسان يزين عمله في بعض الأحيان، يتفلسف، يفلسف انحرافه، ويفلسف حقده، ويفلسف انتقامه، ويفلسف شهوانيته، ويفلسف طمعه، ويفلسف بخله 

️العقل إذا ضل زين للإنسان سؤ عمله 

️من زين له سؤ عمله وقع في مصيبتين مصيبة سؤ عمله ومصيبة فلسفة سؤ عمله 
مصيبة العمل السيء، ومصيبة أنه يتوهم أن هذا العمل السيء هو عمل طيب

  """;

  // test adding new text using copilot and gpt4.1
  // 16
  static const String titleEighteenSixteen_1 = """
من كل بستان زهرة
""";
  static const String elmTextEighteenSixteen_1 = """
إقامة الصلاة🌹
""";
  static const String titleEighteenSixteen_2 = """
معنى إقامة الصلاة
""";
  static const String elmTextEighteenSixteen_2 = """
وكأن الله سبحانه وتعالى جمع الدين كله في كلمتين: إقامة الصلاة وإيتاء الزكاة. إقامة الصلاة أي: تحسين العلاقة مع الله، فهذه الصلوات الخمس التي نصليها ماهي في الحقيقة إلا اتصال العبد بالله عز وجل
""";
  static const String elmTextEighteenSixteen_3 = """
ولكن من السذاجة أن نظن أنه بمجرد أن يقف الإنسان متوضئاً، ويتجه نحو القبلة، ويكبر تكبيرة الإحرام، ويقرأ دعاء الثناء، والفاتحة وسورة، ويركع، ويسجد، من السذاجة أن يظن أن هذه صلاة وكفى...
""";

  // 17
  static const String titleEighteenSeventeen_1 = """
حقيقة إقامة الصلاة
""";
  static const String elmTextEighteenSeventeen_1 = """
لن تستطيع أن تقيم الصلاة، لأن الله عز وجل يقول: الذين يقيمون الصلاة. كيف أنك تقيم البناء، لابد من جهودٍ كبيرة تسبق إنشاء البناء، كذلك أن تقف بين يدي الله عز وجل مصلياً من دون أن تكون مستقيماً على أمره، إن هذه الصلاة جوفاء
""";
  static const String elmTextEighteenSeventeen_2 = """
أن تقف بين يدي الله عز وجل مصلياً من دون أن يكون دخلك حلالاً، فهذه صلاة جوفاء، أن تقف بين يدي الله عز وجل مُصلياً من دون أن تظبط جوارحك، فهذه صلاة جوفاء...
""";

  // 18
  static const String titleEighteenEighteen_1 = """
إضاعة الصلاة
""";
  static const String elmTextEighteenEighteen_1 = """
لذلك ربنا عز وجل وصف الناس مع تقدُم الزمان فقال: وخلف من بعدهم خلف أضاعوا الصلاة
""";
  static const String subtitleEighteenEighteen_1 = """
معنى إضاعة الصلاة
""";
  static const String elmTextEighteenEighteen_2 = """
العلماء قالوا: إن إضاعة الصلاة ليس تركها، ولكن إضاعتها حينما لا نخشع فيها، ومتى لا نخشع فيها؟ إذا تخللتها المعاصي؛ دخله حرام، كلماته ليست منضبطة، جوارحه ليست منضبطة، لا يسير على منهج الله
""";

  // 19
  static const String titleEighteenNineteen_1 = """
الصلاة عند المنافق
""";
  static const String elmTextEighteenNineteen_1 = """
فإذا قام ليصلي ماذا يفعل؟ لذلك المنافقون وصفهم الله عز وجل فقال: وإذا قاموا إلى الصلاة قاموا كسالى. لأن الصلاة عند المنافق لا معنى لها، يقف، ويركع، ويسجد، ولا يشعر بشيء
""";
  static const String elmTextEighteenNineteen_2 = """
ولكن هذا الذي ضبط جوارحه، هذا الذي أنفق ماله، هذا الذي سار على منهج الله عز وجل، هذا الذي تقصى أوامر الله فطبقها، هذا الذي تقصى نواهيه فاجتنبها، هذا الذي أنفق ماله في سبيل الله لايبتغي رياءً ولا سمعة، إذا وقف ليصلي انهمرت دموعه، وشعر أنه قريب من الله عز وجل...
""";

  // 20
  static const String titleEighteenTwenty_1 = """
المعصية حجاب في العبادة
""";
  static const String elmTextEighteenTwenty_1 = """
إذا أقام الإنسان على معصية وأصر عليها صغيرة أو كبيرة انقطع عن الله عز وجل، إذاً تصبح العبادات عبئاً عليه، الصلاة ثقيلة، والصيام ثقيل، إن لم تستقم على أمر الله لا تذوق حلاوة الصلاة
""";
  static const String elmTextEighteenTwenty_2 = """
إن لم تبذل الغالي والرخيص لا تذوق حلاوة الصلاة، إن لم تضبط جوارحك كلها على منهج الله لا تذوق حلاوة الصلاة
""";

  // 21
  static const String titleEighteenTwentyOne_1 = """
العلاقة بين إضاعة الصلاة واتباع الشهوات
""";
  static const String elmTextEighteenTwentyOne_1 = """
فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا. هناك علاقة ترابطية بين إضاعة الصلاة واتباع الشهوات، من أضاع الصلاة اتبع الشهوات، من أقام الصلاة ابتعد عن الشهوات
""";
  static const String elmTextEighteenTwentyOne_2 = """
والمقصود بالشهوات الشهوات الدنية، لأنك إذا تزوجت فبهذه الشهوة ترقى إلى الله عز وجل، وإذا كسبت المال الحلال وأنفقته في وجوهه المشروعة، فبهذا الكسب، وبهذا الإنفاق ترقى إلى الله عز وجل
""";

  // 22
  static const String titleEighteenTwentyTwo_1 = """
الصلاة صلة بالله
""";
  static const String elmTextEighteenTwentyTwo_1 = """
من المُجمع عليه أنه: ليس معنى إضاعة الصلاة تركها، ولكن تأخيرها عن وقتها، أو عدم الإستقامة قبلها، إن لم تستقم قبل الصلاة فلا تنعقد الصلة بينك وبين الله عز وجل...
""";
  static const String elmTextEighteenTwentyTwo_2 = """
الصلاة ليست أقوالاً، وأفعالاً تفتتح بالتكبير، وتختتم بالتسليم فحسب، بل هي صلة بالله عز وجل، وإقبال عليه، واتصال به، واقتباس من كماله...
""";

  // 23
  static const String titleEighteenTwentyThree_1 = """
ثمرات الصلاة
""";
  static const String elmTextEighteenTwentyThree_1 = """
إن الصلاة تنهى عن الفحشاء والمنكر ولذكر الله اكبر. أعيد هذه العبارة مرةً ثانية ليست الصلاة في حقيقتها أقوالاً وأفعالاً تفتتح بالتكبير، وتختتم بالتسليم فحسب، بل هي إقبالٌ على الله عز وجل، واتصالٌ به، واستمدادٌ من كماله
""";
  static const String elmTextEighteenTwentyThree_2 = """
لأنك إذا اتصلت بالله عز وجل مصدر الحق، والخير، والجمال فلا بد أن تنعكس هذه الصفات على قلبك، لا بد أن يفيض قلبك بالخير، لا بد أن تحب الحق، وأن تكون ناصراً له، لا بد أن تبتعد عن كل دنية، لأن الصلاة كما أرادها الله عز وجل تنهى عن الفحشاء والمُنكر
""";

  // 24
  static const String titleEighteenTwentyFour_1 = """
علامات المصلي
""";
  static const String elmTextEighteenTwentyFour_1 = """
لا تجد مؤمناً يصلي صلاة صحيحة يؤذي الناس، أو يأخذ ما ليس له، أو يعتدي على حقوقهم، أو على أعراضهم، أو على أشخاصهم، لا تجد مؤمناً حقاً يُصلي صلاة صحيحة، وهو مسيئٌ إلى الناس
""";
  static const String elmTextEighteenTwentyFour_2 = """
فمن لوازم المصلي أنه محسن، فمن لوازم المصلي أنه مُنصف، فمن لوازم المصلي أنه يخجل من الله عز جل، يشيع فيه الحياء، والحلم، والعفو، فمكارمُ الأخلاق يمكن أن تشتق بعضها من خلال الصلاة
""";

  // 25
  static const String titleEighteenTwentyFive_1 = """
جزاء إضاعة الصلاة واتباع الشهوات
""";
  static const String elmTextEighteenTwentyFive_1 = """
الصلاة عماد الدين، وعصام اليقين، وسيدة القُرُبات، وغرة الطاعات، ومعراج المؤمن إلى رب الأرض والسماوات، والذي يذوق طعم القُرب في الصلاة يعرف معاني هذه الكلمات
""";
  static const String elmTextEighteenTwentyFive_2 = """
إن لم تصح صلاة الإنسان يجب أن يقلق قلقاً كبيراً، يجب أن يهتم لهذا كله، كن مهتماً أيها الإنسان
""";
  static const String elmTextEighteenTwentyFive_3 = """
الغي والهلاك جزاء إضاعة الصلوات واتباع الشهوات. البشرية تلاقي الغي، والمصائب، وفنون العذاب بسبب بعدهم عن الله سبحانه وتعالى والغي هو الشر، ومن علامات قيام الساعة كما جاء في بعض الأحاديث الشريفة هلاك العرب، لماذا هلاكهم؟ لأنهم ضيعوا الصلاة، واتبعوا الشهوات فسوف يلقون غياً
""";

  // 26
  static const String titleEighteenTwentySix_1 = """
سياسة الله عز وجل مع خلقه
""";
  static const String subtitleEighteenTwentySix_1 = """
أربع مراحل
""";
  static const String elmTextEighteenTwentySix_1 = """
أول مرحلة هي أجمل مرحلة، وأسلم مرحلة، وألطف مرحلة، يدعوك دعوة بيانية تسمع درساً، تسمع خطبة، تقرأ كتاباً، تسمع موعظة، تسمع نصيحة، وأنت صحيح، معافى، قوي، غني، ليس عندك مشكلة، هذه الدعوة البيانية، هذه ألطف دعوة، وأكمل دعوة، وأنعم دعوة، فالموقف الكامل منها أن تستجيب لله
""";
  static const String ayahHadithEighteenTwentySix_1 = """
يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم
""";
  static const String elmTextEighteenTwentySix_2 = """
كي تعيش الحياة التي خلقت من أجلها، كي يحيا قلبك، كي تحيا نفسك، كي تحيا بقربك من الله، فالإنسان لم يستجب، مادام لم يستجب يخضعه الله لتربية، أو لإجراء آخر، يسوق له شدة، هذا يسمى التأديب التربوي.
""";
  static const String ayahHadithEighteenTwentySix_2 = """
ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر لعلهم يرجعون
""";
  static const String elmTextEighteenTwentySix_3 = """
في الدعوة البيانية ينبغي أن تستجيب، وفي التأديب التربوي ينبغي أن تتوب، ما تاب الإنسان، ولا استجاب، هناك مرحلة ثالثة لكنها خطيرة، الإكرام الاستدراجي، يعطيه الدنيا، كما تشاء، أموال وصحة، ومكانة، وشبكة علاقات، ما شكر! بقي آخر حل، القصم
""";
  static const String elmTextEighteenTwentySix_4 = """
️الدعوة البيانية أكمل موقف منها الإستجابة
️التأديب التربوي أكمل موقف فيه التوبة
️الإكرام الاستدراجي أكمل موقف فيه الشكر
""";

  // 27
  static const String titleEighteenTwentySeven_1 = """
الجاهلية الثانية
""";
  static const String elmTextEighteenTwentySeven_1 = """
الآن نحن في الجاهلية الثانية، قال تعالى:
""";
  static const String ayahHadithEighteenTwentySeven_1 = """
ولا تبرجن تبرج الجاهلية الأولى
""";
  static const String elmTextEighteenTwentySeven_2 = """
هذه إشارة إلى جاهلية ثانية
""";
  static const String elmTextEighteenTwentySeven_3 = """
في الجاهلية الثانية القوي يسحق الضعيف، والغني يأكل الفقير، والذكي يحتال على غير الذكي، والعلاقات علاقات مجتمع الغاب، ليست علاقة إنسان مع إنسان، بل علاقة مجتمع غاب
""";
  static const String elmTextEighteenTwentySeven_4 = """
إن كل إنسان يرى من حقه أن يفترس الآخرين، وكل إنسان قد يكون فريسة وضحية، هذا مجتمع الغاب، هذا مجتمع الجاهلية الثانية، هذا مجتمع يوم يذوب قلب المؤمن في جوفه، مما يرى، ولا يستطيع أن يغير، إن تكلم قتلوه، وإن سكت استباحوه، هذا مجتمع يلعنه الله
""";

  static const String subtitleEighteenTwentySeven_1 = """
عدم إعطاء البنات حقهن أحد أنواع الجاهلية
""";
  static const String elmTextEighteenTwentySeven_5 = """
الآن إذا أحتال الأب الغني، وخص بماله أولاده الذكور، وحرم الإناث أليس هذا العمل جاهلياً؟
""";
  static const String elmTextEighteenTwentySeven_6 = """
ويفعل هذا العمل كثير من أغنياء المسلمين، ويفعل هذا العمل كثير من أبناء المناطق، ظناً منهم أن البنت إذا نالت من أبيها شيئاً انتقل المال إلى زوجها، وهو غريب عن العائلة، وهذا كلام مخالف للحقيقة، ومخالف لمنهج الله عز وجل.
""";
  static const String elmTextEighteenTwentySeven_7 = """
بل إن النبي عليه الصلاة والسلام في بعض ماروي عنه
إن أحدكم ليعمل في طاعة الله ستين عام ثم يضار في الوصية فتجب له النار {ورد في الأثر}
""";
  static const String elmTextEighteenTwentySeven_8 = """
يعبد الله ستين عاماً، فإذا اقترب أجله حرم البنات وخص الذكور، بشتى الدعاوى، قد يكتب الذكور على أبيهم سندات عالية جداً، فإذا أبرزوا هذه السندات أخذوا كل مال أبيهم، هذا الإله العظيم الذي أمرك أن تعبده لا تخفى عليه خافية، هناك من يهرب من إعطاء البنات حقهن، هذا له عند الله عقاب شديد، فكانوا في الجاهلية لا يورثون النساء
""";
  static const String elmTextEighteenTwentySeven_9 = """
كانوا في الجاهلية لا يورثون النساء، ولا الصغير وإن كان ذكراً، ويقولون: لا يعطى إلا من قاتل على ظهور الخيل، وطاعن بالرمح، وضارب بالسيف
""";
  static const String elmTextEighteenTwentySeven_10 = """
مع أن المنطق أن تعطي الصغير قبل الكبير، لأن الكبير اشتد عوده، له بيت، وله سيارة، وله زوجة، أما هذا الصغير إذا مات أبوه، وتركه صغيراً لا شيئ عنده
""";
  static const String elmTextEighteenTwentySeven_11 = """
لذلك الجاهلية في بعض الآيات وصفت بأنها الجاهلية الأولى، وفي هذا إشارة إلى أنه سوف تكون هناك جاهلية ثانية، فعدم إعطاء البنات حقهن من آبائهن أحد أنواع الجاهلية
""";
  static const String elmTextEighteenTwentySeven_12 = """
ويقولون: لا يعطى إلا من قاتل على ظهور الخيل، وطاعن بالرمح، وضارب بالسيف، وحاز الغنيمة، فذكرت أم كجة ذلك لرسول الله صلى الله عليه وسلم فدعاهما، فقالا
يارسول الله، ولدها لا يركب فرساً، ولا يحمل كلاً، ولا ينكأ عدواً، فقال عليه الصلاة والسلام: انصرفا حتى أنظر ما يحدث الله لي فيهن، فأنزل الله هذه الآية رداً عليهم
""";
  static const String ayahHadithEighteenTwentySeven_2 = """
للرجال نصيب مما ترك الوالدان والأقربون وللنساء نصيب مما ترك الوالدان والأقربون مما قل او كثر نصيباً مفروضا
""";
  static const String elmTextEighteenTwentySeven_13 = """
لذلك التلاعب بالإرث تلاعب بدين الله، لا شأن لك أن تقول: هذا فقير، وهذا غني، وهذه البنت لها زوج ميسور الحال لا أعطيها، هذا ليس من شأنك، هذا شأن الشرع، والشرع محكم في حياتنا، وليس منطقنا الأعوج محكماً في الشرع
""";

// page 28
  static const String ayahEighteenTwentyEight_1 = """
إن الذين كذبوا بآياتنا واستكبروا عنها لا تُفتح لهم أبواب السماء
""";
  static const String subtitleEighteenTwentyEight_1 = """
معنى تُفتح السماء
""";
  static const String elmTextEighteenTwentyEight_1 = """
️إذا فتحت أمامك أبواب السماء ما معنى ذلك؟ يعني تجلى الله على قلبك بالسكينة، السكينة تسعد بها ولو فقدت كُل شيء، وتشقى بفقدها لو ملكت كل شيء، فإذا كنت في بطن الحوت، وفي ظلمات ثلاث يتجلى الله عليك بالسكينة فأنت في جنة، لذلك عاش السكينة النبي عليه الصلاة والسلام وهو في الغار، وعاش السكينة سيدُنا يونس وهو في بطن الحوت، وعاش السكينة سيدُنا إبراهيم وهو في الغار، وعاش السكينة اهل الكهف وهم في الكهف، السكينة إذا انزلها الله عليك سعدت بها ولو فقدت كل شيء، وتشقى بفقدها لو ملكت كل شيء 
""";
  static const String elmTextEighteenTwentyEight_2 = """
️إن فتحت لك أبواب السماء نزل على قلبك الأمن 
""";
  static const String ayahEighteenTwentyEight_2 = """
فأي الفريقين أحق بالأمن إن كنتم تعلمون الذين امنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون
""";
  static const String elmTextEighteenTwentyEight_3 = """
️إذا فتحت لك أبواب السماء آتاك الله الحكمة 
""";
  static const String ayahEighteenTwentyEight_3 = """
ومن يؤت الحكمة فقد اوتي خيراً كثيرا
""";
  static const String elmTextEighteenTwentyEight_4 = """
️إذا فتحت لك ابواب السماء آتاك الله الرضا

️إذا فتحت لك أبواب السماء آتاك الله التفاؤل 

️إن فتحت لك أبواب السماء فلا يضل عقلك، ولا تشقى نفسك 

️إن فتحت لك أبواب السماء فلا تهاب إلا الله، ولا تخش إلا الله، ولا تأخذك في الله لومة لائم 

️إذا فتحت لك أبواب السماء آتاك الله بصراً نافذاً، وقولاً سديداً، وحكمة رائعة، وإدراكاً عميقاً 

️إذا فتحت لك أبواب السماء ملكت نفسك ولا تملكك، وتحكمت بهواك، ولم يتحكم بك 

️إذا فتحت لك أبواب السماء قلت مساكين أهل الدنيا، جاؤوا إلى الدنيا وخرجوا منها، ولم يذوقوا أطيب ما فيها، فاتتهم جنة القرب، في الدنيا جنة من لم يدخلها لم يدخل جنة الآخرة 

️إذا فتحت لك أبواب السماء يهبك زوجة صالحة تعينك على أمر دينك 

️إن فتحت لك أبواب السماء ألقى الله محبتك في قلوب الخلق
""";
}
