class ElmTextDersFourteen {
  // page 1
  static const String titleFourteenOne = """
الإسلام منهج شامل
---------------

""";

  static const String elmTextFourteenOne_1 = """
الفرق بين حياة المؤمن وغير المؤمن - وفق المبادئ ، و القيم ، و الأهداف ، و الحركات في الحياة - كبير جدا ، ليس الفرق بين إنسانيين ، إنسان يصلي وآخر لا يصلي ، لا أكبر بكثير  
منهج الله عز وجل ليس خمسه بنود كما يتوهمه بعض الناس ، صوم ، صلاة ، حج ، زكاة
منهج الله عز وجل يبدأ من فراش الزوجية ، وهو من أخص خصوصيات الإنسان ، وينتهي بالعلاقات الدوليه ، منهج كامل شامل

فلذلك أنت حينما تصطلح مع الله وتخضع لله ، أي آية في القرآن الكريم تخاطب المؤمنين علامة إيمانك أنك إذا قرأتها تشعر أنك معني بها

  """;
// page 2
  static const String elmTextFourteenTwo_1 = """
:أي أية تبدأ ب
""";
  static const String ayahHadithFourteenTwo_1 = """

یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ 

""";
  static const String elmTextFourteenTwo_2 = """
تشعر يقينا أنك معني بها ، لأن الله عز وجل كأنه يقول: يامن أمنتم بي ، يامن آمنتم بوجودي ، يامن آمنتم بربوبيتي ، يا من آمنتم بألوهيتي ، يا من آمنتم بأسمائي الحسنى، إفعل او لا تفعل
""";

// page 3
  static const String subtitleFourteenThree_1 = """
: علاقة الإيمان بالعمل
""";

  static const String ayahHadithFourteenThree_1 = """

 ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ 
البقرة 25 

""";
  static const String elmTextFourteenThree_1 = """
اقترن العمل الصالح مع الإيمان بمئتي آية ، ولا قيمة للإيمان إطلاقاً من دون عمل ، فدائماً يجب أن تفحص عملك
كيف ألقى الله؟
 هل بكسبك شيئ من الحرام ؟
  هل فيه إيهام للناس من أجل أبتزاز أموالهم ؟ 
هل هناك مبالغة حتى تخوفهم ليعطوك مثلاً ؟ 
هل تستخدم مكانتك الأدبية من أجل أخذ مال ليس لك؟ 
هل من الممكن أن تأخذ شيئاً ليس لك؟
 عملك عملك كلمه واسعه كثير ، لك دعوة إلى الله
هل تنصح المسلمين ؟
 هل تطلب العلم ؟
 هل تعلم العلم ؟
  هل تربي أولادك تربية عالية ؟
   هل ترعى من حولك ؟
 هل تعرف مالك وما عليك ؟
  هل تؤدي الذي عليك ؟ 
""";
  static const String ayahHadithFourteenThree_2 = """
:لذلك قال تعالى
 كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡ رَهِینَةٌ ۝٣٨
المدثر 38 
""";

  static const String elmTextFourteenThree_2 = """
أنت مرهون لعملك ، كلام واسع جداً ، قضية العمل كبيرة جداً ، ملخص حركتك في الحياة هو عملك ، إن كان كريماً أكرمك ، وإن كان لئيماً أسلمك ، أنت رهين عملك
  """;

  // page 4
  static const String elmTextFourteenFour_1 = """
:القيد الذاتي للإنسان ينتهي إلى الحرية 
بالمناسبه هناك فكرة رائعة وتبدو فيها مفارقة كبيرة ، المؤمن كُل حياته قيود ، بصره مقيد بالمحارم ، سمعه مقيد بذكر الله فلا يستمع للأغاني ، لسانه مقيد بالصدق والنصيحة والتواضع ، فلا يستطيع أن يتكلم بكلمات فيها كبر واستعلاء ، يده مقيده بالعطاء فلا يستطيع أن يبطش بها ، رجله مقيدة بالذهاب إلى المساجد وإلى دور العبادة وإلى زيارة الأصدقاء وإلى الدعوة إلى الله ، فكل اعضاؤه مقيدة بالشرع ، لأنه مقيد فهو طليق ، غير المؤمن حُر حرية البهائم ، يأكل مايشاء ، يأخذ من اموال الناس مايشاء ، يعتدي كيفما يشاء ، فإذا هو يُقيد ، احد هذه القيود نفسية ( الكآبه ) 
فالقيد الذاتي ينتهي إلى الحرية ، والحرية البهيمية تنتهي إلى القيد ، والله عز وجل قال: أولئك المؤمنون الذين تقيدوا بالكتاب والسُنة ، ضبطوا جوارحهم ، ضبطوا أعضاءهم ، ضبطوا دخلهم وإنفاقهم ، ضبطوا بيوتهم ، المؤمنون
""";
  static const String ayahHadithFourteenFour_1 = """
أُو۟لَـٰۤئِكَ عَلَىٰ هُدࣰى مِّن رَّبِّهِمۡۖ 
البقرة 5 
""";
  static const String elmTextFourteenFour_2 = """
والطرف الآخر لأنهم تفلتوا ، وكانو أحراراً من كل شيئ
""";
  static const String ayahHadithFourteenFour_2 = """

 أُو۟لَـٰۤئِكَ فِی ضَلَـٰلࣲ مُّبِینٍ ۝٢٢ 
الزمر 22 

""";
// page 5
  static const String elmTextFourteenFive_1 = """
إذا آمن المؤمن بالله إيماناً صحيحاً ، آمن به موجوداً ، وآمن به واحداً ، وآمن به كاملاً ، همُهُ الأول ، وشغله الشاغل أن يتحرى أمره ونهيه كي يعبده ، فإن عرفته بقي أن تعبده ، وإن عرفته من خلال الكون بقي عليك أن تعبده من خلال الأمر والنهي 
فهمُ المؤمن الأول وشغله الشاغل الذي لا يعلو عليه شيئ هو أن يتحرى الأمر والنهي ، وعلامة المؤمن الصادق أنه يسأل: هل هذا حرام ؟ وهل هذا حلال؟ أفيه شبهة؟ وهل يرضي الله أم أنه لا يرضي الله؟ أيحجبني عن الله أم يُقربني من الله؟ وهل يُحبط عملي أم يؤكد أملي؟ فلا بد من ان تسأل ، والسؤال علامة الإيمان ، فهذا اللذي يهتم ، يبحث ، ويفكر ، ويسأل نفسه ، ويسأل غيره ، سؤاله علامة إيمانه
أما هذا اللذي لا يسأل فلأن موضوع الدين كله خارج اهتمامه
تجد الإنسان الغارق في المعاصي والمخالفات لايخطر في باله أن يسأل ، ولا أن يبحث ، ولا أن يفكر: هل دخلي صحيح؟ وهل هو مشروع؟ وهل تربية أولادي صحيحة؟ وهل خروج بناتي بشكل يرضي الله؟ وهل أنا أب ناجح في أبوتي؟ وماذا أفعل؟ 
معرفتك بالله إن لم تحملك على طاعته فلا قيمة لها
كما عرف إبليس أن الله خالق 
""";
  static const String ayahHadithFourteenFive_1 = """

 خَلَقۡتَنِی مِن نَّارࣲ وَخَلَقۡتَهُۥ مِن طِینࣲ ۝١٢ 
 الأعراف 12 

""";
// page 6
  static const String elmTextFourteenSix_1 = """
وأن الله عزيز ( فبعزتك ) 
وأن الله رب
""";
  static const String ayahHadithFourteenSix_1 = """
 ( أَنظِرۡنِیۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ ۝١٤ ) 
الأعراف 14 
""";
  static const String elmTextFourteenSix_2 = """
إذاً هذه المعرفة اللتي لا توصل إلى طاعة هي معرفة إبليسية لا قيمة لها  
مقياس معرفتك التي تحملك على طاعة الله ، هذا مقياس المعرفة 
""";
  static const String ayahHadithFourteenSix_2 = """
( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ) 
""";
  static const String elmTextFourteenSix_3 = """
:الله جل جلاله يُخاطب عامة الناس بأصول الدين
""";
  static const String ayahHadithFourteenSix_3 = """
( یَـٰۤأَیُّهَا ٱلنَّاسُ ٱعۡبُدُوا۟ رَبَّكُمُ ) 
""";
  static const String elmTextFourteenSix_4 = """
ويُخاطب المؤمنين بفروع الدين ، ذلك أن بين المؤمن وربه عقداً إيمانياً ، أي ياأيها الذي عرفتني ، وياأيها الذي أمنت بعدلي ، وبقدرتي ، وبمنهجي ، وبأن الطريق التي رسمتها لك تُفضي إلى جنة عرضها السماوات والأرض ، وكل المعاني الكبرى التي جاء بها الدين منطوية في قوله تعالى
""";
  static const String ayahHadithFourteenSix_4 = """
( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ )
""";
  static const String elmTextFourteenSix_5 = """
واللذي لا يتأثر حينما يقرأ اي أية تبدأ بقوله
""";
  static const String ayahHadithFourteenSix_5 = """
 ( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ )
""";
  static const String elmTextFourteenSix_6 = """
  ولا يرى نفسه معنياً بها ، ففي إيمانه خلل خطير
فالمؤمن الصادق الحق هو اللذي إذا قرأ مثل هذه الأية رأى نفسه مخاطباً بالقرآن الكريم
  """;

// page 7
  static const String ayahHadithFourteenSeven_1 = """
( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ) 
""";
  static const String elmTextFourteenSeven_1 = """
أي: يا من آمنتم بي خالقاً ورباً وإلهاً وموجوداً وواحداً وكاملاً ، ويا من آمنتم بمنهجي افعلوا كذا أو لا تفعلوا
""";
  static const String ayahHadithFourteenSeven_2 = """
 يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ
""";

  static const String subtitleFourteenSeven_1 = """

الايمان درجات
----------
""";
  static const String elmTextFourteenSeven_2 = """
في الآيه ملمح لطيف ، وهو أن الله يُخاطب الذين آمنو ويأمرهم أن يؤمنوا ، معنى ذلك أن الايمان درجات ، وأن من بعض درجات الإيمان أنه لا يُنجي صاحبه ، الحد الأدنى المنجي للايمان أن يحملك على طاعة الله ، ومهما يكُن إيمانك واضحاً في ذهنك ولم تستقم على أمر الله فإيمانك هذا لا يُنجي ، لإنه قد قيل : " كفى بالمرء علماً أن يطيع الله أو أن يخشاه ، وكفى به جهلاً أن يعصيه" ، فحينما يعصي الإنسان ربه فهو لا يعرفه ، لو كان الله عز وجل عنده عظيماً لما عصاه
""";
  static const String ayahHadithFourteenSeven_3 = """
 يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا
""";

  static const String elmTextFourteenSeven_3 = """
يعني أنت مؤمن ، ولكن إيمانك لا يكفي ، لا بد من أن تجدد إيمانك 
الايمان درجات كثيرة جداً ، لكن أهم شيئ أنه إذا كنت في درجة لا يقودك إيمانك إلى طاعة الله ينبغي أن تُشمر وتجدد إيمانك ، لا ينبغي أن تقر عينك إلا بإيمان مؤداه الاستقامه على أمر الله

""";

// page 8
  static const String elmTextFourteenEight_1 = """
إذاً دعوة إلى تجديد الإيمان ، دعوة إلى البحث عن مستوى في الإيمان يحملك على طاعة الواحد الديان ، دعوة إلى التفكر في خلق السماوات والأرض ، وإلى النظر في أفعال الله ، وإلى تدبر آياته القرآنيه ، أما الإيمان بالرسول فهو اللذي تولى شرح هذا القرآن
""";
  static const String ayahHadithFourteenEight_1 = """
 لِتُبَیِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَیۡهِمۡ 
النحل 44 
""";
  static const String elmTextFourteenEight_2 = """
هذا القرآن في كلياته من شرحه لنا؟ رسول الله صلى الله عليه وسلم ، 
من بين تفاصيل العبادات ؟ 
من بين تفاصيل المعاملات؟
 رسول الله صلى الله عليه وسلم ، فلا يُعقل أن تكتفي بالقرآن ، القرآن فيه كليات والنبي عليه الصلاة والسلام بين التفصيلات

""";

// page 9
  static const String titleFourteenNine_1 = """
:عتاب رقيق
""";
  static const String ayahHadithFourteenNine_1 = """
 أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ 
الحديد 16 

""";
  static const String elmTextFourteenNine_1 = """
يُخاطب ربنا سبحانه وتعالى عقل الإنسان في كثير من الأحيان ، كما أنه يُخاطب قلبه أحياناً ، وفي هذه الآيه خطاب لقلبه ، فالله سُبحانه وتعالى يُعاتب هذا الانسان المقصر الذي لم يخشع قلبه لذكر الله ، ولم يستجب لأمر الله تعالى ، ولم يلتزم منهج الله عز وجل 
فيا ايُها الإنسان إلى متى أنت غافل؟
وإلى متى أنت ساه؟
إلى متى أنت مقصر ؟ 
وإلى متى أنت مغلوب على أمرك؟
    قال أحدهم
تعصي الاله وانت تظهر حبه
ذاك لعمري في المقال شنيع

لو كان حبك صادقاً لأطعته
إن المحب لمن يحب مطيع

  """;
// page 10
  static const String ayahHadithFourteenTen_1 = """
( ألم يأن )
""";
  static const String elmTextFourteenTen_1 = """
 أي: ألم يحن الوقت المناسب ؟ 
وإلى متى أنت في غفلة؟ وإلى متى أنت في التقصير والمخالفات؟ فهؤلا آمنو بألسنتهم ولم تؤمن قلوبهم أو آمنوا ولم يحملهم إيمانهم على طاعة الله إيمانهم لا يكفي
""";
  static const String ayahHadithFourteenTen_2 = """
( أن تخشع قلوبهم ) 
""";
  static const String elmTextFourteenTen_2 = """
 أي أن يستشعروا عظمة الله عز وجل انقادت جوارحك إلى طاعة الله وذكره

إن خشع القلب انقادت الجوارح ، وإن قسا القلب تفلتت الجوارح ، فالفسق اساسه قسوة القلب
""";
  static const String ayahHadithFourteenTen_3 = """
لَوْ أَنزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَّرَأَيْتَهُ خَاشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ اللَّهِ 
""";
  static const String elmTextFourteenTen_3 = """
فإذا قرأ الإنسان القرآن ولم يخشع قلبه فهذا مؤشر خطير! لأن المؤمن إذا تُليت عليه آيات الله ازداد إيماناً ، واقشعر جلدُهُ ، ووجل قلبه ، فإذا تُليت عليه آيات الله ولم يشعر بشيئ كان هذا دليلاً على صدأ قلبه
""";
  static const String ayahHadithFourteenTen_4 = """
وَلَا یَكُونُوا۟ كَٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلُ فَطَالَ عَلَیۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِیرࣱ مِّنۡهُمۡ فَـٰسِقُونَ ۝١٦ 
الحديد 16 
""";
  static const String elmTextFourteenTen_4 = """
يعرض الله تعالى علينا هنا مرضاً خطيراً من أمراض أهل الكتاب ، وما عرض علينا هذا المرض إلا لأن المسلمين مهيؤون لأن يُصابو بمثل هذا المرض
""";

// page 11
  static const String ayahHadithFourteenEleven_1 = """
 أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ 
""";
  static const String elmTextFourteenEleven_1 = """
إن خشع القلب انقادت الجوارح ، وإن قسا القلب تفلتت الجوارح ، فالفسق أساسه قسوة القلب ، والطاعة أساسها خشية القلب ، وإن أخطر مايحيق بالمسلم أن يستمرأ بعض المعاصي والمخالفات إلى أمد طويل فيقسو قلبه ، وتغدوا العبادات عنده طقوساً لا معنى لها !! فيؤدي الصلاة والزكاة والحج وهو غافل ، وقد اراد الله تعالى أن يكون في هذه العبادات خشوع وقرب وتألق ، ولو لم يرد ذلك لكانت العبادات طقوساً وأقوالاً تؤدى بغير معنى
  """;
// page 12
  static const String titleFourteenTwelve_1 = """
  وقفه
----  
الدين هو تطبيق لمنهج الله الكامل 
""";
  static const String elmTextFourteenTwelve_1 = """
افحص عملك ، افحص مهنتك ، افحص كسبك للمال ، افحص إنفاق المال ، افحص بيتك ، فيه خلل؟ افحص تربية اولادك ، افحص بناتك كيف أنشأتهم هل تربيتهم ترضي الله أم لا ترضي الله؟ افحص تجارتك فيها مادة محرمة؟ فيها طريقة تعامل محرمة؟ فيها إيهام ، فيها غش ، فيها احتيال ؟ افحص وضيفتك هل تنصح هؤلا المراجعين؟ هل تلبي حاجاتهم؟ أم تماطلهم ؟ أم تعقد عليهم الأمور من أجل أن تضطرهم إلى دفع مبلغ من المال؟ 


""";
// page 13
  static const String elmTextFourteenTherteen_1 = """
انظر إلى عملك ، إياك أن تظن أن الدين هو صلاة وصيام فحسب ، الدين هو تطبيق لمنهج الله الكامل
الصوم والصلاة هي مناسبة تقطف ثمار استقامتك ، فإذا لا توجد استقامة لا يوجد معنى للصوم والصلاة ، لذلك لا تبحث عن أداء حركات الصلاة بقدر ما تبحث عن تأكدك من أن الطريق إلى الله سالك ، ولا يكون الطريق إلى الله سالكاً إلا باستقامتك على أمره وخدمتك لعباده

  """;
// page 14
  static const String ayahHadithFourteenFourteen_1 = """
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 
""";
  static const String elmTextFourteenFourteen_1 = """
الطبع البشري أن تأخُذ ، أن تجمع الأموال ، أن تكدسها بعضها فوق بعض ، الطبع البشري أن تستخدم جهد الآخرين ، الطبع البشري أن تعلو على الآخرين ، التكليف أن تعطي لا أن تأخذ ، أن تبذل جهداً للناس لا أن تعلو على جُهدهم ، الطبع البشري أن يعيش الناس لك ، بينما التكليف أن تعيش للناس ، حينما تؤمن بالآخرة تنعكس الموازين مئة وثمانين درجة

  """;
// page 15
  static const String ayahHadithFourteenFifteen_1 = """
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 
""";
  static const String elmTextFourteenFifteen_1 = """
هذه الآيه شاملة شمولآ عجيباً ، تشمل كُل شيئ أوتيت خبرة في شيئ ، أنفق خبرتك ، أنفق علمك ، أنفق جاهك ، أنفق مالك ، أنفق وقتك ، أنفق عضلاتك
""";
  static const String ayahHadithFourteenFifteen_2 = """
 أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 
""";
  static const String elmTextFourteenFifteen_2 = """
حجمك عند الله بحجم عملك الصالح ، ما الشيئ الذي تقدمه امامك ليوم اللقاء مع الله عز وجل ؟ ماذا قدمت ؟ هل قدمت جهداً ؟ هل قدمت علماً ؟ هل قدمت خبرة ؟ هل قدمت مالاً ؟ هل قدمت دعوة ؟ هل قدمت تربية ؟ ماذا قدمت ؟

  """;
  // page 16
  static const String ayahHadithFourteenSixteen_1 = """
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 
""";
  static const String elmTextFourteenSixteen_1 = """
الطبع البشري أن تأخُذ ، أن تجمع الأموال ، أن تكدسها بعضها فوق بعض ، الطبع البشري أن تستخدم جهد الآخرين ، الطبع البشري أن تعلو على الآخرين ، التكليف أن تعطي لا أن تأخذ ، أن تبذل جهداً للناس لا أن تعلو على جُهدهم ، الطبع البشري أن يعيش الناس لك ، بينما التكليف أن تعيش للناس ، حينما تؤمن بالآخرة تنعكس الموازين مئة وثمانين درجة
  """;
}
