class ElmTextDersFour {
  // page 1
  static const String titleFourOne = """
المحبة الإلهية
-----------
 """;

  static const String elmTextFourOne_1 = """
 أتريد أن يحبك الله؟ 
افتح القرآن واقرأ الآيات في مواضع كثيرة ومتفرقة 
""";

  static const String ayahHadithFourOne_1 = """
قال تعالى 
إِنَّ ٱللَّهَ یُحِبُّ ٱلتَّوَّ ٰبِینَ وَیُحِبُّ ٱلۡمُتَطَهِّرِینَ ۝٢٢٢
البقرة 222

قال تعالى 
بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُتَّقِینَ ۝٧٦
ال عمران 76  

قال تعالى
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُحۡسِنِینَ ۝١٩٥
البقرة 195   

قال تعالى 
وَٱللَّهُ یُحِبُّ ٱلصَّـٰبِرِینَ ۝١٤٦
ال عمران 176 

قال تعالى 
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُتَوَكِّلِینَ ۝١٥٩  
ال عمران 159 

قال تعالى
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُقۡسِطِینَ ۝٤٢
المائدة 42  

""";
// page 2
  static const String elmTextFourTwo_1 = """
إذا اردت أن يحبك الله كن تقياً، وكن مستقيماً، وكن صادقاً، وكن أخلاقياً، وكن متطهراً 
التعامل مع الله تعامل واضح

عزيزي القارىء هل وجدت نفسك بين السطور؟! هل أحببت الله واستقمت على أمره وأنتهيت عن ما نهى؟ حتى تستحق أن يحبك الله

""";
// page 3
  static const String elmTextFourThree_1 = """
وهل تطمح لأن يحبك الله؟ حتى تكون في عنايته الخاصة وحفظه ورعايته وتأييده ونصره، هل اقبلت عليه بعقلك وبكل مشاعرك واحاسيسك؟ من خلال تفكرك في خلق السماوات والأرض ومن خلال طعامك وشرابك ومن خلال تفكرك في الإبل كيف خلقت، والسماء كيف رفعت، والجبال كيف نصبت، هل تفكرت في الفجر وليالٍ عشر وفي الشمس وضحاها؟ كي تعظم الله عز وجل ولكي يحملك تعظيمه على طاعته وحينما تطيعه وتقبل عليه يتجلى عليك وتذوق طعم القرب منه فتحبه ويحبك

""";
// page 4
  static const String elmTextFourFour_1 = """
وهل تقربت إلى الله من خلال معاملتك لخلقه؟ هل تعاملت مع خلقه برفق؟ وهل أحسنت لمن أساء إليك؟ هل وصلت من قطعك؟ هل أعطيت كل ذي حق حقه؟ هل تواضعت لله وخلعت عنك رداء العجب والكبر والاستعلاء؟ هل أنت من المقسطين؟ هل أنت من الكاظمين الغيظ العافين عن الناس؟ هل أنت من المحسنين؟

""";
// page 5
  static const String elmTextFourFive_1 = """
هل تعاملت مع عباد الله بأخلاق أو قسوة وغِلظة وكِبر واستكبار وتعنت؟
""";
  static const String ayahHadithFourFive_1 = """
 يارسول الله *
  من أحب عباد الله إلى الله قال: أحسنهم خلقاً

هل ياترى تفكرت في قولة سبحانة وتعالى 
 یُحِبُّهُمۡ وَیُحِبُّونَهُۥۤ
المائدة 54 
""";
  static const String footerFourFive = """
---------------------
رواة الأمام أحمد وبن ماجة *
  """;

// page 6
  static const String subtitleFourSix_1 = """
أجمل ماقيل في حب الله
---------------------
 """;

  static const String elmTextFourSix_1 = """
فليتك تحلوا والحياة مريرةً
    وليتك ترضى والأنام غضاب
    
وليت الذي بيني وبينك عامر
     وبيني وبين العالمين خراب

وليت شرابي من ودادك سائغ 
    شربي من ماء الفرات سراب 

إذا صح منك الوصل فالكل هين
       وكل الذي فوق التراب تراب

  """;

// page 7
  static const String elmTextFourSeven_1 = """
:وقيل

فلو شاهدت عيناك من حسننا الذي         
  رأوه لما وليت عنا لغيرنا

ولو سمعت أذناك حسن خطابنا 
     خلعت عنك ثياب العجب وجئتنا 

ولو ذقت من طعم المحبة ذرة
        عذرت الذي أضحى قتيلاً بحبنا 

ولو نسمت من قربنا لك نسمة
       لمت غريباً واشتياقاً لقربنا

فما حبنا سهل وكل من أدعى
     سهولته قلنا له: قد جهلتنا

""";

// page 8
  static const String elmTextFourEight_1 = """
وأخيراً يقول سبحانه وتعالى 
""";
  static const String ayahHadithFourEight_1 = """
 وَٱلَّذِینَ ءَامَنُوۤا۟ أَشَدُّ حُبࣰّا لِّلَّهِۗ 
البقرة 156 
 """;

  static const String elmTextFourEight_2 = """
 هل انت منهم حتى تستحق أن يحبك الله ويتجلى عليك؟

  """;

// page 9
  static const String elmTextFourNine_1 = """
بالمقابل أيضاً انظر من الذي لايحبه الله افتح المصحف واقرأ الآيات في مواضع كثيرة ومتفرقة
""";

  static const String ayahHadithFourNine_1 = """
قال تعالى 
وَٱللَّهُ لَا یُحِبُّ ٱلۡفَسَادَ ۝٢٠٥
الى عمران 57 

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡمُعۡتَدِینَ ۝١٩٠
البقرة 190 

قال تعالى 
وَٱللَّهُ لَا یُحِبُّ ٱلظَّـٰلِمِینَ ۝٥٧
ال عمران 57 

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا ۝٣٦
النساء 36 

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ خَوَّانًا أَثِیمࣰا ۝١٠٧
النساء 107 

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡخَاۤئِنِینَ ۝٥٨
الانفال 58 

قال تعالى 
وَٱللَّهُ لَا یُحِبُّ ٱلۡمُفۡسِدِینَ ۝٦٤
المائدة 64 

قال تعالى 
إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ ۝١٤١
الانعام 141 

قال تعالى 
إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡتَكۡبِرِینَ ۝٢٣
النحل 23 

قال تعالى 
 لَّا یُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوۤءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِیعًا عَلِیمًا ۝١٤٨
النساء 148 

  """;

  // page 10
  static const String titleFourTen_1 = """
:أخيراً
""";

  static const String elmTextFourTen_1 = """
 أعظم الحب الذي يكون من الله فإن أحبك الله أسعدك ونصرك وأجاب دعائك وأزال همك وأزاح غمك وألقى في قلوب الخلق حبك 
""";
  static const String ayahHadithFourTen_1 = """
قال تعالى 
 وَأَلۡقَیۡتُ عَلَیۡكَ مَحَبَّةࣰ مِّنِّی وَلِتُصۡنَعَ عَلَىٰ عَیۡنِیۤ ۝٣٩
 طه 39 

  """;
}
