class ElmTextDersFourteen {
  static const String elmTextDersFourteen1 = """
الإسلام منهج شامل
-----------
الفرق بين حياة المؤمن وغير المؤمن - وفق المبادئ ، و القيم ، و الأهداف ، و الحركات في الحياة - كبير جدا ، ليس الفرق بين إنسانيين ، إنسان يصلي وآخر لا يصلي ، لا أكبر بكثير  
منهج الله عز وجل ليس خمسه بنود كما يتوهمه بعض الناس ، صوم ، صلاة ، حج ، زكاة
منهج الله عز وجل يبدأ من فراش الزوجية ، وهو من أخص خصوصيات الإنسان ، وينتهي بالعلاقات الدوليه ، منهج كامل شامل

فلذلك أنت حينما تصطلح مع الله وتخضع لله ، أي آية في القرآن الكريم تخاطب المؤمنين علامة إيمانك أنك إذا قرأتها تشعر أنك معني بها


-----------

  """;

  static const String elmTextDersFourteen2 = """
:أي أية تبدأ ب
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ 

تشعر يقينا أنك معني بها ، لأن الله عز وجل كأنه يقول: يامن أمنتم بي ، يامن آمنتم بوجودي ، يامن آمنتم بربوبيتي ، يا من آمنتم بألوهيتي ، يا من آمنتم بأسمائي الحسنى، إفعل او لا تفعل

---------------------
""";

  static const String elmTextDersFourteen3 = """
: علاقة الإيمان بالعمل
 ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ 
البقرة 25 

اقترن العمل الصالح مع الإيمان بمئتي آية ، ولا قيمة للإيمان إطلاقاً من دون عمل ، فدائماً يجب أن تفحص عملك
كيف ألقى الله؟
 هل بكسبك شيئ من الحرام ؟
  هل فيه إيهام للناس من أجل أبتزاز أموالهم ؟ 
هل هناك مبالغة حتى تخوفهم ليعطوك مثلاً ؟ 
هل تستخدم مكانتك الأدبية من أجل أخذ مال ليس لك؟ 
هل من الممكن أن تأخذ شيئاً ليس لك؟
 عملك عملك كلمه واسعه كثير ، لك دعوة إلى الله
هل تنصح المسلمين ؟
 هل تطلب العلم ؟
 هل تعلم العلم ؟
  هل تربي أولادك تربية عالية ؟
   هل ترعى من حولك ؟
 هل تعرف مالك وما عليك ؟
  هل تؤدي الذي عليك ؟ 
  
:لذلك قال تعالى
 كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡ رَهِینَةٌ ۝٣٨
المدثر 38 

أنت مرهون لعملك ، كلام واسع جداً ، قضية العمل كبيرة جداً ، ملخص حركتك في الحياة هو عملك ، إن كان كريماً أكرمك ، وإن كان لئيماً أسلمك ، أنت رهين عملك
---------------------
  """;
  static const String elmTextDersFourteen4 = """
:القيد الذاتي للإنسان ينتهي إلى الحرية 
بالمناسبه هناك فكرة رائعة وتبدو فيها مفارقة كبيرة ، المؤمن كُل حياته قيود ، بصره مقيد بالمحارم ، سمعه مقيد بذكر الله فلا يستمع للأغاني ، لسانه مقيد بالصدق والنصيحة والتواضع ، فلا يستطيع أن يتكلم بكلمات فيها كبر واستعلاء ، يده مقيده بالعطاء فلا يستطيع أن يبطش بها ، رجله مقيدة بالذهاب إلى المساجد وإلى دور العبادة وإلى زيارة الأصدقاء وإلى الدعوة إلى الله ، فكل اعضاؤه مقيدة بالشرع ، لأنه مقيد فهو طليق ، غير المؤمن حُر حرية البهائم ، يأكل مايشاء ، يأخذ من اموال الناس مايشاء ، يعتدي كيفما يشاء ، فإذا هو يُقيد ، احد هذه القيود نفسية ( الكآبه ) 
فالقيد الذاتي ينتهي إلى الحرية ، والحرية البهيمية تنتهي إلى القيد ، والله عز وجل قال: أولئك المؤمنون الذين تقيدوا بالكتاب والسُنة ، ضبطوا جوارحهم ، ضبطوا أعضاءهم ، ضبطوا دخلهم وإنفاقهم ، ضبطوا بيوتهم ، المؤمنون
أُو۟لَـٰۤئِكَ عَلَىٰ هُدࣰى مِّن رَّبِّهِمۡۖ 
البقرة 5 

والطرف الآخر لأنهم تفلتوا ، وكانو أحراراً من كل شيئ
 أُو۟لَـٰۤئِكَ فِی ضَلَـٰلࣲ مُّبِینٍ ۝٢٢ 
الزمر 22 
---------------------

""";

  static const String elmTextDersFourteen5 = """
إذا آمن المؤمن بالله إيماناً صحيحاً ، آمن به موجوداً ، وآمن به واحداً ، وآمن به كاملاً ، همُهُ الأول ، وشغله الشاغل أن يتحرى أمره ونهيه كي يعبده ، فإن عرفته بقي أن تعبده ، وإن عرفته من خلال الكون بقي عليك أن تعبده من خلال الأمر والنهي 
فهمُ المؤمن الأول وشغله الشاغل الذي لا يعلو عليه شيئ هو أن يتحرى الأمر والنهي ، وعلامة المؤمن الصادق أنه يسأل: هل هذا حرام ؟ وهل هذا حلال؟ أفيه شبهة؟ وهل يرضي الله أم أنه لا يرضي الله؟ أيحجبني عن الله أم يُقربني من الله؟ وهل يُحبط عملي أم يؤكد أملي؟ فلا بد من ان تسأل ، والسؤال علامة الإيمان ، فهذا اللذي يهتم ، يبحث ، ويفكر ، ويسأل نفسه ، ويسأل غيره ، سؤاله علامة إيمانه
أما هذا اللذي لا يسأل فلأن موضوع الدين كله خارج اهتمامه
تجد الإنسان الغارق في المعاصي والمخالفات لايخطر في باله أن يسأل ، ولا أن يبحث ، ولا أن يفكر: هل دخلي صحيح؟ وهل هو مشروع؟ وهل تربية أولادي صحيحة؟ وهل خروج بناتي بشكل يرضي الله؟ وهل أنا أب ناجح في أبوتي؟ وماذا أفعل؟ 
معرفتك بالله إن لم تحملك على طاعته فلا قيمة لها
كما عرف إبليس أن الله خالق 
 خَلَقۡتَنِی مِن نَّارࣲ وَخَلَقۡتَهُۥ مِن طِینࣲ ۝١٢ 
 الأعراف 12 

---------------------
""";

  static const String elmTextDersFourteen6 = """
وأن الله عزيز ( فبعزتك ) 

وأن الله رب
 ( أَنظِرۡنِیۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ ۝١٤ ) 
الأعراف 14 

إذاً هذه المعرفة اللتي لا توصل إلى طاعة هي معرفة إبليسية لا قيمة لها  
مقياس معرفتك التي تحملك على طاعة الله ، هذا مقياس المعرفة 

( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ) 

:الله جل جلاله يُخاطب عامة الناس بأصول الدين
( یَـٰۤأَیُّهَا ٱلنَّاسُ ٱعۡبُدُوا۟ رَبَّكُمُ ) 

ويُخاطب المؤمنين بفروع الدين ، ذلك أن بين المؤمن وربه عقداً إيمانياً ، أي ياأيها الذي عرفتني ، وياأيها الذي أمنت بعدلي ، وبقدرتي ، وبمنهجي ، وبأن الطريق التي رسمتها لك تُفضي إلى جنة عرضها السماوات والأرض ، وكل المعاني الكبرى التي جاء بها الدين منطوية في قوله تعالى
( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ) 

واللذي لا يتأثر حينما يقرأ اي أية تبدأ بقوله ( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ) ولا يرى نفسه معنياً بها ، ففي إيمانه خلل خطير
فالمؤمن الصادق الحق هو اللذي إذا قرأ مثل هذه الأية رأى نفسه مخاطباً بالقرآن الكريم
---------------------
  """;

  static const String elmTextDersFourteen7 = """
( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ) 

أي: يا من آمنتم بي خالقاً ورباً وإلهاً وموجوداً وواحداً وكاملاً ، ويا من آمنتم بمنهجي افعلوا كذا أو لا تفعلوا

 يَا أَيُّهَا الَّذِينَ آمَنُوا آمِنُوا بِاللَّهِ وَرَسُولِهِ
الايمان درجات

في الآيه ملمح لطيف ، وهو أن الله يُخاطب الذين آمنو ويأمرهم أن يؤمنوا ، معنى ذلك أن الايمان درجات ، وأن من بعض درجات الإيمان أنه لا يُنجي صاحبه ، الحد الأدنى المنجي للايمان أن يحملك على طاعة الله ، ومهما يكُن إيمانك واضحاً في ذهنك ولم تستقم على أمر الله فإيمانك هذا لا يُنجي ، لإنه قد قيل : " كفى بالمرء علماً أن يطيع الله أو أن يخشاه ، وكفى به جهلاً أن يعصيه" ، فحينما يعصي الإنسان ربه فهو لا يعرفه ، لو كان الله عز وجل عنده عظيماً لما عصاه

( یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ) 
يعني أنت مؤمن ، ولكن إيمانك لا يكفي ، لا بد من أن تجدد إيمانك 
الايمان درجات كثيرة جداً ، لكن أهم شيئ أنه إذا كنت في درجة لا يقودك إيمانك إلى طاعة الله ينبغي أن تُشمر وتجدد إيمانك ، لا ينبغي أن تقر عينك إلا بإيمان مؤداه الاستقامه على أمر الله
---------------------

""";

  static const String elmTextDersFourteen8 = """
إذاً دعوة إلى تجديد الإيمان ، دعوة إلى البحث عن مستوى في الإيمان يحملك على طاعة الواحد الديان ، دعوة إلى التفكر في خلق السماوات والأرض ، وإلى النظر في أفعال الله ، وإلى تدبر آياته القرآنيه ، أما الإيمان بالرسول فهو اللذي تولى شرح هذا القرآن

 لِتُبَیِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَیۡهِمۡ 
النحل 44 

هذا القرآن في كلياته من شرحه لنا؟ رسول الله صلى الله عليه وسلم ، من بين تفاصيل العبادات ؟ من بين تفاصيل المعاملات؟ رسول الله صلى الله عليه وسلم ، فلا يُعقل أن تكتفي بالقرآن ، القرآن فيه كليات والنبي عليه الصلاة والسلام بين التفصيلات


 أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ 
الحديد 16 

---------------------
""";

  static const String elmTextDersFourteen9 = """
:عتاب رقيق
يُخاطب ربنا سبحانه وتعالى عقل الإنسان في كثير من الأحيان ، كما أنه يُخاطب قلبه أحياناً ، وفي هذه الآيه خطاب لقلبه ، فالله سُبحانه وتعالى يُعاتب هذا الانسان المقصر الذي لم يخشع قلبه لذكر الله ، ولم يستجب لأمر الله تعالى ، ولم يلتزم منهج الله عز وجل ، فيا ايُها الإنسان إلى متى أنت غافل؟ وإلى متى أنت ساه؟ إلى متى أنت مقصر ؟ وإلى متى أنت مغلوب على أمرك؟ قال أحدهم
تعصي الاله وانت تضهر حبه
ذاك لعمري في المقال شنيع

لو كان حبك صادقاً لأطعته
إن المحب لمن يحب مطيع

---------------------
  """;

  static const String elmTextDersFourteen10 = """
 أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ 
الحديد 16 

( ألم يأن ) أي: ألم يحن الوقت المناسب ؟ 
وإلى متى أنت في غفلة؟ وإلى متى أنت في التقصير والمخالفات؟ فهؤلا آمنو بألسنتهم ولم تؤمن قلوبهم أو آمنوا ولم يحملهم إيمانهم على طاعة الله إيمانهم لا يكفي

( أن تخشع قلوبهم ) 
 أي: أن يستشعروا عظمة الله عز وجل انقادت جوارحك إلى طاعة الله وذكره

إن خشع القلب انقادت الجوارح ، وإن قسا القلب تفلتت الجوارح ، فالفسق اساسه قسوة القلب

لو أنزلنا هذا القرآن على جبل لرأيته خاشعاً متصدعاً من خشية الله ) 
فإذا قرأ الإنسان القرآن ولم يخشع قلبه فهذا مؤشر خطير! لأن المؤمن إذا تُليت عليه آيات الله ازداد إيماناً ، واقشعر جلدُهُ ، ووجل قلبه ، فإذا تُليت عليه آيات الله ولم يشعر بشيئ كان هذا دليلاً على صدأ قلبه

وَلَا یَكُونُوا۟ كَٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلُ فَطَالَ عَلَیۡهِمُ ٱلۡأَمَدُ فَقَسَتۡ قُلُوبُهُمۡۖ وَكَثِیرࣱ مِّنۡهُمۡ فَـٰسِقُونَ ۝١٦ 
الحديد 16 

يعرض الله تعالى علينا هنا مرضاً خطيراً من أمراض أهل الكتاب ، وما عرض علينا هذا المرض إلا لأن المسلمين مهيؤون لأن يُصابو بمثل هذا المرض

---------------------
""";

  static const String elmTextDersFourteen11 = """
 أَلَمۡ یَأۡنِ لِلَّذِینَ ءَامَنُوۤا۟ أَن تَخۡشَعَ قُلُوبُهُمۡ لِذِكۡرِ ٱللَّهِ وَمَا نَزَلَ مِنَ ٱلۡحَقِّ 
الحديد 16 

إن خشع القلب انقادت الجوارح ، وإن قسا القلب تفلتت الجوارح ، فالفسق أساسه قسوة القلب ، والطاعة أساسها خشية القلب ، وإن أخطر مايحيق بالمسلم أن يستمرأ بعض المعاصي والمخالفات إلى أمد طويل فيقسو قلبه ، وتغدوا العبادات عنده طقوساً لا معنى لها !! فيؤدي الصلاة والزكاة والحج وهو غافل ، وقد اراد الله تعالى أن يكون في هذه العبادات خشوع وقرب وتألق ، ولو لم يرد ذلك لكانت العبادات طقوساً وأقوالاً تؤدى بغير معنى
---------------------
  """;

  static const String elmTextDersFourteen12 = """
  وقفه
-------  
افحص عملك ، افحص مهنتك ، افحص كسبك للمال ، افحص إنفاق المال ، افحص بيتك ، فيه خلل؟ افحص تربية اولادك ، افحص بناتك كيف أنشأتهم هل تربيتهم ترضي الله أم لا ترضي الله؟ افحص تجارتك فيها مادة محرمة؟ فيها طريقة تعامل محرمة؟ فيها إيهام ، فيها غش ، فيها احتيال ؟ افحص وضيفتك هل تنصح هؤلا المراجعين؟ هل تلبي حاجاتهم؟ أم تماطلهم ؟ أم تعقد عليهم الأمور من أجل أن تضطرهم إلى دفع مبلغ من المال؟ 

---------------------

""";

  static const String elmTextDersFourteen13 = """
انظر إلى عملك ، إياك أن تظن أن الدين هو صلاة وصيام فحسب ، الدين هو تطبيق لمنهج الله الكامل
الصوم والصلاة هي مناسبة تقطف ثمار استقامتك ، فإذا لا توجد استقامة لا يوجد معنى للصوم والصلاة ، لذلك لا تبحث عن أداء حركات الصلاة بقدر ما تبحث عن تأكدك من أن الطريق إلى الله سالك ، ولا يكون الطريق إلى الله سالكاً إلا باستقامتك على أمره وخدمتك لعباده
---------------------

  """;

  static const String elmTextDersFourteen14 = """
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 

الطبع البشري أن تأخُذ ، أن تجمع الأموال ، أن تكدسها بعضها فوق بعض ، الطبع البشري أن تستخدم جهد الآخرين ، الطبع البشري أن تعلو على الآخرين ، التكليف أن تعطي لا أن تأخذ ، أن تبذل جهداً للناس لا أن تعلو على جُهدهم ، الطبع البشري أن يعيش الناس لك ، بينما التكليف أن تعيش للناس ، حينما تؤمن بالآخرة تنعكس الموازين مئة وثمانين درجة

---------------------

  """;

  static const String elmTextDersFourteen15 = """
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 

هذه الآيه شاملة شمولآ عجيباً ، تشمل كُل شيئ أوتيت خبرة في شيئ ، أنفق خبرتك ، أنفق علمك ، أنفق جاهك ، أنفق مالك ، أنفق وقتك ، أنفق عضلاتك

 أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 

حجمك عند الله بحجم عملك الصالح ، ما الشيئ الذي تقدمه امامك ليوم اللقاء مع الله عز وجل ؟ ماذا قدمت ؟ هل قدمت جهداً ؟ هل قدمت علماً ؟ هل قدمت خبرة ؟ هل قدمت مالاً ؟ هل قدمت دعوة ؟ هل قدمت تربية ؟ ماذا قدمت ؟
---------------------

  """;
  static const String elmTextDersFourteen16 = """
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 

الطبع البشري أن تأخُذ ، أن تجمع الأموال ، أن تكدسها بعضها فوق بعض ، الطبع البشري أن تستخدم جهد الآخرين ، الطبع البشري أن تعلو على الآخرين ، التكليف أن تعطي لا أن تأخذ ، أن تبذل جهداً للناس لا أن تعلو على جُهدهم ، الطبع البشري أن يعيش الناس لك ، بينما التكليف أن تعيش للناس ، حينما تؤمن بالآخرة تنعكس الموازين مئة وثمانين درجة
یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَنفِقُوا۟ مِمَّا رَزَقۡنَـٰكُم 
---------------------
 
  """;
}
