class ElmTextDersSix {
  // page 1
  static const String titleSixOne = """
 الشرك الخفي
-----------
""";

  static const String elmTextSixOne_1 = """
الإيمان يقتضي أن تتوجه إلى الله وحده وأن تعبده وحده وأن تطيعه وحده
إنسان ترك خالق السماوات والأرض واتجه إلى إنسان ، اراد ان يرضيه ، توهم أن هذا الإنسان ينفعه أو يضره ، توهم ان هذا الإنسان يعليه أو يخفضه ، توهم ان هذا  الإنسان يعطيه او يمنعه ، اوهام كلها اوهام شركيه
""";

  static const String elmTextSixOne_2 = """
لذلك  الشرك اخفى من دبيب النملة السمراء ، على الصخرة الصماء ، في الليلة الظلماء ، وأدناه أن تحب على جور ، وأن تبغض على عدل

الشرك حينما تتوهم أن مصيرك بيد فلان، هذا شرك أكبر 
""";

  static const String ayahHadithSixOne_1 = """
قال تعالى 
وَمَا یُؤۡمِنُ أَكۡثَرُهُم بِٱللَّهِ إِلَّا وَهُم مُّشۡرِكُونَ ۝١٠٦
يوسف 106 

""";

// ---- ----Page 2 ------------
  static const String sutitleSixTwo_1 = """
ملخص الملخص
----------
""";
  static const String elmTextSixTwo_1 = """
 لو ضغطت الدين كله بكلمة واحدة ليس إلا الله حقيقه وحيدة، بيده كل شيئ، إليه مصير كل شيئ، فإذا عرفته عرفت كل شيئ، وإن ابتعدت عنه ابتعدت عن كل شيئ
لذلك الدين ليس فيه حالة وسط الإيمان يقتضي أن تتوجه إلى الله وحده، وأن تعبده وحده، وأن تطيعه وحده ، وان ترضى بقضائه وحده ، وأن تتكل عليه وحده، وان تسعد بقربه وحده، هذا الدين، والانسان يسعد بقدر ما يوحد، ويشقى بقدر مايقع في الشرك الخفي

  """;

  static const String ayahHadithSixTwo_1 = """
قال عليه الصلاة والسلام *
إن اخوف ما اخاف عليكم الشرك الخفي، أما إني لست اقول إنكم تعبدون صنما ولا حجرا، ولكن شهوة خفية وأعمالا لغير الله
سنن إبن ماجة *

""";

// page 3
  static const String elmTextSixThree_1 = """
راقب نفسك، انت حينما تفكر ان ترضي فلان، لأن فلان قوي، وقد يخصك بوظيفة وقعت في الشرك الخفي، وحينما تفكر أن تزور فلان لمصلحه تتوهمها، وقعت في الشرك الخفي، أمرك جملةوتفصيلآ بيد الله، رزقك بيدالله، سعادتك بيد الله، زواجك بيدالله، اولادك بيدالله، من هم فوقك بيدالله، من هم تحتك بيدالله، نجاحك في العمل بيدالله ، هذا هو التوحيد، التوحيد
""";

  static const String ayahHadithSixThree_1 = """
قال تعالى 
  وَإِلَیۡهِ یُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ فَٱعۡبُدۡهُ وَتَوَكَّلۡ عَلَیۡهِۚ 
هود 123 
  """;

  static const String elmTextSixThree_2 = """
المشرك عقيدته ، تصرفاته ، مبادئه ، قيمه ، حالاته ، احواله ، كلها بعيده عن الطهر ، والعفاف ، والنقاء
البعد عن الله يستلزم اللؤم احيانا ، الحقد ، ان تاكل ماليس لك ، ان تستعلي على خلق الله ، انت حينما تبتعد عن الله ، وتؤله شخصا من بني البشر تعبده من دون الله ، من لوازم الشرك ان تعتدي على الآخرين
""";

// page 4
  static const String elmTextSixFour_1 = """
ما اللذي يحصل الأن؟ إذا اشرك الإنسان ماذا يحصل له ؟ الله عز وجل يخيب ظنه بهذا اللذي عبده من دون الله ، اعتمد على ماله، يسوق الله له مصيبه لايحلها المال، اعتمد على إنسان قريب قوي يلهم الله هذا القريب أن يتخلى عنه، يقف منه موقفآ لئيما، هذه معالجة الله، اعتمد على زوجته وظن أنها تسعده إلى ابد الآبدين، فإذا هي تعامله أسوأ معامله، اعتمد على ابنه، يسافر ولا يرسل رساله إلا مرة كل سنتين وقد يتجنس ويتزوج وينسى أباه، إياك ان تعتمد على جهة غير الله فيخيب ظنك بها وهذا من رحمة الله بالإنسان، اعتمد على الله، لا على مال، ولا على جاه، ولا على أتباع، ولا على أهل، ولا على زوجه، طبق منهج الله، واعتمد على الله ولا تعتمد على مخلوق سوى الله فهذا نوع من انواع الشرك
---------------------

""";
}
