class ElmTextDersOne {
// page 1
  static const String titleOneOne = """

عوامل تفكك وفشل الأسرة والقبيلة
--------------------------
  """;
  static const String elmTextOneOne_1 = """
هناك عدة عوامل واسباب لتحطيم وفشل بعض او معظم الاسر والقبائل بشكل عام وبعض أو معظم مالكي الاراضي بشكل خاص وبيعهم للارض بأبخس الاثمان وتماديهم لدرجة انهم يظلموا متعمدين او دون ان يشعروا مما يؤدي إلى كثرة المشاكل والثارات 

  """;

  static const String elmTextOneOne_2 = """
          (1)
عدم فهم بعض أفراد المجتمع لأهمية دور العاقل أو الوكيل أو شيخ القبيلة وضرورة وجوده كرئيس مصغر للحكومة الاسرية يدير شؤونها وينظم اهدافها وضرورة احترامه وتقديره واحترام توجيهاته وتقدير مشاعره وكل جهود يبذلها لمصلحة الجميع

""";

  static const String elmTextOneOne_3 = """
وبالمقابل عدم فهم هذا العاقل او الوكيل او شيخ القبيلة لمسؤليته تجاه اسرته ومجتمعه وماذا يعني له شأن انه مقلد بعهد الله تعالى وميثاقه وأن عليه الرقابة الالهية المستمرة تجاه تصرفاته وخطواته 
""";

// page 2
  static const String ayahHadithOneTwo_1 = """
 
 و َقِفُوهُمۡۖ إِنَّهُم مَّسۡءُولُونَ ۝٢٤ 
الصافات 

 فَوَرَبِّكَ لَنَسۡءَلَنَّهُمۡ أَجۡمَعِینَ ۝٩٢ 
 عَمَّا كَانُوا۟ یَعۡمَلُونَ ۝٩٣ 
 سورة الحجر 

  """;
  static const String elmTextOneTwo_1 = """
          (2)
القصور لدى البعض بأهمية مسألة العمل الجماعي والتعاوني والتكافل الاجتماعي وأهمية التوحد والاعتصام بحبل الله جميعاً وعدم التفرق الذي يذهب ريحكم.....الخ
والتعاون على البر والتقوى
وكل ذالك بسبب عدم تدبرهم لقوله 
""";
// page 3
  static const String ayahHaditheOneThree_1 = """

سبحانه وتعالى 
وَلَا تَنَـٰزَعُوا۟ فَتَفۡشَلُوا۟ وَتَذۡهَبَ رِیحُكُمۡۖ وَٱصۡبِرُوۤا۟ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِینَ ۝٤٦
الانفال  

""";

  static const String elmTextOneThree_1 = """
          (3)
قلة الوعي لدى بعض الاسر بالمجتمع وعدم الاستشعار لدى معظم الناس لخطورة الشيطان ووساوسه وقد حذرنا الله 
  """;

  static const String ayahHadithOneThree_2 = """

 بقوله سبحانه وتعالى 
إِنَّ ٱلشَّیۡطَـٰنَ لَكُمۡ عَدُوࣱّ فَٱتَّخِذُوهُ عَدُوًّاۚ إِنَّمَا یَدۡعُوا۟ حِزۡبَهُۥ لِیَكُونُوا۟ مِنۡ أَصۡحَـٰبِ ٱلسَّعِیرِ ۝٦

فاطر  
""";
// page 4
  static const String elmTextOneFour_1 = """
          (4)
مرض العظمة والغرور وعدم الاعتراف بمنجزات الآخرين حتى وإن كانت­ عظيمة«يرونها بعين الاحتقار» ويستصغرونها وكأنها ليست بشيء ممكن ان يهدموا كل ماضيك الجميل مقابل موقف لم يعجبهم ينظرون للوجه المظلم ويتركون الوجه المشرق إن صح التعبير

  """;

  static const String elmTextOneFour_2 = """
          (5)
الكبر والاستعلاء وهذا من عمل الشيطان 
  """;
  static const String ayahHadithOneFour_3 = """

قال تعالى 
أَنَا۠ خَیۡرࣱ مِّنۡهُ خَلَقۡتَنِی مِن نَّارࣲ وَخَلَقۡتَهُۥ مِن طِینࣲ ۝١٢
الأعراف  

قال تعالى 
كَذَ ٰلِكَ یَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرࣲ جَبَّارࣲ ۝٣٥
غافر  

""";
// page 5
  static const String elmTextOneFive_1 = """
          (6)
مرض الأنانية اخطاء الآخرين كبيرة وعظيمة وأخطائهم صغيرة هذا إن اعترفوا بأنهم أخطأو

  """;
  static const String ayahHadithOneFive_1 = """

تِلۡكَ إِذࣰا قِسۡمَةࣱ ضِیزَىٰۤ ۝٢٢ 
النجم 

""";

  static const String elmTextOneFive_2 = """
          (7)
الشك والوهم التسرع في الحكم على الآخرين الأحكام الجائرة المبنية على سوء الظن والشك والوهم لأنهم لم يتدبروا
  
قوله سبحانه وتعالى 
  """;

  static const String ayahHadithOneFive_2 = """
 إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمࣱۖ 
الحجرات  
""";
// page 6
  static const String ayahHadithOneSix_1 = """
 [إلتمس لأخيك سبعين عذراً] *
  """;
  static const String footerOneSix = """
---------------------
 مجموع فتاوى إبن باز *
لا أعلم له أصلًا، والمشروع للمؤمن أن يحترم أخاه إذا اعتذر إليه ويقبل عذره إذا أمكن ذلك، ويحسن به الظن حيث أمكن ذلك، حرصًا على سلامة القلوب من البغضاء، ورغبة في جمع الكلمة والتعاون على الخير، وقد روي عن عمر  أنه قال: (لا تظن بكلمة صدرت من أخيك شرًا وأنت تجد لها في الخير محملًا)
  """;

// page 7
  static const String elmTextOneSeven_1 = """
       (8)
    :بعض النساء 
  """;
  static const String ayahHadithOneSeven_1 = """
 [إِنَّ كَیۡدَكُنَّ عَظِیمࣱ ۝٢٨]
يوسف 

الله سبحانه وتعالى يقول 

 وَلِلرِّجَالِ عَلَیۡهِنَّ دَرَجَةࣱۗ وَٱللَّهُ عَزِیزٌ حَكِیمٌ ۝٢٢٨
البقرة  
""";

  static const String elmTextOneSeven_2 = """
 الرجل يزيد عن المرأة بدرجة واحدة هي درجة القيادة درجة القرار فلابد من إنسان واحد يقول لا أو نعم، لأن الرجل بعد نظره كبير، وقراره حاسم، وإدراكه أعمق، ومعرفته بالحياة أدق، وخبرته بالمشكلات أعمق، فلابد من صاحب قرار والقرار هو هذه الدرجة، درجة القيادة

""";
// page 8
  static const String elmTextOneEight_1 = """
          (9)
القيل والقال [والهمز واللمز]
 والكلام الذي يجرح مشاعر الآخرين والذي يسبب الجفاء والبعد والقِمر والتعنت وذلك لعدم تدبرهم لقوله سبحانه وتعالى
""";

  static const String ayahHadithOneEight_1 = """
وَیۡلࣱ لِّكُلِّ هُمَزَةࣲ لُّمَزَةٍ ۝١ 
الهمزة 
""";

  static const String elmTextOneEight_2 = """
 والويل وادي في جهنم وبعضهم قالوا أن الويل الهلاك والشقاء والخسارة
  """;
// page 10 غير موجود ؟؟

// page 9
  static const String elmTextOneNine_1 = """
          (11)
الإسراف والتبذير وعدم الترتيب والإقتصاد في المعيشة
""";

  static const String ayahHadithOneNine_1 = """
إِنَّ ٱلۡمُبَذِّرِینَ كَانُوۤا۟ إِخۡوَ ٰنَ ٱلشَّیَـٰطِینِۖ 
الاسراء 27 

وَلَا تُسۡرِفُوۤا۟ۚ إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ ۝١٤١ 
الانعام 141 
    
إِنَّ ٱللَّهَ لَا یَهۡدِی مَنۡ هُوَ مُسۡرِفࣱ كَذَّابࣱ ۝٢٨ 
غافر 28 
""";
  static const String elmTextOneNine_2 = """
   وذلك مايجعل النفس طماعة وتتمادى على حق الغير
""";

// page 10
  static const String elmTextOneTen_1 = """
(12)
برود الهمة وضعف الإرادة للعمل أو المتاجرة وتوسيع مداخل الكسب الحلال وهذا يعود على الآباء الذين لم يربوا أولادهم على هذا الشيء منذ الصغر
""";

  static const String ayahHadithOneTen_1 = """
 [من شب على شيء شاب عليه] *
""";

  static const String footerOneTen = """
---------------------
مقولة لها شواهد من القراءن والسنة *
منها قول الله تعالى: (بَلْ قَالُوا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّهْتَدُونَ)
 ومن الأدلة قوله عليه الصلاة والسلام: (كل مولود يولد على الفطرة فأبواه يهودانه أو ينصرانه أو يمجسانه)
  """;

// page 11
  static const String elmTextOneEleven_1 = """
          (13)
الحسد وهو تمني زوال النعمة عن الغير دائماً ينظرون لما في يد الغير كثير ومافي أيديهم قليل ولايشكرون الله على ماأنعم عليهم حتى إذا كان مافي يد الغير
خاص[فضل وكرم من الله] لأنهم ماتدبروا قوله سبحانه وتعالى
  """;

  static const String ayahHadithOneEleven_1 = """

 وَلَا تَتَمَنَّوۡا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲۚ 
النساء 32 
 
أَمۡ یَحۡسُدُونَ ٱلنَّاسَ عَلَىٰ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۖ
النساء 54
  """;

// page 12
  static const String elmTextOneTwelve_1 = """
(14)
ضعف الإيمان [ايمان البعض شكلي] يظن البعض بأن الرزق يحتاج إلى دهاء وذكاء وحيلة ومكر وخداع وإذا لم يستخدم عقله سيضيع مستقبله أو مستقبل أبنائه
""";

  static const String ayahHadithOneTwelve_1 = """
قال تعالى 
ٱلشَّیۡطَـٰنُ یَعِدُكُمُ ٱلۡفَقۡرَ 
البقرة 268 
 
 وماتدبروا قوله سبحانه وتعالى 
 وَیَمۡكُرُونَ وَیَمۡكُرُ ٱللَّهُۖ وَٱللَّهُ خَیۡرُ ٱلۡمَـٰكِرِینَ ۝٣٠
الانفال 33 
 """;

  static const String elmTextOneTwelve_2 = """
  ولم يثقوا بوعود الله في القرآن
 """;

  static const String ayahHadithOneTwelve_2 = """
 قال تعالى 
 وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا 
هود 6 
   
 قال تعالى 
وَلَوۡ أَنَّ أَهۡلَ ٱلۡقُرَىٰۤ ءَامَنُوا۟ وَٱتَّقَوۡا۟ لَفَتَحۡنَا عَلَیۡهِم بَرَكَـٰتࣲ مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِ
الاعراف 96
  
 قال تعالى 
وَلَوۡ أَنَّهُمۡ أَقَامُوا۟ ٱلتَّوۡرَىٰةَ وَٱلۡإِنجِیلَ وَمَاۤ أُنزِلَ إِلَیۡهِم مِّن رَّبِّهِمۡ لَأَكَلُوا۟ مِن فَوۡقِهِمۡ وَمِن تَحۡتِ أَرۡجُلِهِمۚ 
المائدة 66

 قال تعالى 
وَأَلَّوِ ٱسۡتَقَـٰمُوا۟ عَلَى ٱلطَّرِیقَةِ لَأَسۡقَیۡنَـٰهُم مَّاۤءً غَدَقࣰا ۝١٦  
الجن 16 

  """;

  // page 13
  static const String titleOneTherteen = """
          (15)
  قلة الاحترام، الصغير لايحترم الكبير
---------------------
 
  """;

  static const String elmTextOneTherteen_1 = """
          (16)
تدخل الأبناء والصغار بخلافات الآباء وعدم احترام مجالس الكبار وعدم توقير كبار السن 

  """;

  static const String ayahHadithOneTherteen_1 = """
قال تعالى 
 إِنَّ مِنۡ أَزۡوَ ٰجِكُمۡ وَأَوۡلَـٰدِكُمۡ عَدُوࣰّا لَّكُمۡ فَٱحۡذَرُوهُمۡۚ 
التغابن 14 

 """;

  // page 14
  static const String elmTextOneFourteen_1 = """
          (17)
التنافس والمباهاة والتفاخر بالمنازل والمأكل والملبس والسيارات ووسائل التواصل الاجتماعي [الهواتف النقالة والالكترونيات] لاأكثر ولا أقل
 """;
  static const String elmTextOneFourteen_2 = """
          (18)
الاستعجال والمسابقة في بيع الأرض تحت شعار
[بيع ولاتخلي اسمك يضيع] *

""";

  static const String footerOneFourteen = """
---------------------
 مثل يمني *
  """;

  // page 15
  static const String elmTextOneFifteen_1 = """
          (19)
الشماتة [الشماتة أيضاً لها دور كبير لأن كل شيء يمكن تداركه بالاستغفار والتوبة إلا الشماتة لايمكن تداركها حتى وإن لم تنطق بكلمة يكفي بأن تحدث نفسك بأن فلان فاشل أو ضعيف أو سارق أو.. أو.. أو..] خاصة من يتشفى أو يفرح لمصيبة حصلت لأخيه وضع نفسه في خندق المنافقين دون أن يشعر
 """;

  static const String elmTextOneFifteen_2 = """
          (20)
كل من أخطأ أو تعثر أو فشل أو عجز عن تحقيق طموحاته يجعل من الآخرين شماعة يعلق عليها أخطائه وفشله الذريع

""";
// page 16
  static const String elmTextOneSixteen_1 = """
          (21)
عدم الاهتمام بالعلم وتوجيه الابناء التوجيه الصحيح وتشجيعهم على العلم والتعلم والمعرفة وتوعيتهم ولفت انتباههم لأهمية العلم وقيمة المتعلم في المجتمع 

*
إذا أردت الدنيا فعليك بالعلم 
وإذا أردت الآخرة فعليك بالعلم
 وإن اردتهما معاً فعليك بالعلم
""";

  static const String footerOneSixteen = """
---------------------
ذٌكر عن الإمام الشافعي *
""";

// page 17
  static const String elmTextOneSeventeen_1 = """
          (22)
نبتة القات عندنا في اليمن وببعض الدول المجاورة والقنوات الفضائية وسهر الليل بعضهم يتأثر نفسياً بسبب سهر الليل ربنا سبحانه وتعالى يقول 

  """;
  static const String ayahHadithOneSeventeen_1 = """

وَجَعَلۡنَا ٱلَّیۡلَ لِبَاسࣰا ۝١٠
وَجَعَلۡنَا ٱلنَّهَارَ مَعَاشࣰا ۝١١ 
النبأ 10 

""";

// page 18
  static const String elmTextOneEighteen_1 = """
          (23)
التسويف وعدم استغلال الوقت الاستغلال الصحيح تجاهلوا بأن أثمن شيء في حياة الإنسان هو الوقت [العمر] الله سبحانه وتعالى اقسم بمطلق الزمن


  """;
  static const String ayahHadithOneEighteen_1 = """
وَٱلۡعَصۡرِ ۝١ 
إِنَّ ٱلۡإِنسَـٰنَ لَفِی خُسۡرٍ ۝٢ 
العصر 

  """;
  static const String elmTextOneEighteen_2 = """
وأقسم أيضاً بعمر النبي 
""";

  static const String ayahHadithOneEighteen_2 = """
(لَعَمۡرُكَ إِنَّهُمۡ لَفِی سَكۡرَتِهِمۡ یَعۡمَهُونَ ۝٧٢) 
الحجر 78 

  """;
  static const String elmTextOneEighteen_3 = """
العمر الثمين الذي قضّاه كله لله والعظيم لايقسم إلا بعظيم والبعض أشغلوا أنفسهم بقضايا وأمور ليس لها أي فائدة ونسوا أن أخطر قضية في حياة الإنسان [الموت]

""";

// page 19
  static const String elmTextOneNinteen_1 = """
وفي الأخير لا للتعميم لأن التعميم من العمى[عمى البصيرة] وإنما نقول نعم للتبعيض وكل هذه العوامل التي ذكرناها أنفاً لاتنطبق على الجميع وإنما تنطبق على البعض وكل من يرى في نفسه شيء من هذا سيجد نفسه بين السطور

""";

// 20
  static const String subtitleOneTwenty = """
وقفه 
----
  """;
  static const String elmTextOneTwenty_1 = """
رسولنا الكريم بين لنا سبيل التعاون وحذرنا من سبل التفرقه فكل ما من شأنه أن يقوي العلاقة بين المؤمنين امر النبي به، وكل ما من شأنه ان يبعد فيما بينهم نهى النبي عنه، فنهى عن الغيبه لأنها تمزق المجتمع، ونهى عن النميمة، ونهى عن السخرية، ونهى عن الغمز واللمز
امرنا بأسباب الحب، ونهانا عن اسباب البغضاء
وكل ما من شأنه ان يضعف العلاقة بين المؤمنين نهى النبي عنه
""";
}
