class ElmTextDersFour {
  // page 1
  static const String titleFourOne = """
المحبة الإلهية
-----------
 """;

  static const String elmTextFourOne_1 = """
 أتريد أن يحبك الله؟ 
افتح القرآن واقرأ الآيات في مواضع كثيرة ومتفرقة 
""";

  static const String ayahHadithFourOne_1 = """
قال تعالى 
إِنَّ ٱللَّهَ یُحِبُّ ٱلتَّوَّ ٰبِینَ وَیُحِبُّ ٱلۡمُتَطَهِّرِینَ ۝٢٢٢
البقرة 222

قال تعالى 
بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُتَّقِینَ ۝٧٦
آل عمران 76  

قال تعالى
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُحۡسِنِینَ ۝١٩٥
البقرة 195   

قال تعالى 
وَٱللَّهُ یُحِبُّ ٱلصَّـٰبِرِینَ ۝١٤٦
آل عمران 146 

قال تعالى 
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُتَوَكِّلِینَ ۝١٥٩  
آل عمران 159 

قال تعالى
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُقۡسِطِینَ ۝٤٢
المائدة 42  
""";

  // page 2
  static const String elmTextFourTwo_1 = """
إذا أردت أن يحبك الله كن تقياً، وكن مستقيماً، وكن صادقاً، وكن أخلاقياً، وكن متطهراً 
التعامل مع الله تعامل واضح،
هل أحببت الله واستقمت على أمره وأنتهيت عن ما نهى؟ حتى تستحق أن يحبك الله،
""";

  // page 3
  static const String elmTextFourThree_1 = """
وهل تطمح لأن يحبك الله؟ حتى تكون في عنايته الخاصة وحفظه ورعايته وتأييده ونصره، هل أقبلت عليه بعقلك وبكل مشاعرك وأحاسيسك؟ من خلال تفكرك في خلق السماوات والأرض ومن خلال طعامك وشرابك ومن خلال تفكرك في الإبل كيف خلقت، والسماء كيف رفعت، والجبال كيف نصبت، هل تفكرت في الفجر وليالٍ عشر وفي الشمس وضحاها؟ كي تعظم الله عز وجل ولكي يحملك تعظيمه على طاعته وحينما تطيعه وتقبل عليه يتجلى عليك وتذوق طعم القرب منه فتحبه ويحبك،
""";

  // page 4
  static const String elmTextFourFour_1 = """
وهل تقربت إلى الله من خلال إحسانك لخلقه؟ هل تعاملت مع خلقه برفق؟ وهل أحسنت لمن أساء إليك؟ هل وصلت من قطعك؟ هل أعطيت كل ذي حق حقه؟ هل تواضعت لله وخلعت عنك رداء العجب والكبر والاستعلاء؟ هل أنت من المقسطين؟ هل أنت من الكاظمين الغيظ العافين عن الناس؟ هل أنت من المحسنين؟
""";

  // page 5
  static const String elmTextFourFive_1 = """
هل تعاملت مع عباد الله بأخلاق؟ أو تعاملت بقسوة وغِلظة وكِبر واستكبار وتعنت؟!
""";
  static const String ayahHadithFourFive_1 = """
يا رسول الله *
من أحب عباد الله إلى الله قال: أحسنهم خلقاً
""";

  // page 6
  static const String elmTextFourSix_1 = """
هل يا ترى تفكرت في قوله سبحانه وتعالى 
""";
  static const String ayahHadithFourSix_1 = """
يحبهم ويحبونه
المائدة 54
""";
  static const String elmTextFourSix_2 = """
هل تدبرت قوله سبحانه وتعالى 
""";
  static const String ayahHadithFourSix_2 = """
وَالَّذِينَ آمَنُوا أَشَدُّ حُبًّا لِلَّهِ
البقرة 165
""";
  static const String elmTextFourSix_3 = """
هل أنت منهم حتى تستحق أن يحبك الله ويتجلى عليك؟
""";

  // page 7
  static const String elmTextFourSeven_1 = """
بالمقابل أيضاً انظر من الذي لايحبه الله افتح المصحف واقرأ الآيات في مواضع كثيرة ومتفرقة
""";
  static const String ayahHadithFourSeven_1 = """
قال تعالى 
وَٱللَّهُ لَا یُحِبُّ ٱلۡفَسَادَ ۝٢٠٥
آل عمران 205

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡمُعۡتَدِینَ ۝١٩٠
البقرة 190 

قال تعالى 
وَٱللَّهُ لَا یُحِبُّ ٱلظَّـٰلِمِینَ ۝٥٧
آل عمران 57 

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا ۝٣٦
النساء 36 

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ خَوَّانًا أَثِیمࣰا ۝١٠٧
النساء 107 

قال تعالى 
إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡخَاۤئِنِینَ ۝٥٨
الأنفال 58 

قال تعالى 
وَٱللَّهُ لَا یُحِبُّ ٱلۡمُفۡسِدِینَ ۝٦٤
المائدة 64 

قال تعالى 
إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ ۝١٤١
الأنعام 141 

قال تعالى 
إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡتَكۡبِرِینَ ۝٢٣
النحل 23 

قال تعالى 
لَا یُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوۤءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَ
النساء 148
""";

  // page 8
  static const String elmTextFourEight_1 = """
أخيراً
أعظم الحب الذي يكون من الله فإن أحبك الله أسعدك ونصرك وأجاب دعائك وأزال همك وأزاح غمك وألقى في قلوب الخلق حبك 
""";
  static const String ayahHadithFourEight_1 = """
قال تعالى 
وَأَلۡقَیۡتُ عَلَیۡكَ مَحَبَّةࣰ مِّنِّی وَلِتُصۡنَعَ عَلَىٰ عَیۡنِیۤ ۝٣٩
طه 39
""";

  // page 9
  static const String elmTextFourNine_1 = """
معنى وألقيت عليك محبة مني 
المعنى الأول: من أوجه تفسيرات هذه الآية أن الله أحبه وحببه إلى خلقه، لذلك إذا أحبك الله، فمن لوازم محبة الله عز وجل أن الخلق كلهم يحبُونك، فإذا أحبك الخلق فهذه علامة محبة الله لك..
""";
  static const String ayahHadithFourNine_1 = """
وألقيت عليك محبة مني
""";

  static const String ayahHadithFourNine_2 = """
الحديث القدسي هو قول سيدنا داود: 
يارب من أحبُ الناس إليك حتى أحبه بحبك؟ فقال: ياداود أحب الناس إلي تقي القلب، نقي اليدين، لا يمشي إلى أحدٍ بسوء، أحبني، وأحب من أحبني، وحببني إلى خلقي(ورد في الأثر) 
""";
  static const String elmTextFourNine_2 = """
فدور العبد الصالح مع ربه أنه يحب الله، ويحبُ أحبابه، ويُحبب الخلق إليه، اذا أحبك الله عز وجل حبب الناس إليك، وإذا أحببته أنت يجب أن تحبه، وأن تحب من يحبه، وأن تحبب الناس إليه.
.فقال: أحب الناس إلي تقي القلب، نقي اليدين، لا يمشي إلى أحدٍ بسوء، أحبني، وأحب من أحبني، وحببني إلى خلقي، فقال داود: يارب إنك تعلم أني أحبُك، وأحب من يحبك، فكيف أحببك إلى خلقك؟ قال: ذكرهم بآلائي، ونعمائي، وبلائي(ورد في الأثر) 

إذا ذكرت الخلق بآلاء الله، وبنعمائه، وببلائه فقد حببت الخلق إليه، إن ذكرتهم بآلائه استعظموه، وإذا استعظموه طبقوا أمره، وإنك إن ذكرتهم بنعمائه أحبُوه، وإذا أحبوه طبقوا أمره، وإنك إن ذكرتهم ببلائه خافوا منه، وخوفهم منه يحملهم على تطبيق أمره، فالهدف واحد، وهو أن يطيعوه، إما أن يطيعوه عن طريق التعظيم، وإما أن يطيعوه عن طريق المحبة، وإما أن يطيعوه عن طريق التخويف..
""";
  static const String ayahHadithFourNine_3 = """
ذكرهم بآلائي ونعمائي وبلائي
""";

  static const String subtitleFourNine_1 = """
المعنى الثاني:
""";
  static const String elmTextFourNine_3 = """
قال بعض المفسرين
""";
  static const String ayahHadithFourNine_4 = """
وألقيت عليك محبة مني
""";
  static const String elmTextFourNine_4 = """
أي رَحِمتَكَ فأحبك الناس، فإذا تجلى الله على قلب الإنسان بالرحمات انصرفت قلوب الناس إليه، لأن قلبه يصبح مهبطاً لتجلي الله عز وجل، وعندئذٕ تهفو القلوب إلى هذا القلب المتصل، فلو أن الإنسان أتيح له أن يلتقي بنبي عظيم فلا توصف مقدار السعادة التي تتأتى من مجرد اللقاء، ولو لم ينطق بكلمة، إن هذه النفوس العظيمة التي أقبلت على الله عز وجل، وأستنارت بنوره فكانت مهبطاً لتجليات الله عز وجل، فإذا كان هناك لقاءٌ، أو اتصالٌ، أو محبة، أو محاككة بينك وبين قلب المتصل سَرَت هذه الصلة إلى قلبك، لذلك: 
""";
  static const String ayahHadithFourNine_5 = """
وألقيت عليك محبة مني
""";
  static const String elmTextFourNine_5 = """
من معانيها أنني أحببتك، وجعلت الخلق كلهم يحبونك 
""";

  static const String subtitleFourNine_2 = """
المعنى الثالث:
""";
  static const String elmTextFourNine_6 = """
أنني تجليت على قلبك فهفت القلوب إليك، ولذلك يقال: إن النبي عليه الصلاة والسلام كان أصحابه لا يطيقون فراقه أبداً، كان بعض أصحابه يخدمه، فلما حان وقت الانصراف بقي على عتبة داره لشدة أنسه، وسعادته بهذا القُرب..
""";
  static const String ayahHadithFourNine_6 = """
وألقيت عليك محبة مني
""";
  static const String elmTextFourNine_7 = """
أي أحببتك، وجعلت الخلق يحبُك..
""";
  static const String ayahHadithFourNine_7 = """
وألقيت عليك محبة مني
""";
  static const String elmTextFourNine_8 = """
أي تجليت على قلبك فهفت القلوب إليك 
""";

  // page 10
  static const String elmTextFourTen_1 = """
إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا 
""";
  static const String subtitleFourTen_1 = """
مودة الله للمؤمنين:
""";
  static const String elmTextFourTen_2 = """
والله الذي لا إله إلا هو لو لم يكن في كتاب الله من إكرام للمؤمن إلا هذه الآية لكفت..
""";
  static const String ayahHadithFourTen_1 = """
إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا 
""";
  static const String subtitleFourTen_2 = """
المعنى الأول للمودة:
""";
  static const String elmTextFourTen_3 = """
قال العلماء: المعنى الأول أن الله سبحانه وتعالى يُلقي في قلب الناس جميعاً محبة المؤمن..
ينادى له في الكون أنا نحبه
فيسمع من في الكون أمر مُحِبنا 
بعضهم يقول: إن المودة هنا تعني تحقيق مايحب، فكل مؤمن يحب أن يلقى الله، يحب أن يدخل الجنة، يحب رضوان الله، الله سبحانه وتعالى سيؤتيه سُؤلهُ،
""";
  static const String subtitleFourTen_3 = """
والمعنى الثالث:
""";
  static const String ayahHadithFourTen_2 = """
إن الذين أمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا 
""";
  static const String elmTextFourTen_4 = """
أي أن هذه المودة بين الله وبين المؤمنين أثمن ما في الوجود، يا محمد، جبريل عليه السلام جاء سيدنا محمد قال له:
""";
  static const String ayahHadithFourTen_3 = """
يامحمد قل لصاحبك: إن الله راضٍ عن أبى بكر، فهل هو راض عن الله؟
إن الذين امنوا وعملوا الصالحات سيجعل لهم الرحمن ودا 
""";
  static const String elmTextFourTen_5 = """
إذاً: فالمودة مطلقة؛ إما أنها بينك وبين الناس، وإما أنها بينك وبين الله سبحانه وتعالى، فالله عز وجل يجعل قلوب الناس تهفو إليك، يحبونك ويعجبون لهذه المحبة، لأن الله عز وجل تجلى عليك، فجعل القلوب تهفوا إليك، أنت كمؤمن هكذا يحبك الناس، ومن علامة صدق إيمانك محبة الناس لك، ومن علامة النفاق بُغض الناس لك، علامة الإخلاص محبة الناس، ألسنة الخلق أقلام الحق،
""";
  static const String ayahHadithFourTen_4 = """
{المؤمنون بعضهم لبعض نصحة متوادون ولو ابتعدت منازلهم، والمنافقون بعضهم لبعض غششة متحاسدون ولو أقتربت منازلهم}(البيهقي في شعب الإيمان عن قتادة)
""";

  static const String subtitleFourTen_4 = """
المعنى الثاني للمودة:
""";
  static const String elmTextFourTen_6 = """
وأما المعنى الثاني فالمودة بينك وبين الله، ففي الحديث القدسي:
""";
  static const String ayahHadithFourTen_5 = """
وجبت محبتي للمتحابين فيَ، والمتجالسين فيَ، والمتبادلين فيَ، والمتزاورين فيَ، والمتحابون في جلالي على منابر من نور يغبطهم عليها النبيون يوم القيامة(احمد)
""";
  static const String elmTextFourTen_7 = """
وخلاصة المعنى الثاني أن الذي ترغبه وتحبه فإن الله سبحانه وتعالى سيؤتيك إياه..
""";
  static const String ayahHadithFourTen_6 = """
سيجعل لهم الرحمن ودا 
هذا الذي أحبوه سيجعله لهم، سيقدره لهم، سيكافئهم به
""";

  static const String subtitleFourTen_5 = """
المعنى الثالث للمودة:
""";
  static const String elmTextFourTen_8 = """
والمعنى الثالث: هو إذا كنت في طاعة الله، وعبدته حق العبادة يدنيك منه، إنك إذاً في مقعد صدقٍ عند مليك مقتدر، إذاً يدافع الله عنك، تشعر بهذه المودة..
وهو الغفور الودود ذو العرش المجيد فعال لما يريد
""";

  // page 11
  static const String elmTextFourEleven_1 = """
▪️علاقة المؤمن مع الله علاقة حب
▪️علاقة المؤمن مع الله علاقة حب، لأن الحب أساسه العطاء، منحك نعمة الوجود، أنت موجود، من أوجدك؟ منحك نعمة الوجود
أمدك بكل ماتحتاج؛ أمدك بالهواء، أمدك بالماء، أمدك بزوجة، بأولاد، ببيت، بحرفة تكتسب منها رزقك، أعطاك ذاكرة، أعطاك قوة، أعطاك قلباً، رئتين، دسامات، كليتين، أجهزة كلها كاملة، فالمؤمن يحب الله عز وجل، منحه نعمة الوجود، نعمة الإيجاد، ونعمة الإمداد، ونعمة الهدى والرشاد
▪️المؤمن هو الذي يحب الله حباً حقيقياً 
▪️المؤمن يحب ربه حب طاعة، حب انقياد، حب خوف، حب رجاء، لذلك إذا رأيت إنساناً يحب جهة ما من دون الله كحبه لله أبكِ عليه 
▪️المؤمن يحب الله في السراء والضراء 
""";
  static const String ayahHadithFourEleven_1 = """
يقول عليه الصلاة والسلام 
عجبت لأمر المؤمن إن أمر المؤمن كله له خير ليس ذلك لأحد إلا لمؤمن إن اصابته سراء شكر وكان خيراً وإن أصابته ضراء صبر وكان خيراً
""";

  // page 12
  static const String subtitleFourTwelve_1 = """
أجمل ماقيل في حب الله
---------------------
""";
  static const String elmTextFourTwelve_1 = """
فليتك تحلوا والحياة مريرةً
    وليتك ترضى والأنام غضاب

وليت الذي بيني وبينك عامر
     وبيني وبين العالمين خراب

وليت شرابي من ودادك سائغ 
    وشربي من ماء الفرات سراب 

إذا صح منك الوصل فالكل هين
       وكل الذي فوق التراب تراب
""";

  // page 13
  static const String elmTextFourThirteen_1 = """
وقيل

أطع امرنا نرفع لأجلك حجبنا 
          فإنا منحنا بالرضى من أحبنا 
ولذ بحمانا واحتم بجنابنا 
          لنحميك مما فيه أشرار خلقنا 
وعن ذكرنا لا يشغلنك شاغلٌ 
          واخلص لنا تلقى المسرة والهنا 
فلو شاهدت عيناك من حسننا الذي 
          رأوه لما وليت عنا لغيرنا 
ولو سمعت أذناك حسن خطابنا 
          خلعت عنك ثياب العجب وجئتنا 
ولو ذقت من طعم المحبة ذرة 
          عذرت الذي أضحى قتيلاً بحبنا 
ولو نسمت من قربنا لك نسمة 
          لمت غريباً واشتياقاً لقربنا 
ولو لاح من انوارنا لك لائحٌ 
          تركت جميع الكائنات لأجلنا 
فما حبنا سهل وكل من أدعى 
           سهولته قلنا له قد جهلتنا
""";
}
