class ElmTextNineteen {
  //---- page 1
  static const String titleNineteenOne = """
معنى الولي
""";
  static const String elmTextNineteenOne_1 = """
ما معنى الولي لله ؟ أي أنه استسلم لله فتولى الله هدايته ، وتولى الله إرشاده ، وتولى الله إسعاده ، وتولى الله حفظه ، وتولى الله الأخذ بيده من خير إلى خير ، ولا ينتهي به المطاف إلا في الجنة ، واستسلم لله هذه هي حقيقة الإسلام ، أن تستسلم لله ، أن تفوض له ، أن تتوكل عليه ، إذا استسلمت له تولى الله شأنك  
""";
  static const String ayahHadithNineteenOne_1 = """
 الله ولي الذين آمنو يخرجهم من الظلمات إلى النور والذين كفرو اولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات  
""";
// page 2
  static const String subtitleNineteenTwo_1 = """
إحذر ولاية الشيطان  
""";

  static const String elmTextNineteenTwo_1 = """
لا يزال الشيطان يتولى أولياءه ، ويغريهم بالمعاصي ، ويورطهم بالجرائم إلى أن يصعدوا سُلم المشنقة ، هذا من عمل الشيطان ، ولا يزال الله سبحانه وتعالى يتولى أولياءه بالحفظ ، والهداية وتنوير القلب ، والإرشاد ، والإسعاد حتى يأخذ بيدهم إلى الجنة ، فليس هناك حال ثالثة ، إما ان يكون الإنسان ولياً لله عز وجل وإما أن يكون ولياً للشيطان ، إذا استسلمت لله عز وجل تول الله إرشادك ، وحفظك ، وهدايتك وإسعادك  
""";
  static const String ayahHadithNineteenTwo_1 = """
 ألا إن اولياء الله لا خوف عليهم ولا هم يحزنون  

""";

  static const String subtitleNineteenTwo_2 = """
تعريف الولي في الكتاب والسُنة  
""";

  static const String elmTextNineteenTwo_2 = """
النبي عليه الصلاة والسلام يُعرف ولي الله فيقول 
 """;

  static const String ayahHadithNineteenTwo_2 = """
 ( ورد في الآثر ) 
 الذين يُذكر الله برؤيتهم ، أولياء أمتي إذا رُوؤا ذكر الله بهم 

""";
// page 3
  static const String elmTextNineteenThree_1 = """
تقع عينك عليه فتذكر الله سبحانه وتعالى هذه علامة ..علامة أخرى
كما قال عليه الصلاة والسلام  
""";

  static const String ayahHadithNineteenThree_1 = """
 إن من عباد الله لأناساً ما هم بأنبياء ولا شُهداء ، يغبطهم الأنبياء والشهداء يوم القيامة بمكانتهم من الله تعالى 
  ( ابو داؤد عن عمر ) 
""";
  static const String elmTextNineteenThree_2 = """
هذا تعريف آخر 
""";

// page 4
  static const String elmTextNineteenFour_1 = """
تعريف ثالث
  """;
  static const String ayahHadithNineteenFour_1 = """
هم قوم تحابو بروح الله ، على غير أرحام بينهم ، ولا أموال يتعاطونها ، فوالله إن وجوههم لنور ، وإنهم على نور ، لا يخافون إذا خاف الناس ولا يحزنون إذا حزن الناس 
 سنن ابي داؤد عن عمر ابن الخطاب 

""";

  static const String elmTextNineteenFour_2 = """
مقياس دقيق جداً ، إذا خاف الناس جميعاً لا يخافون  
""";

  static const String ayahHadithNineteenFour_2 = """
 إن الإنسان خُلق هلوعا إذا مسه الشر جزوعا وإذا مسه الخير منوعا إلا المصلين  

""";

  static const String elmTextNineteenFour_3 = """
المصلي لا يخاف ، ولا يحزن ، وقارئ القرآن لا يحزن ، لِمَ الحزن ؟ الله سبحانه وتعالى خالق السماوات والأرض ، الغني القوي ، العزيز ، الرحيم ، السميع ، المجيب ، وهو معك  
""";

// page 5
  static const String ayahHadithNineteenFive_1 = """
        ( واصبر لحكم ربك فإنك باعيننا ) 
        ( إن الله يدافع عن الذين امنوا ) 
 إن الذين آمنوا وعملو الصالحات سيجعل لهم الرحمان ودا  

  """;
  static const String elmTextNineteenFive_1 = """
لذلك قال عليه الصلاة والسلام  
""";
  static const String ayahHadithNineteenFive_2 = """
      ( لا يحزن قارى القران ) 

""";
  static const String elmTextNineteenFive_2 = """
من علامات أولياء الله أنهم لا يخافون إذا خاف الناس ، ولا يحزنون إذا حزن الناس ، إذاً : ولي الله هو الرجل الذي استسلم لله عز وجل ، حينما استسلم لله عز وجل تول الله هدايته ، وإسعاده ، وحفظه ، ومايزال الله سبحانه وتعالى يأخذ بيد وليه حتى يدخله الجنة
""";
// page 6
  static const String elmTextNineteenSix_1 = """
في الدنيا لا يخافون 
من علامات المؤمن الصادق أن يقول لك : والله الذي لا اله الا هو إنني أسعد الناس ، على دخله المحدود ، وعلى بيته الصغير ، وعلى متاعبه الكثيرة ، لأنه سعد بالله عز وجل

إذا ابتعد الإنسان عن الله عزوجل ألقى الله الخوف في قلبه فانقلبت حياته جحيماً ، وانقلب غناه فقراً ، فأنت من خوف الفقر في فقر ، وأنت من خوف المرض في مرض ، وتوقع المصيبة مصيبة اكبر منها ، وما من مرض يفتك بالناس اليوم في بقاع الأرض كالقلق 
""";
  static const String ayahHadithNineteenSix_1 = """
     ( لا تحزن إن الله معنا ) 
 قلت للنبي صل الله عليه وسلم وأنا في الغار
 لو أن احدهم نظر تحت قدميه لأبصرنا ، فقال
  (( ماظنك يا أبا بكر بأثنين الله ثالثهما ؟ )) 

""";

//page 7
  static const String elmTextNineteenSeven_1 = """
هذا هو الإيمان 
""";
  static const String ayahHadithNineteenSeven_1 = """
     ( لا خوف عليهم ولا هم يحزنون )

""";
  static const String elmTextNineteenSeven_2 = """
يجب أن تكون أنت من أولياء الله ، إذا اطعت الله طاعة تامة فأنت من أولياء الله الذين لا خوف عليهم ولا هم يحزنون 
 """;
  static const String ayahHadithNineteenSeven_2 = """
  ( الذين امنو وكانو يتقون ) 

""";
  static const String elmTextNineteenSeven_3 = """
الولي آمن بالله وهو مستمر على تقواه إلى الممات  

آمنو فعل ماض ، عرف الله عز وجل فآمن به ، لكن يتقون فعل مضارع ، والمضارع يفيد الاستمرار ، أي طوال حياته يتقي الله ، يتقي أن يعصيه ، هذه مرتبة ، يتقي أن ينقطع عنه هذه مرتبة أعلى ، يتقي أن يكون في قلبه سواه ، مرتبة ثالثة ، وعندنا صيام عامة الناس عن الطعام والشراب ، وصيام المؤمنين هو صيام الجوارح عن المعاصي ، وصيام الأتقياء وهو صيام القلب عما سوى الله ، فالولي يتقي أن يعصي الله ، ويتقي أن ينقطع عن الله ، ويتقي أن يكون في قلبه غير الله  
""";
// ------- page 8
  static const String ayahHadithNineteenEight_1 = """
  ( الذين امنو وكانو يتقون ) 

""";
  static const String elmTextNineteenEight_1 = """
بجهود مستمرة ، يبذلون جهوداً كبيرة لا تنقضي .. 
""";
  static const String ayahHadithNineteenEight_2 = """
  ( تتجافى جنوبهم عن المضاجع )

""";
  static const String elmTextNineteenEight_2 = """
تنجافى أي لا يرتاح في نومه بحياته ، يخاف أن يفوته الصبح ، لا يرتاح العصر بنومه لأنه يخاف أن تفوته صلاة العصر ، إذا جلس وسهر ، وتكلموا في شؤن شتى ، وخاضو في الدنيا يشعر أن السهرة بلا طعم ، هذا كله كلام فارغ إذا لم يكن هناك ذكر لله عز وجل ، أي أنه إن ضيع ساعة من حياته لم يذكر الله فيها ، فحياته خسارة 

فرق كبير جداً بين من كان الله وليه وبين من لا ولي له 
""";

// page 9
  static const String elmTextNineteenNine_1 = """
ذلك بأن الله مولى الذين امنوا وان الكافرين لا مولى لهم 
للتقريب، أب نموذجي بأعلى درجة من العلم والحكمة والقدرة والغنى والرحمة والعطف، وله ابن يرعى شؤونه كلها، يرعى صحته، يرعى دراسته، يرعى تربيته، يرعى أخلاقه، يرعى دينه، يخطط لمستقبله، يدفعه إلى أعلى مراتب التفوق، نقول: هذا الأب ولي لهذا الإبن، 
لو تصورنا إبناً مات أبوه، وتزوجت أمه وأهمله المجتمع، فمن انحراف إلى آخر، ومن مخفر إلى مخفر، ومن سجن إلى سجن، يتعاطى المخدرات، ينغمس في بحر الرذيلة، نقول: فرق كبير جداً بين طفل له ولي كبير، أب حكيم، أب عالم، أب مقتدر، وبين طفل مات أبوه، وتزوجت أمه وشرد على أنظمة المجتمع، واستحق الضياع والسجن، هل هناك مايقارب هؤلاء مع هؤلاء؟ 
هل هناك نسبة بين الولدين؟ 

ذلك بأن الله مولى الذين امنوا وأن الكافرين لا مولى لهم 
أنت كمؤمن لك مرجع، لك منهج، لك قيم، لك توجيهات من الله عز وجل، في حياتك فرائض، وواجبات، ومباحات، ومكروهات، ومحرمات، وسنن، لك قدوة، النبي قدوتك، والصحابة قدوتك، والقرآن منهجك، والسنة دليلك، فرق كبير جداً بين من كان الله وليه وبين من لا ولي له 

""";
// page 10
  static const String elmTextNineteenTen_1 = """
الله تعالى حينما الزمك أن تجعل الله وليك أراد لك الولي المطلق الذي لا يعجزه شيئ: 
لذلك بعيد جداً، ويكاد أن يكون مستحيلاً أن يقع المؤمن في ورطة كبيرة، لأن منهج الله يحرسه، لأن أمر الله ونهيه يحميه، لأن علمه أن الله موجود، وأنه يحاسب، وأنه يعاقب، وأن الله معه، ولا يتخلى عنه، هناك حقائق كثيرة جداً تحمي الإنسان من أن ينحرف، هؤلاء الذين يدمرون، هرلاء الذين يسحقون، هؤلاء الذين يفضحون، هؤلاء لم يتخذو الله ولياً لهم، ليس لهم مرجع إلا شهواتهم ومصالحهم ونزواتهم، لذلك يقعون في ورطة ما بعدها ورطة، الله عز وجل يقول 
""";
  static const String ayahHadithNineteenTen_1 = """
   إنما وليكم الله 

""";

  static const String elmTextNineteenTen_2 = """
لماذا لم يرد الله لنا أن نتخذ ولياً غيره؟ لأنه إذا كان وليك الإنسان فالإنسان بالأساس محدود، علمه محدود، قدراته محدودة، عواطفه محدوده، الإنسان محدود وضعيف، فقد يرشدك إلى شيئ فيه هلاك لك، لأن علمه محدود، قد يدلك على شيئ فيه إخفاق لك، لأن علمه محدود، وقد يكذب عليك، ويبين لك أنه وليك وهو في الحقيقة ليس وليك، ففيه إحتمال المحدودية، واحتمال الكذب، لماذا لم يرد الله أن يكون الإنسان وليك ولو كان كبيراً أو عظيماً؟ لأن الإنسان محدود 
لم يرد الله لك أن يكون المرجع محدوداً ولا أن يكون منافقاً، لكن الله سبحانه وتعالى حينما الزمك أن تجعل الله وليك أراد لك الولي المطلق الذي لا يعجزه شيئ لا في الأرض ولا في السماء، أراد لك أن يكون الولي غنياً وقوياً ومهيمناً ومتصرفاً، أراد لك أن تقوى بقوته، وأن تغتني بغناه، وأن تكون حكيماً بحكمته، وأن تسعد بالقرب منه 
""";
  static const String ayahHadithNineteenTen_2 = """
    إنما وليكم الله ورسوله 

""";

  static const String elmTextNineteenTen_3 = """
الله سبحانه وتعالى أنزل الكتاب، والنبي عليه الصلاة والسلام بينه وفصله، فالسنه منهج تفصيلي، والقرآن منهج كلي، لذلك النبي عليه الصلاة والسلام باقواله وأفعاله وإقراره كان تفسيراً وتوضيحاً وبياناً لما في كتاب الله عزوجل فالنبي إذا أمرك بأمر ينبغي أن تأتمر 
وما اتاكم الرسول فخذوه ومانهاكم عنه فانتهوا 
إنما وليكم الله ورسوله والذين آمنوا 
""";
// page 11
  static const String ayahHadithNineteenEleven_1 = """
    والذين أمنوا 

""";
  static const String elmTextNineteenEleven_1 = """
المؤمن نصوح، المؤمن ينصحك ولا يسكت على انحراف، المؤمن يرشدك، المؤمن يأمر بالمعروف وينهى عن المنكر، المؤمن يقدم لك العون، المؤمن يغار على مصيرك، الأصل أن الله ولينا، فرع من هذا الأصل أن النبي عليه الصلاة والسلام ولينا، فرع آخر من الفرع المؤمنون أولياؤنا، لذلك المؤمن يرجع إلى القرآن لأن الله وليه، يرجع إلى السنة لأن النبي عليه الصلاة والسلام وليه، يستشير المؤمنين لأن المؤمنين أولياؤه 

مستحيل أن تكون من حزب الله وأن تُغلب 
""";
  static const String ayahHadithNineteenEleven_2 = """
قال تعالى 
ومن يتول الله ورسوله والذين آمنوا فإن حزب الله هم الغالبون 

""";
  static const String elmTextNineteenEleven_2 = """
مستحيل وألف ألف ألف مستحيل أن تكون من حزب الله وأن تُغلب، مستحيل أن تكون جندياً لله، وأن تُغلب 
طبعاً 
""";
// page 12
  static const String ayahHadithNineteenTwelve_1 = """
    فإن حزب الله هم الغالبون 
إنا لننصر رسلنا والذين آمنوا في الحياة الدنيا 

""";
  static const String elmTextNineteenTwelve_1 = """
هكذا حكم الله عزوجل: 
""";
  static const String ayahHadithNineteenTwelve_2 = """
    وإن جندنا لهم الغالبون 
   وكان حقاً علينا نصر المؤمنين 
ولن يجعل الله للكافرين على المؤمنين سبيلا 

""";
  static const String elmTextNineteenTwelve_2 = """
كُل هذا وعد الله عز وجل، وزوال الكون بأكمله أهون على الله من ألا يحقق وعوده للمؤمنين، فإن لم تحقق هذه الوعود فالخلل عندنا 
""";
  static const String ayahHadithNineteenTwelve_3 = """
نحن أولياؤكم في الحياة الدنيا وفي الآخرة 

""";
// page 13
  static const String elmTextNineteenThirteen_1 = """
الله ولي المؤمنين
""";
  static const String ayahHadithNineteenThreaten_1 = """
    نحن أولياؤكم 

""";

  static const String elmTextNineteenThirteen_2 = """
ربنا عز وجل ينقلك من وضع إلى وضع أحسن، ومن تفلت إلى تمسك، ومن شقاء إلى سعادة، ومن ضياع إلى وجدان، ومن نقمة إلى رضى، ويؤويك في بيت فيأتيك الدخل الحلال، ويجمعك مع أهل الحق، ويجمعك مع الصالحين، ويدخل على قلبك السرور 
""";
  static const String ayahHadithNineteenThirteen_2 = """
    نحن أولياؤكم في الحياة الدنيا 

""";
  static const String subtitleNineteenThirteen_1 = """
الإستقامة سبب ولاية الله للمؤمن 

""";
  static const String elmTextNineteenThirteen_3 = """
الإنسان إذا كان في طاعة الله صار الله وليه، والحقيقة أن القضية سهلة جداً، لمجرد أن تستقيم على أمره تستحق أن يكون الله وليك، خرج الإنسان عن أمر الله عز وجل فكأنه جعل الشيطان وليه، هو عدو مضل مبين، فكل إنسان يعصي الله خرج من ولاية الله، وصار تحت ولاية الشيطان، هو وليُهم يخرجهم من النور إلى الظلمات، فالإنسان المؤمن إذا قرأ هذه الآية شعر أن الله وليه يدافع عنه، يأخذ بيده كلما عثر، كلما زلت قدمه يسوق له من الشدائد مايحمله على التوبة، يتوب عليه ليتوب، هذا معنى وليه فأنت لست سائباً، فالله عز وجل قال 
أفحسبتم أنما خلقناكم عبثاً وانكم إلينا لا تُرجعون 
بل أنت ضمن التربية 
""";
// page 14
  static const String ayahHadithNineteenFourteen_1 = """
نحن أولياؤكم في الحياة الدنيا وفي الآخرة 

""";
  static const String elmTextNineteenFourteen_1 = """
الله حريص على آخرتنا، وعلى دخولنا الجنة، ولذلك كل ماتراه أعيننا من مصائب في الدنيا، ومن نكبات، وأهوال لتسوق العباد إلى الله عزوجل 
رجل قال عن بلد تُعاني ماتعاني من خصومها الصرب، قال: نحن لم نكن مسلمين من قبل، وكنا نأكل الخنزير، ونشرب الخمر، ونأتي الفواحش، ونفعل كل المعاصي، والآن صرنا مسلمين بهذا الضغط الشديد
   نحن أولياؤكم في الحياة الدنيا وفي الآخرة 
فحتى النكبات الكبيرة أحياناً نفهمها فهماً محدودا، فهذه الدولة فعلت كذا مع جارتها، فهناك فهم أعمق بكثير، قال الله عزوجل 
وضرب الله مثلاً قرية كانت آمنة مطمئنة يأتيها رزقها رغداً من كل مكان فكفرت بأنعم الله فاذاقها الله لباس الجوع والخوف بما كانوا يصنعون 
وحتى الأحداث الكبرى لها تفسير توحيدي رائع جداً 
""";
// page 15
  static const String subtitleNineteenFifteen_1 = """
الدنيا لا معنى لها إلا أن تكون سبباً للآخرة 
""";

  static const String elmTextNineteenFifteen_1 = """
وبما أن الولاية تمتد للآخرة، وكان التأديب في الدنيا، ولو كانت في الدنيا فقط لكان الناس جميعهم في بحبوحة، وفي غنى، وليست هناك مشكلة، ولا مرض، ولا هم، ولا حزن، لكن لأن الله سبحانه وتعالى وليُنا في الدنيا والآخرة، والدنيا مطية للآخرة، ومزرعة لها، بل إن الدنيا لا معنى لها إلا أن تكون سبباً للآخرة، لأن يوم القيامة حينما يدخل أهل الجنة الجنة يقولون 
وقالوا الحمدلله الذي صدقنا وعده وأورثنا الأرض نتبوأ من الجنة حيث نشاء 
فلولا أن كنا في الأرض، وعرفنا ربنا فيها، واستقمنا على أمره، وفعلنا الصالحات لما كنا في الجنة الآن. 
إذاً هنا الآية 
""";
  static const String ayahHadithNineteenFifteen_1 = """
    نحن اولياؤكم 
""";
  static const String elmTextNineteenFifteen_2 = """
أولياء أموركم.. 
""";
  static const String ayahHadithNineteenFifteen_2 = """
 في الحياة الدنيا وفي الآخرة 
""";
  static const String elmTextNineteenFifteen_3 = """
فإذا جاءك من الله مايعجبك فهذا من نعم الله عليك، وإذا جائك من الله مالايعجبك فهذا من تربيته لك لتكون في الجنة؛ أعطاك مالاً للدنيا، أعطاك بيتاً للدنيا، أما إن سلب منك شيئاً وأنت غافل، فهذا الذي سلبه منك من أجل أن تصحو، من أجل أن تلتفت إلى آخرتك، وأن تفعل الخيرات، إذاً عندما تجمع الدنيا مع الآخرة تحل مشكلاتك، أما الدنيا فقط ففيها متاعب لا تعد ولا تحصى

""";
// page 16
  static const String titleNineteenSixteen = """
  وقفة 
------
""";
  static const String subtitleNineteenSixteen_1 = """
مفتاح باب الولاية الإلهية 
-----------------
""";
  static const String elmTextNineteenSixteen_1 = """
قد يقول قائل كيف الوصول إلى الله؟ 
كيف الوصول إلى درجة الولاية؟ 
ماهي الطريقة؟ 
ماهو السر؟ 
هُناك مفتاح من اهم واعز واسرع المفاتيح التي توصلك إلى ولاية الله، وحب الله لك 
يقول العلماء من أُعطي الذكر فقد أُعطي منشور الولاية
""";
}
