class ElmTextDersTen {
  static const String elmTextDersTen1 = """
 والذين جاهدو فينا
---------------
طاقته ، نشاطه ، تفكيره ، وقته ، خبرته ، علمه ، عضلاته ، كل شيئ يملكه أنفقه في سبيل الله ، بذل غاية الجهد ، بذل كل مايملك فينا في سبيلنا في سبيل معرفتنا في سبيل طاعتنا في سبيل التقرب إلينا في سبيل نيل رضائنا

""";

//   static const String elmTextDersTen2 = """

// ---------------------

// """;

   static const String elmTextDersTen3 = """
 وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا 
سورة العنكبوت 

وقته، إمكاناته، ماله، صحته، مكانته، وجاهته، ذكائه، معلوماته، كل عضلاته، كل خبراته، علمه، وحرفته، كل شيئ بذله رخيصآ في سبيل الله، في سبيل معرفتنا، في سبيل طاعتنا، في سبيل التقرب إلينا، في سبيل نيل رضائنا.
 ---------------------
   """;

  static const String elmTextDersTen4 = """
وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩
سورة العنكبوت 

هؤلاء الله عز وجل يطمئنهم، لا بد من أن تصلو إلينا، لا بد من أن نعينكم على طاعتنا، لابد أن نعينكم على بلوغ رضائنا.
---------------------
""";

static const String elmTextDersTen5 = """ 
وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩ 
سورة العنكبوت 

أبشروا، سبلنا هي السبل الموصلة إلينا، سبيل الطاعة، سبيل الرضوان، سبيل الجنه، سبيل السعاده، سبيل السلم، أن تكون في سلام مع الله، ومع الناس، سبيل الحمد، هذه السبل كلها لله، والسبل إلى الله كثيرة، سبيل لطاعته، سبيل لتقواه، سبيل لمرضاته، سبيل للفوز بجنته، سبيل لمحبةأنبيائه ورسله، سبيل لأن تسعد بقربه
----------

""";

static const String elmTextDersTen6 = """
معيةالله للمحسنين 
هذه معيه خاصه، وهذه المعيه الخاصه ثمنها ان تكون محسنآ مع من ؟ مع كل الخلق، بقولك محسن، بعملك محسن، بحرفتك محسن، بوظيفتك محسن، بتجارتك محسن، بصناعتك محسن، بكل شيئ تفعله، في بيتك محسن، مع جيرانك محسن، مع الخلق كلهم محسن معهم.
 
 ---------------------
   """;
   static const String elmTextDersTen7 = """
وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩ 
سورة العنكبوت 

ومن السذاجه والغباء، وضيق العقل والحمق ان تظن ان معيةالله تنالها بلا ثمن أو بثمن بخس
 ---------------------

 """;

   static const String elmTextDersTen8 = """
:قال تعالى 
 وَقَالَ ٱللَّهُ إِنِّی مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَیۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِی وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنࣰا 
 سورة المائدة 

هذه معية الله عز وجل، فالإنسان لا يطمع بمعيةالله بلا ثمن أو بثمن بخس سخيف، الا إن سلعةالله غالية، وطلب الجنه من دون عمل ذنب من الذنوب
 ---------------------
 """;

  static const String elmTextDersTen9 = """
وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩

هذه الأيه بشاره لكل محسن
والله اللذي لا إله إلا هو، هذه الايه وحدها فيها بشاره كبيره لكل مؤمن، أيها المؤمن: مادام همك ان تعرفنا، مادام همك أن تطيعنا، مادام همك أن تتقرب إلينا، مادام همك أن تبذل كل شيئ من أجلنا، فأبشر، فإنك سوف تصل إلينا، وتهتدي إلى سعادتك وجنتك، ومعيةالله عز وجل ثمنها أن تكون محسنا.

وَلَمَّا بَلَغَ أَشُدَّهُۥۤ ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰاۚ وَكَذَ ٰلِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ ۝٢٢
سورة يوسف 

---------------------
  """;

   static const String elmTextDersTen10 = """
يجب أن تكون محسنا، يجب أن يفتقدك الناس إذا غبت عنهم، إذا دخلت البيت يجب أن يكون عند اولادك عيد، لأنك محسن، فإذا كنت قاسيا عليهم، فإذا كنت بخيلا يتوخى الأولاد أن لا تكون بينهم، فكن محسنآ في عملك، في دائرتك، في متجرك، في مصنعك، في دكانك، في زراعتك، في أي شيء، محسن مع الوالدين، مع الزوجة، مع الأقارب، مع الجيران

 وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا 
 سورة العنكبوت 
 ---------------------
 """;

   static const String elmTextDersTen11 = """
بذلوا كل جهدهم، كل طاقتهم، كل علمهم، كل خبرتهم، كل عضلاتهم، كل وقتهم، كل شبابهم فينا، من أجل معرفتنا وطاعتنا والتقرب إلينا.

لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ  

سبل السعادة والسلام، والأمن والراحة والرضوان، والفوز والنجاح والفلاح

 وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩ 
 سورة العنكبوت 

هذه الأية تكفي كل مؤمن، ولتكن في قلبه دائمآ، ولتكن في ذهنه دائما
 ---------------------
   """;

//   static const String elmTextDersTen12 = """

// ---------------------

// """;

//    static const String elmTextDersTen13 = """

//  ---------------------
//    """;

//   static const String elmTextDersTen14 = """

// ---------------------

//   """;

//   static const String elmTextDersTen15 = """


// ---------------------

//   """;

//    static const String elmTextDersTen16 = """ 

//  ---------------------

//    """;

//   static const String elmTextDersTen17 = """

// ---------------------

//  """;
//   static const String elmTextDersTen18 = """

// ---------------------
//  """;
}
