class ElmTextNineteen {
  //---- page 1
  static const String titleNineteenOne = """
معنى الولي
""";
  static const String elmTextNineteenOne_1 = """
ما معنى الولي لله ؟ أي أنه استسلم لله فتولى الله هدايته ، وتولى الله إرشاده ، وتولى الله إسعاده ، وتولى الله حفظه ، وتولى الله الأخذ بيده من خير إلى خير ، ولا ينتهي به المطاف إلا في الجنة ، واستسلم لله هذه هي حقيقة الإسلام ، أن تستسلم لله ، أن تفوض له ، أن تتوكل عليه ، إذا استسلمت له تولى الله شأنك .. 
""";
  static const String ayahHadithNineteenOne_1 = """
( الله ولي الذين آمنو يخرجهم من الظلمات إلى النور والذين كفرو اولياؤهم الطاغوت يخرجونهم من النور إلى الظلمات ) 
""";
// page 2
  static const String subtitleNineteenTwo_1 = """
إحذر ولاية الشيطان  
""";

  static const String elmTextNineteenTwo_1 = """
لا يزال الشيطان يتولى أولياءه ، ويغريهم بالمعاصي ، ويورطهم بالجرائم إلى أن يصعدوا سُلم المشنقة ، هذا من عمل الشيطان ، ولا يزال الله سبحانه وتعالى يتولى أولياءه بالحفظ ، والهداية وتنوير القلب ، والإرشاد ، والإسعاد حتى يأخذ بيدهم إلى الجنة ، فليس هناك حال ثالثة ، إما ان يكون الإنسان ولياً لله عز وجل وإما أن يكون ولياً للشيطان ، إذا استسلمت لله عز وجل تول الله إرشادك ، وحفظك ، وهدايتك وإسعادك .. 
""";
  static const String elmTextNineteenTwo_2 = """

( ألا إن اولياء الله لا خوف عليهم ولا هم يحزنون ) 

""";

  static const String subtitleNineteenTwo_2 = """
تعريف الولي في الكتاب والسُنة  
""";

  static const String elmTextNineteenTwo_3 = """
النبي عليه الصلاة والسلام يُعرف ولي الله فيقول 
 """;

  static const String ayahHadithNineteenTwo_1 = """

 ( ورد في الآثر ) 
( الذين يُذكر الله برؤيتهم ، أولياء أمتي إذا رُوؤا ذكر الله بهم )

""";
// page 3
  static const String elmTextNineteenThree_1 = """
تقع عينك عليه فتذكر الله سبحانه وتعالى ، هذه علامة

علامة أخرى

كما قال عليه الصلاة والسلام  
""";

  static const String ayahHadithNineteenThree_1 = """
 إن من عباد الله لأناساً ما هم بأنبياء ولا شُهداء ، يغبطهم الأنبياء والشهداء يوم القيامة بمكانتهم من الله تعالى 
  ( ابو داؤد عن عمر ) 
""";
  static const String elmTextNineteenThree_2 = """
هذا تعريف آخر 
""";

// page 4
  static const String elmTextNineteenFour_1 = """
تعريف ثالث
  """;
  static const String ayahHadithNineteenFour_1 = """

هم قوم تحابو بروح الله ، على غير أرحام بينهم ، ولا أموال يتعاطونها ، فوالله إن وجوههم لنور ، وإنهم على نور ، لا يخافون إذا خاف الناس ولا يحزنون إذا حزن الناس ))
 ( سنن ابي داؤد عن عمر ابن الخطاب 

""";

  static const String elmTextNineteenFour_2 = """
مقياس دقيق جداً ، إذا خاف الناس جميعاً لا يخافون .. 
""";

  static const String ayahHadithNineteenFour_2 = """

( إن الإنسان خُلق هلوعا إذا مسه الشر جزوعا وإذا مسه الخير منوعا إلا المصلين ) 

""";

  static const String elmTextNineteenFour_3 = """
المصلي لا يخاف ، ولا يحزن ، وقارئ القرآن لا يحزن ، لِمَ الحزن ؟ الله سبحانه وتعالى خالق السماوات والأرض ، الغني القوي ، العزيز ، الرحيم ، السميع ، المجيب ، وهو معك . 
""";

// page 5
  static const String ayahHadithNineteenFive_1 = """

        ( واصبر لحكم ربك فإنك باعيننا ) 
  
        ( إن الله يدافع عن الذين امنوا ) 

( إن الذين آمنوا وعملو الصالحات سيجعل لهم الرحمان ودا ) 

  """;
  static const String elmTextNineteenFive_1 = """
لذلك قال عليه الصلاة والسلام : 
""";
  static const String ayahHadithNineteenFive_2 = """

      ( لا يحزن قارى القران ) 

""";
  static const String elmTextNineteenFive_3 = """
من علامات أولياء الله أنهم لا يخافون إذا خاف الناس ، ولا يحزنون إذا حزن الناس ، إذاً : ولي الله هو الرجل الذي استسلم لله عز وجل ، حينما استسلم لله عز وجل تول الله هدايته ، وإسعاده ، وحفظه ، ومايزال الله سبحانه وتعالى يأخذ بيد وليه حتى يدخله الجنة
""";
// page 6
  static const String elmTextNineteenSix = """
في الدنيا لا يخافون 
من علامات المؤمن الصادق أن يقول لك : والله الذي لا اله الا هو إنني أسعد الناس ، على دخله المحدود ، وعلى بيته الصغير ، وعلى متاعبه الكثيرة ، لأنه سعد بالله عز وجل.

إذا ابتعد الإنسان عن الله عزوجل ألقى الله الخوف في قلبه فانقلبت حياته جحيماً ، وانقلب غناه فقراً ، فأنت من خوف الفقر في فقر ، وأنت من خوف المرض في مرض ، وتوقع المصيبة مصيبة اكبر منها ، وما من مرض يفتك بالناس اليوم في بقاع الأرض كالقلق 
""";
}
