class ElmTextDersNine {
  static const String elmTextDersNine1 = """
الخاطرة التاسعة
فَأَمَّا ٱلۡیَتِیمَ فَلَا تَقۡهَرۡ ۝

---------------------
""";

  static const String elmTextDersNine2 = """
اليتيم فقد أباه، والأب أكبر دعم للإنسان ﴿قل إن كان آباؤكم وأبناؤكم وإخوانكم وأزواجكم
بدأ بالأب لأنه موطن إعتزاز، وموطن قوة، والأب يرعى ابنه، أودع الله في قلب الأب رحمةً تكفي كي يرعى أولاده، لذلك ربما لاتجد في القرآن وصيةً للآباء بأبنائهم، لأن رعاية الإبن طبع في الإنسان، أو جزء، من طبعه، فكأن الله سبحانه وتعالى من أجل أن تستمر الحياة، ومن أجل أن يعتني بالصغار، أودع في قلب الآباء والأمهات ابتداءً محبة أولادهم، فالأب المؤمن وغير المؤمن، والأم الفاسقة وغير الفاسقة، أية أم وأي أب في الأصل، وهذا في الأعم الأغلب عنده رغبة قوية أن يرعى أولاده، أما إذا فقد الابن أباه بموت أو شيء من هذا القبيل فَقَدْ فَقَدَ الدعم، فقد الإمداد، فقد الرعاية، فقد التوجيه، فقد العطف، فقد الحنان، فقد الإنفاق، لذلك أنت مكلف أن ترعى اليتيم، وأن تقدم له جزءاً مما فقد من حنان الأب، وهذا واجب اجتماعي وواجب على كل مسلم، وبيت فيه يتيم مكرم هذا بيت يحبه الله عز وجل، لذلك ينبغي أن ترعى اليتيم، فإن لم ترعَ اليتيم فأنت آثم، فإن آذيت اليتيم فأنت مجرم 

قال تعالى *
فَأَمَّا ٱلۡیَتِیمَ فَلَا تَقۡهَرۡ ۝٩وَأَمَّا ٱلسَّاۤئِلَ فَلَا تَنۡهَرۡ ۝١٠ 
---------------------
سورة الضحى*
""";

   static const String elmTextDersNine3 = """
حظنا الإسلام والنبي الكريم على رعاية اليتيم واستثمار ماله بالمعروف

قال تعالى *
أَرَءَیۡتَ ٱلَّذِی یُكَذِّبُ بِٱلدِّینِ ۝١فَذَ ٰلِكَ ٱلَّذِی یَدُعُّ ٱلۡیَتِیمَ ۝٢ 
 ---------------------
 سورة الماعون * 
   """;

  static const String elmTextDersNine4 = """
أي يضربه ويؤذيه، وكأن الله سبحانه وتعالى اضهر أن من أشنع الأعمال عند الله أن تدفع يتيماً، أو أن تؤذيه، بل إنك إن لم تقدم له شيئاً فأنت آثم، فكيف إذا آذيته، فكيف إذا بالغت في إيذائه، لكن هذا اليتيم بعد أن يبلغ سن الرشد لايبقى يتيماً، بل من حقه أن يأخذ ماله، والأموال كما تعلمون قد يرثها اليتيم عن أبيه، لكن لأنه صغير لايستطيع ان يدير هذا المال فقد نظم الشرع نظاماً رائعاً، أن لكل يتيم وصياً يتولى أمره، وفي الأعم الأغلب ينبغي أن يكون هذا الوصي من أقربائه، ممن عرفوا بالصلاح والاستقامه والعدل والرحمة والورع، فما من وصي إلا وهو من الأقرباء إجمالاً، ويبالغون في هذا فيضعون ناظراً للوصي، وصي ومن يراقب هذا الوصي، لحرمة مال اليتيم، لكن هذا اليتيم لايُعطى ماله لأنه لايستطيع أن يديره، أما إذا كبر هذا اليتيم فينبغي أن يدفع له ماله، أما إذا كان صغيراً يدفع إليه مال كي يأكل منه، وكي يكتسي منه، فمن كان دون سن الرشد ينبغي أن يدفع إليه مال من ريع ماله 

قال تعالى *
 وَلَا تُؤۡتُوا۟ ٱلسُّفَهَاۤءَ أَمۡوَ ٰلَكُمُ ٱلَّتِی جَعَلَ ٱللَّهُ لَكُمۡ قِیَـٰمࣰا وَٱرۡزُقُوهُمۡ فِیهَا وَٱكۡسُوهُمۡ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا ۝٥ *
---------------------
سورة النساء * 
""";

static const String elmTextDersNine5 = """ 
ينبغي أن تنفق عليه من ربح ماله لا من أصل ماله، كي تنمي ماله، والنبي عليه الصلاة والسلام بين أننا إذا لم نستثمر مال اليتيم تأكله الزكاة، فلا بد من دفع زكاة مال اليتيم، فإن لم يكن في الاستثمار أكلته الزكاة، إذاً كأن النبي عليه الصلاة والسلام حظنا على أن نستثمر مال اليتيم، بالمعروف طبعاً، إذا اليتيم مادام صغيراً، وله وصي معروف بالصلاح والورع والتدين والحرص والأمانه والنزاهة هذا الوصي ينبغي أن ينفق على اليتيم من ريع ماله، هذا هو الصواب  فإن لم يكن، وأنفق من ماله المال صار في طريق النفاذ، وهذه مشكلة، وأكبر خسارة أن يخسر الإنسان رأس ماله، هنا أمر إلهي 
 
 يقول الله عز وجل * 
وَءَاتُوا۟ ٱلۡیَتَـٰمَىٰۤ أَمۡوَ ٰلَهُمۡۖ وَلَا تَتَبَدَّلُوا۟ ٱلۡخَبِیثَ بِٱلطَّیِّبِۖ وَلَا تَأۡكُلُوۤا۟ أَمۡوَ ٰلَهُمۡ إِلَىٰۤ أَمۡوَ ٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبࣰا كَبِیرࣰا ۝٢ * 
----------
سورة النساء * 
""";

static const String elmTextDersNine6 = """
بعضهم قال: إذا كان اليتيم دون سن البلوغ معنى الإيتاء هنا أن تنفقوا عليهم نفقة تصلح معاشهم، يأكلوا ويشربوا ويلبسوا، أما إذا بلغوا سن الرشد ينبغي أن تمتحنوا هؤلاء اليتامى، أن تمتحنوا خبراتهم في الحياة، أن تمتحنوا دقتهم في التعامل، أن تمتحنوا عقلهم الراجح 
:من بنود التقوى حسن التعامل مع مال اليتيم

قال تعالى *
 وَٱبۡتَلُوا۟ ٱلۡیَتَـٰمَىٰ حَتَّىٰۤ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدࣰا فَٱدۡفَعُوۤا۟ إِلَیۡهِمۡ أَمۡوَ ٰلَهُمۡۖ وَلَا تَأۡكُلُوهَاۤ إِسۡرَافࣰا وَبِدَارًا أَن یَكۡبَرُوا۟ۚ وَمَن كَانَ غَنِیࣰّا فَلۡیَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِیرࣰا فَلۡیَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَیۡهِمۡ أَمۡوَ ٰلَهُمۡ فَأَشۡهِدُوا۟ عَلَیۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِیبࣰا ۝٦ 

إن كان دون سن الرشد ينبغي أن تنفق عليه، وإن بلغ سن الرشد ينبغي أن تمتحنوا هؤلاء اليتامى امتحان رشد، وامتحان عقل وامتحان دِقة
العلماء لهم وقفة لطيفة متأنية، أنه في الأعم الأغلب إذا كان الذي يستثمر أموال اليتامى غنياً ينبغي أن يستعفف عن أن يأخذ شيئاً مقابل الاستثمار، أما إذا كان فقيراً محتاجاً فله أن يأكل بالمعروف، والأكل بالمعروف حدده العلماء بالقاعدة التالية؛ أن يأخذ أجر المثل أو حاجته
 ---------------------
 سورة النساء * 
   """;

   static const String elmTextDersNine7 = """
عليك أن تتعامل مع مال اليتيم وكأنه مالك من أجل حفظه وصيانته

قال تعالى *
 وَءَاتُوا۟ ٱلۡیَتَـٰمَىٰۤ أَمۡوَ ٰلَهُمۡۖ وَلَا تَتَبَدَّلُوا۟ ٱلۡخَبِیثَ بِٱلطَّیِّبِۖ وَلَا تَأۡكُلُوۤا۟ أَمۡوَ ٰلَهُمۡ إِلَىٰۤ أَمۡوَ ٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبࣰا كَبِیرࣰا ۝٢ * 

 لاتأخذوا أطيب أموال اليتيم، وتدفعوا بدلاً منه اسوأ أموالكم، هذا أيضاً ممنوع 

الآية فيها ملمح رائع، لاتأكل مالك، مالي هو، لما لاآكله؟ هو في الحقيقة مال أخيك، وإنما وصف بأنه مالك من أجل أن تتعامل معه وكأنه مالك من حيث حفظه وصيانته، يجب أن تتعامل مع مال اليتيم، وكأنه مالك من أجل حفظه وصيانته، أو من زاوية حفظه وصيانته
 ---------------------
 سورة النساء * 
 """;

   static const String elmTextDersNine8 = """
:إن لم تحرص على مال أخيك نقص هذا المال وصار أخوك عبئاً عليك
:شيء آخر
 أنك إذا حفظت مال أخيك نما هذا المال، وكان أخوك مكتفياً، فإن لم تحرص على مال أخيك نقص هذا المال، وصار أخوك عبئاً عليك، المؤمن العاقل يرى في قوة المؤمنين قوة له، ويرى في ضعفهم ضعفاً له، فإذا قواهم قوي معهم، وإذا أضعفهم ضعف معهم

قال تعالى *
 وَلَا تَأۡكُلُوۤا۟ أَمۡوَ ٰلَهُمۡ إِلَىٰۤ أَمۡوَ ٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبࣰا كَبِیرࣰا ۝٢ 

تأكلوا هنا بمعنى تضموا، لاتضموا أموالهم إلى أموالكم، أي أنتم هنا أغنياء، وكأن الله سبحانه وتعالى نهانا عن أشنع صورة من صور الاحتيال، أن تأكل مال اليتيم وأنت غني، هذه صورة لاتوصف 

إنه كان إثماً كبيراً، الحوب هو الإثم، أي تأثموا إثماً كبيراً 
 ---------------------
 النساء * 
 """;

  static const String elmTextDersNine9 = """
 اليتيم أن يُشهد على ماله الذي أخذه شهوداً عدولاً؟ وكيف ينفق على اليتيم قبل أن يبلغ سن الرشد؟ كيف ينفق؟ مستوى الإنفاق؟ حجم الإنفاق؟ كيف يعامل هذا اليتيم؟ كيف يؤدب هذا اليتيم 

 وَیَسۡءَلُونَكَ عَنِ ٱلۡیَتَـٰمَىٰۖ *

اليتيم من فقد والده، أو والدته، أو فقد أبويه معاً، وقد يكون غنياً، ولكن مالذي فقده هذا اليتيم؟ فقد الأب ففقد الرعاية، وفقد الحب، ففي قلب الأب والأم من الرعاية والرحمة والحب لأولادهما ما لا يوجد في إنسان ما كائن من كان، فأت بأم، وأت بألف مربيةٍ، فألف مربيةٍ لاترقى إلى مستوى أمٍ ولدت هذا الطفل، والشواهد كثيرة، فقد تتمنى البنت أن تكون مع أمها في كوخ ولا أن تكون مع سيدتها في قصر، لأن في قلب الأم من الحب ومن الرحمة ما لا يوصف، بل إن قلب الأم أحد الآيات الدّالة على عظمة الله، إن أردت أن تعرف رحمة الله فانظر إلى قلب الأم، فهذه الأم تتمنى أن يعيش ابنها على أنقاضها، وتتمنى أن ينام وتسهر، وأن يشبع وتجوع، وأن ينعم بالصحة وتمرض، فقلب الأم من آيات الله الدالة على عظمته. 
هذا اليتيم فقد أثمن شيء في حياته، لأنه فقد قلب الأم أو قلب الأب وفقد الرعاية، وفقد الحب، والحنان، والاهتمام، ولاشيء يعوض عن الأب والأم، فاليتيم فقد أمه وأباه، أو فقد أحدهما، فهذا اليتيم لئلا يحقد على المجتمع، ولئلا يرى طفلاً في سنه له أب يكرمه وله أمه تحنُ عليه، فقد أمرنا برعاية الأيتام، وتكريماً لأيتام المسلمين كان النبي عليه الصلاة والسلام سيد الأيتام، نشأ يتيماً لايعرف أمه ولا أباه
---------------------
البقرة * 
  """;

   static const String elmTextDersNine10 = """
:قضية اليتيم قضية خطيرة جداً
لذلك فقضية اليتيم قضية خطيرة جداً، إما أن نرعاه أشد الرعاية، وإما أن يكون خارجاً على أنظمة المجتمع وقيمه، لأنه عند إذٍ يحقد، فلا شيء يعدل الأب، ولاشيء يعدل الأم
:مهما فعلنا، نحن نخفف، فلذلك ربنا عز وجل خص اليتامى بآيةٍ دقيقةٍ جداً
 
 قال تعالى *
    وَیَسۡءَلُونَكَ عَنِ ٱلۡیَتَـٰمَىٰۖ قُلۡ إِصۡلَاحࣱ لَّهُمۡ خَیۡرࣱۖ 
 
والمطلق في القرآن يجري على إطلاقه "إصلاح لهم"، إصلاح لهم في حاجاتهم، أمنوا لليتيم حاجاته، أمن له طعامه وشرابه، ومسكنه ومأواه، ووسائل صحته، ووسائل تعليمه، ومالآ يعيش من ريعه
فعلاقتك مع اليتيم ليست علاقة تجارة، ليست علاقة ابتزاز، ولاعلاقة أخذ، ولانفع، بل هي علاقة إصلاح له فقط-  إصلاح لهم خير
أحد الصحابة سأل النبي صلى الله عليه وسلم: عندي يتيم أفأضربه؟ فقال عليه الصلاة والسلام: «مما تضرب منه ولدك» 
اضربه اذا كنت في مثل هذا الذنب تضرب ولدك، فيجب أن تربيه وأن تقوم اعوجاجه، وأن تصلح أخلاقه، وأن تهتم بصحته، وبطعامه، وشرابه، وبأخلاقه، وبجسمه، ومستقبله، ودخله
 
 ---------------------
 البقرة * 
 """;
   static const String elmTextDersNine11 = """
وقفة
----
على الإنسان ان يجعل بينه وبين مال اليتيم هامشآ واسعآ: 
بموضوع الآموال يجب أن تخاف الله خوفآ لا حدود له، لأنك لو بذلت أثمن ماتملك، وهي روحك، وعليك دين لا تنجو من عذاب الله، فكيف لو اكلت اموال اليتامى ظلمآ ؟! 
كان عليه الصلاة والسلام إذا دعي للصلاة على احد اصحابه يقول: أعليه دين؟ فإن قالوا: نعم، 
قال: صلوا على صاحبكم، ماكان يصلي عليه، فكيف إذا أكل اموال اليتامى ضلمآ

قال تعالى *
إِنَّ ٱلَّذِینَ یَأۡكُلُونَ أَمۡوَ ٰلَ ٱلۡیَتَـٰمَىٰ ظُلۡمًا إِنَّمَا یَأۡكُلُونَ فِی بُطُونِهِمۡ نَارࣰاۖ وَسَیَصۡلَوۡنَ سَعِیرࣰا ۝١٠
هذا العمل سوف يوصلهم إلى جهنم، فالإنسان يعد للمليون قبل ان يأكل درهمآ حرامآ ليخش الله عز وجل، ولا سيما إذا كان المال مال يتيم، بل إن مال اليتيم يقول الله فيه

قال تعالى **
وَلَا تَقۡرَبُوا۟ مَالَ ٱلۡیَتِیمِ 
إجعل بينك وبينه هامشآ واسعآ، هذا هو حكم الشرع
 ---------------------
 النساء 10 *
   الانعام 152 **
   """;

}
