class ElmTextDersSeventeen {
  //---- page 1
  static const String elmTextSeventeenOne_1 = """

سيدنا موسى عليه السلام عندما قال 
""";
  static const String ayahHadithSeventeenOne_1 = """

رَبَّنَا ٱطۡمِسۡ عَلَىٰۤ أَمۡوَ ٰلِهِمۡ وَٱشۡدُدۡ عَلَىٰ قُلُوبِهِمۡ فَلَا یُؤۡمِنُوا۟ حَتَّىٰ یَرَوُا۟ ٱلۡعَذَابَ ٱلۡأَلِیمَ ۝٨٨

قال الله عز وجل
قَدۡ أُجِیبَت دَّعۡوَتُكُمَا 
  يونس 89 

""";
  static const String elmTextSeventeenOne_2 = """
من الداعي ؟ الداعي سيدنا موسى
لماذا قال الله عز وجل؟
""";
  static const String ayahHadithSeventeenOne_2 = """
 
 قَدۡ أُجِیبَت دَّعۡوَتُكُمَا

 """;
  static const String elmTextSeventeenOne_3 = """
لأن سيدنا هارون كان معه ، فلما دعا سيدنا موسى عليه السلام قال هارون : آمين ، والتأمين دعاء ، التأمين على دعاء الداعي دُعاء

  """;

//-- page 2
  static const String ayahHadithSeventeenTwo_1 = """

قَالَ قَدۡ أُجِیبَت دَّعۡوَتُكُمَا فَٱسۡتَقِیمَا وَلَا تَتَّبِعَاۤنِّ سَبِیلَ ٱلَّذِینَ لَا یَعۡلَمُونَ ۝٨٩ 
  يونس 89 
""";
  static const String elmTextSeventeenTwo_1 = """
١- لا تستعجلو إجابة الدعاء
لكل شيئ أوان ، وتلبية الدعاء مرهونة بمشيئة الله ، فمن تعجل الشيئ قبل أوانه عوقب بحرمانه ، لكن اطلب من الله واستسلم

  """;
  static const String ayahHadithSeventeenTwo_2 = """
  
  ( فَٱسۡتَقِیمَا ) 

""";
  static const String subtitleSeventtenTwo_1 = """
:المعنى الأول
""";
  static const String elmTextSeventeenTwo_2 = """
بعضهم حمل هذه الأية على الثبات على الاستقامة ، هما مستقيمان ، ما معنى قولك لطالب مجتهد: اجتهد ؟ أي داوم على اجتهادك ، استمر على اجتهادك ،  اثبت على اجتهادك
   
  """;

// page 3
  static const String ayahHadithSeventeenThree_1 = """
( فَٱسۡتَقِیمَا ) 

""";
  static const String subtitleSeventeenThree_1 = """
:المعنى الثاني
""";
  static const String elmTextSeventeenThree_1 = """
تابعا نُصح فرعون ، المعنى الأول: اثبتا على تلك الاستقامة ، المعنى الثاني: تابعا نصح فرعون

""";
  static const String ayahHadithSeventeenThree_2 = """
وَلَا تَتَّبِعَاۤنِّ سَبِیلَ ٱلَّذِینَ لَا یَعۡلَمُونَ ۝٨٩ 
""";
  static const String elmTextSeventeenThree_2 = """
هؤلاء الذين لا يعلمون يستعجلون قضاء الله وقدره ، والإيمان بالقدر يُذهب الهم والحزن ، ولكل شيئ أوان ، لكل شيئ قدر ، الأمور بمواقيتها ، فالإنسان يجب ألا يتجاوز حدوده في تعيين وقت الإجابة ، ادع الله ثم اترك الأمر لله سبحانه
  """;

// page 4
  static const String elmTextSeventeenFour_1 = """
قد يقول قائل لماذا ادعي ورزقي مقسوم مكفول من قبل ان اولد؟

الله سبحانه وتعالى امرنا بالدعاء
""";
  static const String ayahHadithSeventeenFour_1 = """

ادْعُونِي أَسْتَجِبْ لَكُمْ ۚ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ

""";
  static const String elmTextSeventeenFour_2 = """
 الدعاء هو العبادة
لم يقُل عن دعائي ، قال 
     ( عن عبادتي ) 

إذا العبادة هي الدعاء ، والدعاء هو العبادة

 الدعاء اعتراف بضعف العبد وافتقاره إلى ربه 
""";

//---- page 5
  static const String elmTextSeventeenFive_1 = """
الإنسان حينما يدعو الله سبحانه وتعالى ، يعترف بضعفه وبقوة الله ، يعترف بفقره ، وبغنى الله عز وجل ، يعترف بجهله وبعلم الله 
فإذا عرف الإنسان نفسه ، وعرف افتقاره إلى الله ، وعرف ضعفه ، وعرف قوة الله ، ورحمته ، وعلمه ، وحكمته ، وغناه ، وقدرته ، فقد عبد الله عز وجل ، أي انه تلبس بالعبودية ، هذه هي العبادة
""";
  static const String elmTextSeventeenFive_2 = """
أبرز مظاهر العبادة الدعاء ، الصلاة عبادة ، الصوم عبادة ، الحج عبادة ، غض البصر عبادة ، ضبط اللسان عبادة ، أن تقيم بيعك وفق الشرع أنت عابد لله ، ألا تكذب ، وأن تصدق فهذه عبادة
لكن هناك عبادات شعائرية ؛ صلاة وصوم وحج وهناك عبادات تعاملية ؛ صدق وأمانة ، واستقامة ، وبيع حلال ، وكسب حلال ، وإنفاق حلال ، وغض بصر....إلخ

العبادات الشعائرية والتعاملية بمجملها عبادة ، أحد مظاهرها الدعاء  
إنك بالصلاة تتصل بالله في اليوم خمس مرات ، وبالصيام تتصل بالله في العام شهراً ، بالحج تتصل بالله في عمرك شهراً ، لكنك بالدعاء تتصل بالله عند كل حركةٍ وسكنة
""";

// -- page 6
  static const String elmTextSeventeenSix_1 = """
أحد ابرز العبادات الدعاء ، وكلما اكثرت من الدعاء كنت أقرب إلى الله عز وجل
 
 """;
  static const String elmTextSeventeenSix_2 = """
وفي الحديث
""";
  static const String ayahHadithSeventeenSix_1 = """
( الدعاء يرد القدر ) 
( لا يرد القضاء إلا الدعاء ) 

( العبادة هي الدعاء) *
( والدعاء مخ العبادة) *
""";

  static const String elmTextSeventeenSix_3 = """
لماذا كان الدعاء عبادة؟ 
لإن الإنسان بفطرته لا يدعو جهة لا يؤمن بوجودها 
أنت لا تدعو جهة لا تؤمن بوجودها ، وأنت لا تدعو جهة لا تسمعك ، وأنت لا تدعو جهة ليست قادرة على تحقيق ماتطلب منها ، وأنت لا تدعو جهة تسمعك وقادرة ، ولكنها لا تريد أن ترحمك 
لمجرد أن تدعو الله عز وجل حكمآ أنت مؤمن بوجوده ، ومؤمن بأنه يسمعك ، ومؤمن بأنه قادر على أن يلبيك ، ومؤمن بأنه يحب أن يلبيك ، خلقك ليرحمك
""";

// -- page 7
  static const String elmTextSeventeenSeven_1 = """
لذلك يقول الله عز وجل 
""";
  static const String ayahHadithSeventeenSeven_1 = """

 قُلْ مَا يَعْبَأُ بِكُمْ رَبِّي لَوْلَا دُعَاؤُكُمْ ۖ     
[ سورة الفرقان: 77]
""";
  static const String elmTextSeventeenSeven_2 = """
لكن هناك تمهيد لابد منه ، أراد الله عز وجل لحكمة بالغة بالغة ، بالغة أن يكون الإنسان ضعيفا
""";
  static const String ayahHadithSeventeenSeven_2 = """

 ( وَخُلِقَ الْإِنْسَانُ ضَعِيفًا )

""";
  static const String elmTextSeventeenSeven_3 = """
هذا ضعف في أصل خلقه
والإنسان كما قال تعالى 
""";
  static const String ayahHadithSeventeenSeven_3 = """
۞ إِنَّ ٱلۡإِنسَـٰنَ خُلِقَ هَلُوعًا ۝١٩
إِذَا مَسَّهُ ٱلشَّرُّ جَزُوعࣰا ۝٢٠
وَإِذَا مَسَّهُ ٱلۡخَیۡرُ مَنُوعًا ۝٢١
إِلَّا ٱلۡمُصَلِّینَ ۝٢٢
* المعارج
""";

// -- page 8
  static const String elmTextSeventeenEight_1 = """
لماذا خلقه الله هلوعاً، جزوعاً ، منوعاً ، ضعيفاً ؟ لإنه لو خلقه قوياً لاستغنى بقوته عن الله عز وجل ، فشقي بإستغنائه 
خلقه ضعيفاً ليفتقر بضعفه فيسعد بإفتقاره ، خلقنا ضعفاء ، وساق لنا بعض المصائب كي نتعرف إليه ، ونتصل به ، ونسعد بقربه ، ونذوق طعم القرب منه
""";
  static const String footerSeventeenEight = """

------------
( والدعاء مخ العبادة) *
الرواية فيها ضعف 
الدعاء هو العبادة في الحديث الصحيح
  """;

// page 9
  static const String subtitleSeventeenNine_1 = """
علة الدعاء الإتصال بالله
-----------------
""";
  static const String elmTextSeventeenNine_1 = """
هذه النقطة دقيقة جداً ، علة الدعاء أن تتصل به ، هناك نخبة من البشر يتصلون بالله عز وجل من دون مشكلة ، من دون مصيبة ، من دون ابتلاء ، هؤلا الأنبياء والمرسلون ، وكبار العلماء ، الصديقون ، الصحابة الكرام لكن عامة المسلمين يحتاجون إلى بواعث ، إلى دوافع ، إلى محفزات
أحياناً يضعف الإنسان أمام مشكلة ، ليس له إلا الله ، يدعو الله عز وجل فيستجيب له ، فتزداد عقيدته بالله ، يدعو الله فيستجيب له ، ويذوق طعم القرب منه ، فيلزم هذا الباب ، فكم من مشكلة سببت قرباً منه ، كم من مشكله سببت أن الإنسان بعد أن يعرف الله يزهد فيما سواه
""";
  static const String ayahHadithSeventeenNine_1 = """;
 
 ( وَخُلِقَ الْإِنْسَانُ ضَعِيفًا )

""";
  static const String elmTextSeventeenNine_2 = """
هذا الضعف في أصل ضعفه ، لمصلحته ليلتجأ إلى ربه
""";

// page 10
  static const String elmTextSeventeenTen_1 = """
القصد من الدعاء الحقيقي أن تتصل بالله ، وأن تذوق طعم القرب منه ، وأن ترى ألوهيته ، الأمر كله بيده

الدعاء يقوي العقيده 
أجمل كلمة قرأتها عن الدعاء أنه يقوي العقيده أنت ضعيف والأمور صعبة جداً وهناك مشكلة كبيره جدآ لا تحل ، قمت في الليل ، وركعت ركعتين ، وتوجهت إلى الله عز وجل ، وقلت : يارب، ليس، لي سواك، في اليوم التالي شعرت بتبدل جذري، الذي كان مصراً على منعك تساهل معك، ما الذي حصل؟ تشعر أن الله بيده كل شيئ تشعر أن الله بيده من هم دونك ومن هم فوقك بيده الأقوياء بيده الجبابره  

سيدنا موسى لم لم يقتله فرعون ؟ لم هابه ، وأجرى معه مناظرة ؟ وجاء بالسحرة ، الأمر بيد الله عز وجل 
""";
  static const String ayahHadithSeventeenTen_1 = """;

 قَالَا رَبَّنَا إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَا أَوْ أَن يَطْغَىٰ

 قَالَ لَا تَخَافَا ۖ إِنَّنِي مَعَكُمَا أَسْمَعُ وَأَرَىٰ

 """;

// page 11
  static const String ayahHadithSeventeenEleven_1 = """;
 
 قَالَ أَصْحَابُ مُوسَى إِنَّا لَمُدْرَكُونَ قَالَ كَلا إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ

""";
  static const String elmTextSeventeenEleven_1 = """
ما من مؤمن صادق إلا وله مع الله خبرة في هذا الموضوع يدعوه من كل جوارحه يسأله فيستجيب الله له ليعرفه أنه استمع إلى دعائه ، وأجابه ، وهو بيده كل شيئ ، هذه هي حكمة الدعاء أن تعرف أن الله معك ، حاضر ، ناظر ، سميع ، قريب ، مجيب وحينما يستجيب لك من أجل أن تحبه من أجل أن تثق به من أجل أن تكون معه من أجل أن تخافه وحده ولا تخاف من دونه أحداً 

 """;
}
