class ElmTextDersSixteen {
  // page 1
  static const String titleSixteenOne = """
المرأه الصالحه ودورها في المجتمع
--------------------------
 """;
  static const String subtitleSixteenOne_1 = """

دور المرأه بين تيه الفلسفة الوضعية ونور الإسلام 
 """;
  static const String elmTextDersSixteenOne_1 = """
للمرأة دور خطير في الحياة ، ولدور المرأة فلسفة خاصة في أي فكر ، أو أي نظام ، أو أي اتجاه ، ولكن المسلم يستقي عقيدته من كتاب الله ، ويستقي منهجه من كتاب الله ، فأي مبدأ ، أي مذهب وضعي ، أي فكر وضعي ، أي نظام وضعي ، له أن يُفلسف دور المرأه مايشاء ، ولكن المُعول عليه هو النظام الإلهي ، نظام خالق الكون ، أنت بإمكانك أن تكتب مبادئ ، وتقول : المرأة يجب أن تعمل كذا وكذا وكذا 
هذا كلامك ، وهو شيئ جميل 
 """;
  static const String ayahHadithSixteenOne_1 = """
 ذَٰلِكَ قَوْلُهُم بِأَفْوَٰهِهِمْ ۖ
""";
  static const String elmTextDersSixteenOne_2 = """
هذه كلمة تقولها بفمك ، لكن ياترى هل هي مطابقة للواقع ؟ هل هي مؤدية إلى نتائج عملية إيجابية ، أم هي مدمرة ؟ أي إنسان بإمكانه أن يقبع في غرفة ، وأن يكتب مبادئ ، ويقول لك : أنا ارى أن تكون المرأة في الموقع الفلاني ، أو الموقع الفلاني ، وأن تفعل كذا ، وأن تخرج كذا ، وأن تعمل كذا ، هذا شيئ يمكن أن يقوله كل إنسان ، ولكن هذا الكلام يبقى كلام بشر ، إن أصاب في جهةٍ يسيرة أخطأ في جهاتٍ كثيرة ، وإن دغدغ عواطف فئةٍ من الناس فقد فجر مشاعر فئات كثيرة ، ولكن المعول عليه في موضوع خطير كموضوع المرأة هو خالق الكون الذي خلقها ، خالق الكون الذي أنزل القرآن الذي لا يأتيه الباطل من بين يديه ولا من خلفه هو المعول عليه

""";
// page 2
  static const String subtitleSixteenTwo_1 = """
موقف الإسلام من المرأة  
""";
  static const String elmTextDersSixteenTwo_1 = """
المرأة مساوية للرجل تكليفاً وتشريفاً 
مساوية للرجل تماماً ، مساوية للرجل تماماً في التكليف وفي التشريف وفي المسؤلية ، لكن المرأة لها خصائص نفسية وجسمية واجتماعية ، وللرجل خصائص نفسية وجسمية واجتماعية وعقلية  
كل طرف خصائصه كمال في حقه ، فالمرأة صُممت لتكون زوجة وأماً ترعى أولادها ، فقد أعطاها الله من العاطفة الشيئ الكثير ، أعطاها القلب الكبير ، أعطاها المشاعر المرهفة ، أعطاها الحُب ، أعطاها العطف ، أعطاها الاهتمام ، والرجُل لأنه خُلق ليكسب الرزق أعطاه الله ضعفاً في عواطفه ونماءً في عقله وملكاته ، فصفات الرجل العقلية والجسمية والنفسية والإجتماعية كمالٌ فيه ومعينة على أداء مهمته ، وصفات المرأة الجسمية والعقلية والاجتماعيه والنفسية كمال فيها ومعينة على أداء مهمتها ، المرأة مساوية للرجل وأية نظرةٍ أخرى نظرة جاهلية الإسلام منها بريء
""";
// page 3
  static const String ayahHadithSixteenThree_1 = """
يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ يَسْعَىٰ نُورُهُم بَيْنَ أَيْدِيهِمْ
""";
  static const String elmTextDersSixteenThree_1 = """
لو ذكر الله تعالى المؤمنين فقط لفُهم معها والمؤمنات !  ولكن الله تعالى أراد أن يذكر المؤمنين والمؤمنات ليُبين أن المرأة كالرجل تماماً من حيث التكليف والتشريف والمسؤلية ، فهي ترقى كما يرقى الرجل ، وتؤمن كما يؤمن ، وتحب الله كما يحب ، ويتفضل الله عليها كما يتفضل على الرجل ، ولها عند الله مقام علي كما للرجل ، وكلما اقترب الإنسان من كتاب الله شعر أن المرأة صنوُ الرجل ، فالنساء شقائق الرجال ، تؤمن وترقى بإيمانها ، لذا كان عليه الصلاة والسلام إذا قدمت عليه فاطمة وقف لها ! والمرأة يمكن أن تصل إلى أعلى الدرجات وأقصى الغايات إذا عرفت ربها وأطاعته 
   لذا الله تعالى قال 

""";
  static const String ayahHadithSixteenThree_2 = """
يَوْمَ تَرَى الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ    

وقال تعالى 
 رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ
 رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ
  فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لَا أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَىٰ ۖ
  
""";
// page 4
  static const String elmTextDersSixteenFour_1 = """
فالمساواة الحقيقيه بين المرأة والرجل إنما هي في التكليف والتشريف والمسؤلية ، ولكنها ليست كالرجل في بنيتها الفيزيولوجية والنفسية والاجتماعية ، وإن كل خصائصها كمال فيها ، وكُل خصائص الرجُل كمال فيه ، وهما متكاملان  
فقد جعل الله كل منهما سكناً للآخر وهذه حكمة الله أما إذا غيرنا خلق الله عز وجل ، ودفعنا المرأة إلى التشبه بالرجال فإننا نكون بذلك قد شوهنا أنوثتها
قال تعالى 
""";
  static const String ayahHadithSixteenFour_1 = """

إِنَّ الْمُسْلِمِينَ وَالْمُسْلِمَاتِ وَالْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَالْقَانِتِينَ وَالْقَانِتَاتِ وَالصَّادِقِينَ وَالصَّادِقَاتِ وَالصَّابِرِينَ وَالصَّابِرَاتِ وَالْخَاشِعِينَ وَالْخَاشِعَاتِ وَالْمُتَصَدِّقِينَ وَالْمُتَصَدِّقَاتِ وَالصَّائِمِينَ وَالصَّائِمَاتِ وَالْحَافِظِينَ فُرُوجَهُمْ وَالْحَافِظَاتِ وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا
 """;
  // page 5
  static const String elmTextDersSixteenFive_1 = """

لو أن الله سبحانه وتعالى قال 
 إن المسلمين ، والمؤمنين ، والقانتين ، والصادقين ، والصابرين ، والخاشعين والمتصدقين ، والصائمين ، والحافظين فروجهم ، والذاكرين الله كثيراً أعد الله لهم مغفرة وأجراً عظيما

لو أنه ألغى الأسماء المؤنثه فما الذي يحصل؟ المعنى يبقى شاملاً الذكور والإناث على التغليب لإن الفاظ التذكير تشمل الفاظ التأنيث على سبيل التغليب ، وهذه قاعدة معروفة في اللغة
إذاً ما الحكمة من التفصيل بالتذكير والتأنيث أراد الله عز وجل بهذه الآية أن يؤكد على أن المرأة كالرجل تماماً في التكليف وفي التشريف ، مكلفة بالإسلام ، وبالايمان ، وبالقنوت ، وبالصبر ، والخشوع ، والصدقة ، والصوم ، وحفظ الفرج ، وذكر الله ، كالرجل تماماً ، وهذا يؤكده أيات أخرى
 يقول الله عز وجل
""";
  static const String ayahHadithSixteenFive_1 = """

مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ 
[النحل: 97]
""";
// page 6
  static const String elmTextDersSixteenSix_1 = """
ولو أن الله عز وجل قال: من عمل صالحاً وهو مؤمن ، فهو بهذا يعني من ذكر أو انثى ، فماذا جاء ب( من ) البيانية ، من ذكر أو أنثى ليؤكد لنا أن الذكر كالأنثى ، أو ان الأنثى كالذكر ، مكلفة ومشرفة ، بل إن الأنثى المؤمنة لها مكانة عند الله تزيد على ألف رجل ، أو عن مئة الف رجل عاص ، لكن هُناك تنبيه مهم : وليس الذكر كالأنثى
يقول الله سبحانه وتعالى في آية كريمة أخرى

""";
  static const String ayahHadithSixteenSix_1 = """
 وَلَيْسَ الذَّكَرُ كَالْأُنْثَى
  [آل عمران: 36]
""";
// page 7
  static const String elmTextDersSixteenSeven_1 = """

تعني أن للمرأة خصائص ؛ في عقلها ، وفي نفسها ، وفي بُنيتها الإجتماعيه ، وفي قوامها ، وفي بُنيتها العضوية والفسيولوجية تميزها عن الرجل ، وأن للرجُل عقلية ، ونفسية ، وبنية اجتماعية ، وخصائص فسيولوجية تميزه عن المرأة ، وهذا معنى قوله تعالى  
  """;
  static const String ayahHadithSixteenSeven_1 = """

 وَلَيْسَ الذَّكَرُ كَالْأُنْثَى
""";

  static const String elmTextDersSixteenSeven_2 = """

وما في الأرض من فساد اجتماعي إلا بسبب أن نضع الرجل مكان المرأة ، وأن نضع المرأة مكان الرجل 
 لذلك
 """;
  static const String ayahHadithSixteenSeven_2 = """
لَعنَ رسُولُ اللَّهِ ﷺ المُتَشبِّهين مِن الرِّجالِ بِالنساءِ، والمُتَشبِّهَات مِن النِّسَاءِ بِالرِّجالِ
 رواه البخاري

""";
// page 8
  static const String subtitleSixteenEight_1 = """
الرجال قوامون على النساء 
-------------------
""";
  static const String elmTextDersSixteenEight_1 = """
هذه المؤسسة التي هي الأسرة فيها مساواة ك
املة بين أفرادها ، وفيها حب وتقدير وكرامة ، لكن هذه المؤسسة تحتاج إلى قائد ، وصاحب قرار ، وتحتاج لإنسان واسع الأفق ، حريص على هذه المؤسسة ، أن يقول في الوقت المناسب لا ، وأمره نافذ ، فالله سبحانه وتعالى بحكمته هيأ الزوج بقدراته العقلية وصفاته النفسية وخصائصه الأجتماعية والجسدية ، وبما أنفق من ماله أن يكون صاحب القرار ، وقواماً على هذه الأسرة  
شائت إرادة الله في نظام الزوجية أن يكون الرجل صاحب القرار ، لأن الله هيئه فكرياً وجسمياً واجتماعياً ، ونفسياً ليكون قائد هذه الأسرة ، وشائت إرادة الله أيظاً أن تكون المرأة تابعة للرجل في العلاقة الزوجية والأسرة ، لما هيأه الله به من خصائص فكرية ، واجتماعية ، ونفسية ، وجسمية ، هذا هو التصميم الألهي  
""";
// page 9
  static const String ayahHadithSixteenNine_1 = """

   ( الرجال قوامون على النساء )
""";
  static const String elmTextDersSixteenNine_1 = """

القرآن الكريم رسم أدوار للذكر والأنثى حينما نحترمها نقطف ثماراً يانعه

لكن المشكلة أن الإسلام منهج كامل ، فإذا أردنا أن نأخذ من الإسلام بعض بنوده ، ومن الحياة المعاصرة التي لا ينتظم الإسلام دقائقها بعض البنود نقع في إشكال ، فالتي تعمل ، وتأتي إلى البيت الساعة الثانية منهكة القوى ، أعصابها متوترة ، تعاني مايعاني الرجل من مشكلات في العمل ، ومن منافسة ، ومن قضايا تحتاج إلى معالجة ، ومن تجبر بعض الأشخاص ، وغير ذلك ... فتأتي إلى البيت منهكة متعبة ، وعليها أن تطبخ أيظاً ، وعليها أن تربي ، فأعصابها متوترة دائماً ، لم تعد سكناً له ، الآن الدخل من يأخذه ، هو أم هي؟ 
تقول له :  هذا لي ، وهو لها ، لكن لم يأخذ منها كل اهتمامها ، أربعة أخماس اهتمامها لعملها ، فهناك تداخل ، الحياة المعاصرة فيها تداخل ، لو أن النساء كن متفرغات لأزواجهن ، متفرغات لتربية الأولاد ، حينما تدفع المرأة بإبن إلى المجتمع صحيحة عقيدته ، صحيح جسمه ، سليمة أخلاقه ، إنها تقدم أكبر خدمة للمجتمع ، بل إن أرقى مرتبة تكتب على بطاقة المرأة في بعض البلاد ، أرقى رتبة تكتب على بطاقة المرأة سيدة منزل ، إنها متفرغة لتربية أولادها ، هذا الطفل سيغدو عالماً ، سيغدو قائداً ، سيغدو باحثاً ، سيغدو مصلحاً ، من يربيه في البيت ، أيعقل أن يُترك للطريق ؟ لأصدقاء السوء ؟ 
لخادمة لا تفقه في التربية شيئاً ؟ لذلك حينما تتفرغ المرأة لتربية أولادها تكون قد حققت الهدف الذي من أجله خلقت ، يفهم كثير من الناس أن جلوس المرأة في البيت يعني أنها جاهلة ، لا ، قد تكون الزوجة في أعلى مستوى ثقافي ، وقد تكون في أعلى درجات الإيمان ، لكنها متفرغة لزوجها وأولادها لذلك الإبن يتعلم من أمه كل شيئ ، لذلك هناك أدوار رسمها القرآن الكريم ، حينما نحترمها نقطف ثماراً يانعة ، أما حينما لا نحترمها ، ونريد أن تنافس المرأة الرجل في كل شيئ تفقد شيئين ؛ تفقد السباق ، وتفقد أنوثتها
""";
// page 10
  static const String subtitleSixteenTen_1 = """
المرأه الصالحة هي حسنة الدنيا  
-----------------------
 """;
  static const String ayahHadithSixteenTen_1 = """
فَالصَّالِحَاتُ قَانِتَاتٌ حَافِظَاتٌ لِّلْغَيْبِ بِمَا حَفِظَ اللَّهُ ۚ
""";
  static const String elmTextDersSixteenTen_1 = """

أي ملتفتات إلى الله ، منقطعات لله عز وجل  
كانت الصحابية الجليلة تقف على باب البيت قبل أن تودع زوجها ، تقول له : اتق الله فينا ، نصبر على الجوع ولا نصبر على الحرام
كم من زوجة الآن تضغط على زوجها إلى أن تحمله على كسب المال الحرام ، إلى أن تحمله على أن يرتشي من أجل أن يلبي غرورها ، وكم من امرأة تهمل زوجها ، وتجلس عند بناتها أسابيع وأسابيع ، ولا تعبأ بزوجها ، ولا بطعامه ، ولا بشرابه ، ولا براحته ، هناك تقصير كبير
هذا الفساد الذي نراه من تطلع الأزواج إلى غير زوجاتهم هو بسبب تقصير الزوجات ، وهذا الفساد الذي نراه من تفلت الزوجات بسبب تقصير الأزواج ، لو أن الزوج عرف مهمته ، وعرفت مهمتها ، وتعاونا على تأسيس عش مسلم ينتج عناصر مؤمنه للمجتمع لكنا في حال غير هذا الحال
""";
// page 11
  static const String subtitleSixteenEleven_1 = """
المرأة نصف المجتمع البشري  
--------------------------
""";
  static const String elmTextDersSixteenEleven_1 = """
فلذلك هذه التي لها دور خطير خطير في المجتمع البشري
أولاً : من حيث الحجم نصف البشر من النساء ، نصف المجتمع
ثانياً : ليس نصفاً فقط عددياً ، بل نصفاً مكملاً للنصف الأول
لا تقوم حياة النصف الأول إلا بالتعاون مع النصف الثاني ، وطبيعة المرأة محببة للرجال هكذا قال الله عز وجل
""";
  static const String ayahHadithSixteenEleven_1 = """

زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوَاتِ مِنَ النِّسَاءِ 

""";
// page 12
  static const String subtitleSixteenTwelve_1 = """
المرأة صُممت لتكون أماً  
------------------
""";
  static const String elmTextDersSixteenTwelve_1 = """
حينما صُممت المرأة صُممت لتكون أماً تربي أولادها ، وليس في حياة الأولاد شيئ يفوق عظمة الأم ، في حياتهم طبعاً ، قلب الأم لا يوصف ، هي إنسان تعيش لغيرها ، إنها الأم ، تعيش لأولادها ؛ تشقى ليسعدوا ، تجوع ليشبعوا ، تخاف ليطمئنوا ، تموت ليحيوا ، هي الأم ، حينما صُممت المرأة صُممت لتكون أماً ، أو لتكون زوجة تملأ قلب زوجها سعادة ، تملأ البيت جمالاً ، ورقة ، وتألقاً بخدمتها لزوجها ولأولادها

الأصل بقاء المرأة في بيتها
فالأصل في المرأة أن تكون في بيتها ، هذا هو الأصل ، المرأة اللتي تهز سرير ابنها بيمناها تهز العالم بيسراها ، لأنه كلما كانت اللبنة الأولى ، وهي الأسرة ؛ صحية متوازنة ، منتظمة ، مستقيمة كان الإنتاج خارج البيت مُضاعفاً ، فنجاح ألرجل في عمله أساسه نجاحه في بيته  إنتاج ألرجل أساسه راحة قلبه من طرف بيته ، لذلك حينما أمر الله سبحانه وتعالى الإناث ، أو نساء النبي خاصة ، والنساء عامة أن يقررن في بيوتهن ، فلأن البيت هو مكان تربية الأولاد ، هو مكان العناية باللبنة الأولى ألا وهي الأسرة 
""";
// page 13
  static const String ayahHadithSixteenTherteen_1 = """

وَقَرْنَ فِي بُيُوتِكُنَّ 
""";
  static const String elmTextDersSixteenTherteen_1 = """

ولا تعني الآيه أنها ممنوعة من الخروج ، لكن تخرج للضرورة 
""";
  static const String ayahHadithSixteenTherteen_2 = """

 قَالَ مَا خَطْبُكُمَا قَالَتَا لَا نَسْقِي حَتَّى يُصْدِرَ الرِّعَاءُ وَأَبُونَا شَيْخٌ كَبِيرٌ﴾ [القصص: 23]
""";
  static const String elmTextDersSixteenTherteen_2 = """

أستنبط العلماء من هذا : أن المرأة لا يصح أن تخالط الرجال ، ولا أن تزاحمهم ، بل عليها أن تقف بعيداً عنهم ، وعليها ايظاً ألا تخرج من بيتها لقضاء حوائج المنزل ، إذا كان أبوها أو أخوها ، أو زوجها رجلاً قوياً قادراً على كفايتها ، أما إذا كان مريضاً فلها العُذر 
""";
// page 14
  static const String ayahHadithSixteenFourteen_1 = """
  ( وأبونا شيخ كبير ) 
""";
  static const String elmTextDersSixteenFourteen_1 = """

فلو أن امرأة مات زوجها ، وأولادها صغار ، واضطرت إلى أن تخرج من بيتها لشراء حوائجها فمعها العذر الكافي ، ولكن امرأة لها زوج في البيت ، وتخرج هي لتشتري اللحم والفاكهة والحاجات ، وزوجها أو أخوها أو ابنها في البيت ، فهذا ليس من أخلاق المسلمين
""";
// page 15
  static const String subtitleSixteenFifteen_1 = """

من ضوابط خروج المرأة 
-------------- 
""";
  static const String ayahHadithSixteenFifteen_1 = """
َ وَلَا تَبَرَّجْنَ تَبَرُّجَ الْجَاهِلِيَّةِ الْأُولَى

""";
  static const String elmTextDersSixteenFifteen_1 = """
بالمعنى الدقيق : ولا تُظهرن مفاتنكن ، أي أن الله سبحانه وتعالى أكرم المرأة فاسبغ عليها شيئاً من الجمال ، بعض الجمال ، أو أكثر الجمال ، هذا الجمال حينما أسبغه الله عليها جعله سبباً لسعادة زوجها بها ، جعل هذا الجمال ليسكُن زوجها إليها ، فإذا استخدم هذا الجمال لغير ماخلق له ، لغير زوجها ، للأجانب ، لمن في الطريق فقد أضلت المسعى ، فالله سبحانه وتعالى أراد أن تكون هذه المرأة شيئاً مصوناً ، بعيداً عن وحول الطريق بعيداً عما تقع عليه العيون ، فحينما سمح لها أن تخرج ، أمرها أو نهاها عن أن تتبرج ، والتبرج إظهار مايجب إخفاؤه عن الأجانب ، إظهار مايجب إخفاؤه في الطريق
""";
// page 16
  static const String subtitleSixteenSixteen_1 = """

المرأة نقطة ضعف الرجل  
------------------
""";
  static const String elmTextDersSixteenSixteen_1 = """
إذا خرجت المرأة سافرة ، فاتنة ، تعرض ما أودع الله فيها من مفاتن لترضي زوجها أصلاً ، وتكون مسعدة له ، إذا أظهرت هذه المفاتن للناس جميعاً ، اشتعلت الفتن واستعرت ، وضاع المجتمع ، وانحرف الشباب ، وتحسر الرجال ، ودُمر المجتمع ، فلذلك موضوع المرأة موضوع خطير خطير ، إذاً المأخذ الأشد على دين الإنسان ، أو المأخذ الأكبر أهمية على دين الإنسان موضوع المرأة ، يكفي أن يطلق الإنسان بصره فيما حرم الله عليه ، أين صلاته؟ صار الطريق إلى الله غير سالك ، يكفي أن يستمتع بامرأة لا تحل له ؛ إن بالنظر ، أو بالكلام ، أو بما شاكل ذلك ، صار الطريق إلى الله غير سالك
""";
// page 17
  static const String ayahHadithSixteenSeventeen_1 = """

يَا أَيُّهَا النَّبِيُّ قُلْ لِأَزْوَاجِكَ وَبَنَاتِكَ وَنِسَاءِ الْمُؤْمِنِينَ يُدْنِينَ عَلَيْهِنَّ مِنْ جَلَابِيبِهِنَّ 

""";

  static const String elmTextDersSixteenSeventeen_1 = """
الحقيقة قد يكون إيمان الرجل في قلبه ، لكن المرأة إيمانها ظاهر وباطن معاً ، إيمانها في حجابها ، فإذا برزت للرجال من دون حرج ، واختلطت مع الرجال فكأنها تتخلى عن هويتها ، وكأنها تتخلى عن شخصيتها المسلمة ، وكأنها تُعلن أنها لا تأتمر بأمر الله
القرآن الكريم أمر بستر العورات ، ثم أمر بالحجاب ، ثم أمر بغض البصر ، وعدم إبداء الزينة إلا لرجال جاء ذكرهم في سورة النور ، الأمر بستر العورات أولاً ، ثم الأمر بحجاب النساء المؤمنات ثانياً ثم الأمر بغض البصر وعدم إبداء الزينة للأجانب ثالثاً ، فكأن هذه الآية جاءت في الوسط ، وكأن الله سبحانه وتعالى درج أحكام الحجاب بحسب الظروف وبحسب تطور الدعوة الإسلامية
الملاحظه الدقيقه أن المرأة التي تترك الحجاب إنكاراً له ، إنكاراً لفرضيته فقد كفرت ، وإذا تركته تقليداً للأجانب فقد فسقت وعصت ، لكن المرأة المؤمنة تعتقد بوجوبه وتلتزمه ، إذا ترك الحجاب إنكاراً لفرضيته فهذا كفر ، وإذا ترك الحجاب تقليداً للأجانب فهذا فسق وفجور ، أما حينما تطبق المرأة أمر الله عز وجل وتحتجب فهذا هو الحد الأدنى في إيمانها
""";

// page 18
  static const String titleSixteenEighteen_1 = """
  وقفة
  ---
  """;

  static const String ayahHadithSixteenEighteen_1 = """
 فلا تخضعن بالقول فيطمع اللذي في قلبه مرض 

""";

  static const String subtitleSixteenEighteen_1 = """
جنس المرأة محبب للرجال
  """;

  static const String elmTextDersSixteenEighteen_1 = """
جنس المرأة محبب للرجال ، مهما علا مقامها ، وهذه التي علا مقامها ينبغي أن تزيد في ورعها ، وفي حجابها ، وفي تحصنها ، لئلا تسمع كلاماً لا يليقُ بها
""";

// page 19
  static const String subtitleSixteenNinteen_1 = """
 معنى الخضوع بالقول 
""";
  static const String elmTextDersSixteenNinteen_1 = """
خضوع القول ، لين القول ، تكسُر القول ، المرأة إذا تكلمت إما أن تتكلم قولاً معروفاً ، وإما أن تلين كلامها ، وأن تكسرهُ حتى يطمع فيها الآخرون ، وما من مشكلة أصابت امرأة عفيفة طاهرة إلا بسبب أنها خضعت في القول ، خضوع المرأة في القول مجلبة لطمع الرجال بها ، هذه قاعدة
بعض النساء الجاهلات تقول للبائع : راعنا ، نحن جيرانك ، قلبك قاس علينا ..

 """;

  // page 20
  static const String titleSixteenTwenty = """
وقفة
----
""";

  static const String elmTextDersSixteenTwenty_1 = """
قد يقول قائل يا أخي هذه الآية ليست للنساء عامة ، بل هذه لنساء النبي فقط
نقول له: إذا وجه الأمر إلى نساء النبي وهن في أكمل حال ، وهن نساء النبي ، وهن العفيفات المُحصنات الطاهرات التائبات العابدات السائحات ، فمن باب أولى أن يوجه الأمر بالتبعية إلى نساء المؤمنين
هناك قاعدة أصولية هذه القاعدة الأصولية عبر عنها العلماء بكلمة من باب أولى
""";

// page 21
  static const String titleSixteenTwentyOne = """
  وففة 2
  ------
  """;

  static const String ayahHadithSixteenTwentyOne_1 = """
 ( وقرن في بيوتكن ) 
""";
  static const String elmTextDersSixteenTwentyOne_2 = """
فلأن يكون هذا الأمر موجهاً إلى عامة النساء من باب أولى
""";

// page 22
  static const String titleSixteenTwentyTwo = """
  3 وقفة
  ---
  """;
  static const String subtitleSixteenTwentyTwo_1 = """
( فجائته إحداهما تمشي على استحياء ) 
""";
  static const String elmTextDersSixteenTwentyTwo_1 = """
اجمل مافي المرأة حياؤها ، وحينما تفقد حياؤها تفقد أنوثتها ، وتصبح مسترجلة ، علامة عفة المرأة حياؤها
""";
  static const String ayahHadithSixteenTwentyTwo_1 = """
( قالت ان ابي يدعوك ليجزيك أجر ماسقيت لنا ) 
""";
  static const String elmTextDersSixteenTwentyTwo_2 = """
خاطبته في أبلغ قول ، بكلام لا زيادة فيه ، لا يحتمل جواباً
لا حاجة بعد الجواب أبداً ، انتهى الأمر ، 
كلام لا جواب له ، لا زيادة ، ولا تكسر ، ولا استعطاف ، ولا لين في الكلام ، 
لا يحق لامرأة أن تكون في كلامها لينة إلا مع محارمها ، لأن لين كلام المرأة يدعو إلى الشك في أخلاقها ، تخاطب بائعاً فتقول له : نحن جيرانك ، نحن كذا وكذا ، هذا هو الفسقُ بعينه ، إذا اضطرت المرأة أن تخاطب أجنبياً فيجب أن تخاطبه بأوجز كلام ، وبأدق عبارة ، بكلام لا يُشم منه رائحة إطلاقاً
""";

// page 23
  static const String titleSixteentTwentyThree = """
 وقفة 4
 ------ 
  """;
  static const String ayahHadithSixteenTwentyThree_1 = """
( والمؤمنون والمؤمنات بعضهم أولياء بعض )
""";
  static const String elmTextDersSixteenTwentyThree_1 = """
المؤمنون والمؤمنات بالله ورسوله بعضهم أنصار بعض ، يأمرون الناس بالإيمان والعمل الصالح ، وينهونهم عن الكفر والمعاصي ، ويؤدون الصلاة ، ويعطون الزكاة ، ويطيعون الله ورسوله ، وينتهون عما نهوا عنه
مجتمع التناصح ، مجتمع التعاون ، مجتمع التناصر ، مجتمع التواضع ، والحقيقة المؤلمة أن الطرف الآخر الغرب لا يقنع بهذا الدين من خلال الكتب والمحاضرات ، يقنع بهذا الدين من خلال مجتمع إسلامي يطبق هذا الدين
كما قيل : القرآن كون ناطق ، والكون قرآن صامت ، والنبي قرآن يمشي ، والآن الذي يؤثر في الناس أن يرو بأم أعينهم إنساناً مسلماً صادقاً أميناً
""";

// page 24
  static const String titleSixteentTwentyFour = """
 وقفة 5
 ------ 
  """;
  static const String subtitleSixteentTwentyFour_1 = """
  الأدلة على مساواة المرأة للرجل في التشريف والتكريم
""";
  static const String elmTextDersSixteenTwentyFour_1 = """
الآية الأولى  
""";
  static const String ayahHadithSixteenTwentyFour_1 = """
( فاستجاب لهم ربهم اني لا أضيع عمل عامل منكم من ذكر أو أنثى بعضكم من بعض ) 
""";
  static const String elmTextDersSixteenTwentyFour_2 = """
الآية الثانية  
""";
  static const String ayahHadithSixteenTwentyFour_2 = """
( من عمل صالحاً من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة ) 
""";

// paage 25
  static const String subtitleSixteentTwentyFive_1 = """
المرأة الصالحة افضل من الف رجل عاص
""";
  static const String elmTextDersSixteenTwentyFive_1 = """
المرأة مساوية تماماً للرجل من حيث التكليف ، ولكن إذا وضعت امرأة مؤمنة مطيعة لله ورسوله وزوجها ، في كفة ، ووضع مئة الف رجل عاص لله عزوجل في كفة ، هذه المرأة هي عند الله وعند الناس أرجح من كل هؤلاء الرجال
والله أن كل امرأة صالحة وهبت حياتها لزوجها وأولادها ، وكانت قدوة لبناتها ، وكانت رحمة مهداة لأسرتها ، تفضل عندالله مائة ألف ألف رجل تائه شارد ضال مُضل
""";

  static const String subtitleSixteentTwentyFive_2 = """
دور المرأة من خلال السُنة النبوية المطهرة  
""";
  static const String elmTextDersSixteenTwentyFive_2 = """
الحديث الأول  
""";
  static const String ayahHadithSixteenTwentyFive_1 = """
 إذا صلت المرأة خمسها ، وصامت شهرها ، وحفظت فرجها ، وأطاعت زوجها قيل لها : ادخلي الجنة من أي أبواب الجنة شئت 
""";
  static const String elmTextDersSixteenTwentyFive_3 = """
الحديث الثاني  
""";
  static const String ayahHadithSixteenTwentyFive_2 = """
 لو كنت آمراً أحداً أن يسجد لأمرت المرأة أن تسجد لزوجها 
""";

// page 26
  static const String elmTextDersSixteenTwentySix_1 = """
الحديث الثالث  
""";
  static const String ayahHadithSixteenTwentySix_1 = """
 أيما امرأة قعدت على بيت أولادها فهي معي في الجنة 
""";
  static const String elmTextDersSixteenTwentySix_2 = """
الحديث الرابع  
""";
  static const String ayahHadithSixteenTwentySix_2 = """
 أول من يمسك بحلق الجنة أنا _ أي أول إنسان يمسك حلقة باب الجنة ليدخل هو رسول الله صلى الله عليه وسلم _ أول من يمسك بحلق الجنة أنا فإذا امرأة تُنازعني تريد أن تدخل الجنة قبلي _ غير معقول ، من هذه المرأة _ قلت: ياجبريل من هذه المرأة ؟ قال: يارسول الله هي امرأة مات زوجها وترك لها أولاداً فأبت أن تتزوج من أجلهم  
""";
  static const String elmTextDersSixteenTwentySix_3 = """
الحديث الخامس
""";
  static const String elmTextDersSixteenTwentySix_4 = """
 وحينما جائت امرأة إلى النبي عليه الصلاة والسلام ، قالت: يارسول الله ذهب الرجال بكل شيئ ، الجهاد لهم ، والاستشهاد لهم ، والجنة لهم ، ماذا بقي لنا نحن ؟ أجاب النبي إجابة شافية
""";
  static const String ayahHadithSixteenTwentySix_3 = """
قال رسول الله صلى الله عليه وسلم *
 انصرفي أيتها المرأة وأعلمي من وراءك من النساء أن حسن تبعل إحداكن لزوجها وطلبها مرضاته واتباعها موافقته يعدل ذلك كله _ يعدل الجهاد في سبيل الله _  

""";
// page 27
  static const String titelSixteenTwentySeven = """
النساء قاعدة البُنيان 
--------------
  """;
  static const String elmTextDersSixteenTwentySeven_1 = """
لو تصورنا رجلاً يريد ان يبني برجاً عالياً ، ولو أفترضنا أن هذا البُرج على شارع رئيسي ، لايُتصور أبداً أن يقف احد بسيارته لكي ينظُر إلى المهندسين وهم يعملون تحت في الأساس ، يظل هؤلا المهندسين يعملون ولا يشعر بهم أحداً ، بعد الإنتهاء من بناء البرج ترى الناس يقفون وينضرون لإرتفاعه الشاهق وتصميمه ،
متى يُذكر هذا المؤسس ؟ عندما تحصُل مصيبة ، ووقع البرج ، يقول لك أين الذي بنى الأساس ، لذلك فالمرأه دورها غير مرئي مثل المهندسين اللذين يصممون الأساس ، مهمتها أساس التربية ، وتربية العقيدة ، فما صلح بيت إلا فيه امرأة صالحة ، وما فسد بيت إلا وفيه امرأة فاسدة ، وإن كان رب البيت نبي

 """;
  static const String footerSixteenTwentySix = """
----------
* 
""";
}
