class ElmTextDersEighteen {
  //---- page 1
  static const String titleEighteenOne = """
ماقدرو الله حق قدره إن الله لقوي عزيز 
""";
  static const String elmTextEighteenOne_1 = """
الله سبحانه وتعالى هو العزيز ، القاهر الذي لا يُغلب ولا يُقهر ، المنيع الذي لا يرام جنابه ، فلا ينال جنابه لعزته وعظمته ، وجبروته وكبريائه ، العزيز الذي لا مثل له ولا نظير ، الغالب الذي لايعجزه شيئ ، القوي القاهر الذي لا يقف له شيئ 
وهو سبحانه العزيز الذي له العزة كلها  
عزة القوة .. وعزة الغلبة .. وعزة الامتناع 

""";
// page 2
  static const String ayahHadithEighteenTwo_1 = """
ولايحزنك قولهم إن العزة لله جميعا هو السميع العليم 
  """;

  static const String elmTextEighteenTwo_1 = """
الله جل جلاله هو العزيز ، وله العزة جميعا ، فنواصي العباد بيده ، ومشيئته نافذة فيهم ، وهو القاهر لهم على ما أراد 
فمن اراد العز في الدنيا والآخره فليطلبه من رب العزة تبارك وتعالى مالك الدنيا والآخرة ، وذلك يحصل بكمال الإيمان والتقوى ، ولزوم طاعة الله عز وجل 
""";

  static const String ayahHadithEighteenTwo_2 = """
 من كان يريد العزة فلله العزة جميعا إليه يصعد الكلم الطيب والعمل الصالح يرفعه 
""";

  static const String elmTextEighteenTwo_2 = """
ومع عظم الطاعة وحسنها وكمالها ودوامها تزداد العزة

""";
// page 3
  static const String elmTextEighteenThree_1 = """
ملايين الأموال أُنفقت لمحاربة الدين والإسلام بطرق وأساليب مختلفة منها عبر المسلسلات التي تعبث بعقول الناس وتحاول إضهار صورة المتدين بصورة بشعة بوحشية وقسوه وعدم رفق مع الآخر لأجل تشويه الإسلام ومحاربته 

جائت لقطة القطه بدقيقة وانتشرت ليراها أكثر من مليار وستميةمليون خلال ٢٤ ساعة لمشهد عفوي بسيط نسفت كل مكايد الأعداء واضهرت الوجه الحقيقي للمسلم
""";

  static const String ayahHadithEighteenThree_1 = """
 بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون
 
  صدق الله العظيم القائل ايضا 
  
 إن الذين كفرو ينفقون اموالهم ليصدوا عن سبيل الله فسينفقونها ثم تكون عليهم حسره ثم يغلبون

 """;

  // page 4
  static const String ayahHadithEighteenFour_1 = """
ولما بلغ أشده اتيناه حكما وعلما وكذلك نجزي المحسنين  
""";

  static const String elmTextEighteenFour_1 = """
هكذا نجزيهم على مر الايام ، على مر العصور ، في كل الأقاليم ، في كل البلاد ، في البلاد المتقدمه والبلاد المتخلفه ، وفي شرق الأرض وفي غربها ، في شمالها وفي جنوبها على البر وفي البحر وفي الجو 
""";
  static const String ayahHadithEighteenFour_2 = """
إن الذين امنو وعملو الصالحات سيجعل لهم الرحمن ودا 
""";

  // page 5
  static const String elmTextEighteenFive_1 = """
هذه بشرى للمؤنين الباب مفتوح والطريق اليه سالك ، والاله موجود ، والله هو هو ومعاملته هي هي ، وقوانينه هي هي لاتتبدل ولا تتغير ، ولا تُعدل ولا تُجمد ، ولاتوقف ، ولا يُضاف عليها ، ولا يُحذف منها لذلك ابشر 
كن له كما يُريد يكُن لك كما تريد ، سلم له فيما يريد يجعل حياتك كما تريد

  """;

//-- page 6
  static const String ayahHadithEighteenSix_1 = """
من عمل صالحآ من ذكر او أنثى وهو مؤمن فلنحيينه حياة طيبه 
""";
  static const String elmTextEighteenSix_1 = """
الحياة الطيبه لاتعني انه غني ، تعني انه موصول بالله ، تعني انه متوكل على الله ، تعني انه يحب الله ، تعني انه خاضع لمنهج الله ، تعني انه يتأمل بحياة سعيده ، قادمه بعد الموت ، هذه حاله دقيقه جدآ

""";

// page 7
  static const String elmTextEighteenSeven_1 = """
علاقة الرجل بالمرآه في منهج الله عز وجل علاقه مستمره ، ليس هناك  علاقه طارئه أبدآ
العلاقه الطارئه ليست من منهج الله عز وجل
هذه المرأه ربطت مصيرها مع زوجها
هي زوجته ، وأم اولاده ، تكبر معه ، تتقاسم معه مافي حياته من حلو ومر ، وفي كل مرحله لها جمالها ، ولها مكانتها ، ولها قيمتها ، ولو عرضت على أية امرأه في الأرض الزواج أو ان تكون متعه رخيصه لا ترضى إلا الزواج
  """;

  // page 8
  static const String elmTextEighteenEight_1 = """
ولكن للجهل اللذي يهيمن على فتيات المسلمين غير اللذين عرفوا بناتهم بمنهج الله عز وجل قد يؤثرن التفلت وقد يؤثرن الخروج ، قد يؤثرن علاقات لاترضي الله عز وجل ، هذا كله من الجهل ومن التغذيه غير الإسلاميه اللتي تتغذى بها البنات كل يوم إلى منتصف الليل
هذه التغذيه في مجموعها تهيئ تصورات للفتاه تجعلها تتفلت من منهج الله
""";

// page 9
  static const String titleEighteenNine_1 = """
إيثار الدنيا على الآخرة سبب تفتت وتفرق المسلمين 
""";

  static const String ayahHadithEighteenNine_1 = """
وماتفرقو إلا من بعد ماجائهم العلم بغياً بينهم 

        ( بغياً بينهم ) 
""";

  static const String elmTextEighteenNine_1 = """
أي تفرقو بسبب البغي أي الحسد وطلب المكاسب الدنيوية ، إذاً الحق يجمع والباطل يفرق ، والآخرة تجمع والدنيا تفرق ، والقيم تجمع والحاجات تفرق ، فإذا اردنا أن نجتمع فلنطلب الدار الآخرة ، وإذا اردنا ان نجتمع فليكن الحق إمامنا ، أما إذا اردنا الدنيا نتنافس ، ونختلف ، ويطعن بعضنا ببعض ، ونتراشق التُهم  
وإذا اردنا أن نجتمع فيجب علينا أن تتحد أهدافنا ووسائلنا ، أما إذا تفرقنا ، فكل إنسان طلب مصالح شخصية ، ولو كان الإطار حقاً والغلاف حقاً ، وهذا ما يؤدي إلى تفكيك الأمة 
""";
// page 10
  static const String elmTextEighteenTen_1 = """
والإنسان بقدر إخلاصه إنه يُرجح مصالح المسلمين العامة على مصلحته الخاصة ، وكلما ضعف إخلاصه رجح مصلحته الخاصة على مصالح المسلمين 
ولذلك فنحن الآن بحاجة إلى أن نتعاون ، وأن نتكاتف ، أن يعذر بعضنا بعضاً ، وأن نتعاون فيما أتفقنا ، وأن يعذر بعضنا بعضاً فيما اختلفنا ، نحتاج أن نحترم جميع الدعاة ، وجميع العلماء من دون أن ننتقص منهم ، وألا نجعل من مجالسنا نهشاً لأعراضهم ومكانتهم فليس هذا في صالح المؤمنين إطلاقاً
  
  """;

// page 11
// 1
  static const String titleEighteenEleven_1 = """
ذاهب إلى ربي
-----------
 """;
  static const String elmEighteenEleven_1 = """
سيدنا ابراهيم قال
  """;
  static const String ayahHadithEighteenEleven_1 = """
        إني ذاهب إلى ربي سيهدين 
  """;
  // 2
  static const String elmEighteenEleven_2 = """
العلماء قالوا: إنه إن أيقن بالموت فذهابه إلى الله عز وجل يعني أنه ملاق الله عز وجل، وسيهديني إلى الجنة، وإن خاف قومه، وتوجه بعيداً عنهم 
""";

  static const String ayahHadithEighteenEleven_2 = """
        إني ذاهبٌ إلى ربي 
 """;
  // 3
  static const String elmEighteenEleven_3 = """
لينجيني من مكرهم، وبأسهم، وكيدهم
""";
  static const String ayahHadithEighteenEleven_3 = """
        إني ذاهب إلى ربي سيهدين 
 """;
// 4
  static const String elmEighteenEleven_4 = """
لكن هذه كيف تقع معنا؟ كيف يقول أحدنا: إني ذاهبٌ إلى ربي؟ أي إذا توجه أحدنا إلى بيتٍ من بيوت الله ليصلي، توجه ليحضر مجلس علم، توجه إلى الفلاة ليناجي ربه، توجه إلى غرفة قصية في البيت ليصلي قيام الليل، إن توجه إلى غرفة قصية في البيت ذهب إلى ربه، وإن توجه إلى فلاةٍ ليناجي ربه وليذكره ذهب إلى ربه، وإذا توجه إلى بيت من بيوت الله لا يقصد منفعة، ولا دنيا، ولا حل مشكلةٍ؛ إنما يقصد مرضاة الله عز وجل فكأنه ذاهبٌ إلى الله عز وجل.. 
وإذا توجه الإنسان إلى بيوت الله لا يرجوا دنيا؛ بل لا يخرج إلا ابتغاء مرضاة الله، فالله جل جلاله سيرحمه، سيتجلى عليه، سينور قلبه، سيوفقه في أعماله الدنيوية، سيمنحه الرضى، يمنحه القرب 
من ذهب إلى البلاد المقدسة لأداء فريضة الحج لا يبتغي تجارة؛ لا يذهب إلا ابتغاء وجه الله عز وجل، فكأنه ذاهب إلى الله عز وجل 
""";

// page 12
  static const String titleEighteenTwelve_1 = """
وذكرهم بأيام الله 
------------
 """;

  static const String elmEighteenTwelve_1 = """
  ماهي أيام الله؟ 
أيام الله؛ الأيام التي نصر الله بها قوم سيدنا موسى، فحين نجاهم من فرعون، حين صار البحر لهم طريقاً يبسا، هذه أيام الله لقوم موسى عليه وعلى نبينا أفضل الصلاة والسلام 

💮ايام الله للمؤمن قد تكون في امتحان عصيب، وتدعو الله سبحانه وتعالى فيستجيب لك، هذا يومٌ من أيام الله

💮 قد يكون ابنك في مرض عُضال، وتدعو الله سبحانه وتعالى فيستجيب لك ويشفيه، هذا يومٌ من أيام الله 

💮 قد تكون في ضائقةٍ ماديةٍ خانقة فيأتيك رزق من حيث لا تحتسب، هذا يومٌ من أيام الله 

💮 قد تسأل الله الهدى فيجمعك برجلٍ على حق، هذا يومٌ من أيام الله 

💮 قد تسأل الله زوجة صالحة فيرزقك الله زوجة صالحة، هذا يومٌ من أيام الله 

💮 قد تسأل الله بيتاً يؤويك فيهبك الله هذا البيت، هذا يومٌ من أيام الله 

💮 قد تقع في ورطة وترى الهلاك فيها فتدعو الله مخلصاً فينجيك منها ومن كل كرب، هذا يومٌ من أيام الله، فالمؤمن لا ينسى أيام الله، يذكرها دائماً، يطأطئ رأسه تواضعاً لله، وكلما ذكر أيام الله يزداد لله شكراً.. 

إذا فتح شخص دفتراً وكتب فيه أيام الله عنده، يوم نجاه الله عز وجل من المرض الفلاني، يوم زوجه فلانة، يوم أعطاه هذا المحل التجاري، يوم هيأ له هذا المنزل، يوم وقع في مشكلة كبيرة جداً فنجاه الله منها، فإن ذلك يحفزه على دوام الشكر، ذكر نفسك بأيام الله 
""";
  static const String ayahHadithEighteenTwelve_1 = """
        وذكرهم بأيام الله 
        """;
  // 2
  static const String elmEighteenTwelve_2 = """
من أجل أن تحبه، من أجل أن تطمئن له، من أجل أن تعرف أن الذي أنقذك فيما مضى سيحفظك فيما هو آتٍ فلا تقلق..
  """;

// page 13
  static const String titleEighteenThirteen_1 = """
عن الله أحدثك
------------
 """;
  static const String elmTextEighteenThirteen_1 = """
يراك وأنت تطرق باباً تلوا باب، تفشل هنا وتحزن هناك، هذا يعاتبك وذاك يكيد لك، ولكنه ينتظر إقبالك، وأنت تتعثر وتنهض وتقع وتبكي، ثم ماتلبث أن تأتيه مكسوراً، فتناديه فيفتح بابه لك، كأنه يقول لك، إن جافوك فأنا حبيبك، وإن آلموك فأنا طبيبك، مرحباً بك آيباً تائباً...

عن الله أحدثك
 """;

  // page 14
  static const String titleEighteenFourteen_1 = """
الأخسرين اعمالا 
 """;
  static const String elmTextEighteenFourteen_1 = """
الحقيقة الإنسان حينما ينتقل إلى عملٍ ما، ينطلق من تصور أن هذا العمل في مصلحته، وله منه مكسب كبير، إن كانت رؤيته غير صحيحة، إن كانت رؤيته ضبابية، إن كانت رؤيته ليست كما يريد الله عز وجل، هذا هو الضلال وقع في الانحراف؛ أما إذا تمتع الإنسان برؤيةٍ صحيحة كان مهتدياً، ماهو الهدى؟ أن ترى وفق ما أراد الله عز وجل 
""";
  static const String ayahHadithEighteenFourteen_1 = """
قل هل ننبئكم بالأخسرين أعمالا الذين ضل سعيهم في الحياة الدنيا وهم يحسبون أنهم يحسنون صنعا 
""";
  static const String elmTextEighteenFourteen_2 = """
هذه مصيبة كبيرة، أن تنظر إلى الشيئ من زاويةٍ مغلوطة، أو أن تراه رؤية مغلوطة، أو أن تظنه خيراً وهو شر، أن تظنه حقاً وهو باطل، الضلال في حقيقته رؤية غير صحيحة، لذلك البطولة أن تُصلح رؤيتك دائماً وفق ما أراد الله عز وجل، فالله سبحانه وتعالى أعطاك ميزان العقل، وأعطاك ميزان الفطرة، وأعطاك ميزان الشرع، فإذا وافق عقلك ميزان الشرع أنعم به من عقل، إذا وافقت فطرتك ميزان الشرع أنعم بها من فطرة، أما الميزان الذي لا يُخطئ، فهو الشرع الذي أنزله الله على نبيه 
أما إذا هداك عقلك إلى خلاف الشرع هذا العقل قد ضل، وقد أنحرف، وقد طغى، وقد بغى 
إذاً الخطورة أن يزين الشيطان للإنسان عمله، فيرى عمله صائباً، يرى عمله صحيحاً، يرى عمله فيه فلاحٌ ونجاح، هنا الخطورة، لأنه ما من إنسان يُقدِمُ على شيءٍ إلا ويتوهمُ أنه صواب 
""";

  static const String ayahHadithEighteenFourteen_2 = """
        أفمن زين له سؤ عمله فرآه حسنا 
        """;
  static const String subtitleEighteenFourteen_1 = """
مصيبة المصائب: 
""";
  static const String elmTextEighteenFourteen_3 = """
يعني أن يفعل الإنسان المعصية، ثم يتسائل: أهذه معصية؟ هذا شيء مؤلم جداً، لكن الفرق كبير بين من يعصي الله، ويعلم أنه يعصيه، وبين من يعصي الله، ويعلم أنه على صواب، وإن هذا هو عين الذكاء، وأن هذا هو عين الفلاح، وأن هذا هو عين التفوق، يعصي الإله، ويرى نفسه مصيباً في هذه المعصية، هذه مصيبة المصائب، أن تفعل السيئات، وأنت تعتقد أنك تفعل الصالحات، أن تأكل المال الحرام، وتعد هذا ذكاء ومهارة منك، أن توقع بين الناس، وتعد هذا حيلة محكمة بيدك، أن تبني مجدك على أنقاض الناس، وتعد نفسك أذكاهم جميعاً، أن تستغل الناس لمآربك الشخصية، وتعد هذا تفوقاً منك، أن ترى الشر خيراً، وأن ترى الخير شراً، أن ترى الحق باطلاً، وأن ترى الباطل حقاً، أن ترى الإساءة إحساناً، وأن ترى الإحسان إساءة، أن ترى الضعف صفة أخلاقية، وأن ترى الأخلاق ضعفاً في الإنسان، أن ترى أن المعتدي هو الذكي، وهو الذي يستحق الإحترام، إنها مصيبة؛ أن تفعل السيئات وأنت لا تدري، تقول ماذا فعلت؟! 
  
  """;
  // 15
  static const String elmTextEighteenFifteen_1 = """
▪️العقل المفلسف للشهوة وللمعصية أخطر عقل 
""";
  static const String ayahHadithEighteenFifteen_1 = """
        أفمن زين له سؤ عمله فرآه حسنا 
        """;
  static const String elmTextEighteenFifteen_2 = """
فمن هو المزين؟ الشيطان، والإنسان يزين عمله في بعض الأحيان، يتفلسف، يفلسف انحرافه، ويفلسف حقده، ويفلسف انتقامه، ويفلسف شهوانيته، ويفلسف طمعه، ويفلسف بخله 

▪️العقل إذا ضل زين للإنسان سؤ عمله 

▪️من زين له سؤ عمله وقع في مصيبتين مصيبة سؤ عمله ومصيبة فلسفة سؤ عمله 
مصيبة العمل السيء، ومصيبة أنه يتوهم أن هذا العمل السيء هو عمل طيب

  """;
}

class Text {
  static const String txt = """
// page 14     
من كل بستان زهرة🌸

الأخسرين اعمالا 
الحقيقة الإنسان حينما ينتقل إلى عملٍ ما، ينطلق من تصور أن هذا العمل في مصلحته، وله منه مكسب كبير، إن كانت رؤيته غير صحيحة، إن كانت رؤيته ضبابية، إن كانت رؤيته ليست كما يريد الله عز وجل، هذا هو الضلال وقع في الانحراف؛ أما إذا تمتع الإنسان برؤيةٍ صحيحة كان مهتدياً، ماهو الهدى؟ أن ترى وفق ما أراد الله عز وجل 
قل هل ننبئكم بالأخسرين أعمالا الذين ضل سعيهم في الحياة الدنيا وهم يحسبون أنهم يحسنون صنعا 
هذه مصيبة كبيرة، أن تنظر إلى الشيئ من زاويةٍ مغلوطة، أو أن تراه رؤية مغلوطة، أو أن تظنه خيراً وهو شر، أن تظنه حقاً وهو باطل، الضلال في حقيقته رؤية غير صحيحة، لذلك البطولة أن تُصلح رؤيتك دائماً وفق ما أراد الله عز وجل، فالله سبحانه وتعالى أعطاك ميزان العقل، وأعطاك ميزان الفطرة، وأعطاك ميزان الشرع، فإذا وافق عقلك ميزان الشرع أنعم به من عقل، إذا وافقت فطرتك ميزان الشرع أنعم بها من فطرة، أما الميزان الذي لا يُخطئ، فهو الشرع الذي أنزله الله على نبيه 
أما إذا هداك عقلك إلى خلاف الشرع هذا العقل قد ضل، وقد أنحرف، وقد طغى، وقد بغى 
إذاً الخطورة أن يزين الشيطان للإنسان عمله، فيرى عمله صائباً، يرى عمله صحيحاً، يرى عمله فيه فلاحٌ ونجاح، هنا الخطورة، لأنه ما من إنسان يُقدِمُ على شيءٍ إلا ويتوهمُ أنه صواب 
        أفمن زين له سؤ عمله فرآه حسنا 
مصيبة المصائب: 
يعني أن يفعل الإنسان المعصية، ثم يتسائل: أهذه معصية؟ هذا شيء مؤلم جداً، لكن الفرق كبير بين من يعصي الله، ويعلم أنه يعصيه، وبين من يعصي الله، ويعلم أنه على صواب، وإن هذا هو عين الذكاء، وأن هذا هو عين الفلاح، وأن هذا هو عين التفوق، يعصي الإله، ويرى نفسه مصيباً في هذه المعصية، هذه مصيبة المصائب، أن تفعل السيئات، وأنت تعتقد أنك تفعل الصالحات، أن تأكل المال الحرام، وتعد هذا ذكاء ومهارة منك، أن توقع بين الناس، وتعد هذا حيلة محكمة بيدك، أن تبني مجدك على أنقاض الناس، وتعد نفسك أذكاهم جميعاً، أن تستغل الناس لمآربك الشخصية، وتعد هذا تفوقاً منك، أن ترى الشر خيراً، وأن ترى الخير شراً، أن ترى الحق باطلاً، وأن ترى الباطل حقاً، أن ترى الإساءة إحساناً، وأن ترى الإحسان إساءة، أن ترى الضعف صفة أخلاقية، وأن ترى الأخلاق ضعفاً في الإنسان، أن ترى أن المعتدي هو الذكي، وهو الذي يستحق الإحترام، إنها مصيبة؛ أن تفعل السيئات وأنت لا تدري، تقول ماذا فعلت؟! 

// 15
▪️العقل المفلسف للشهوة وللمعصية أخطر عقل 
أفمن كان على بينة من ربه كمن زين له سؤ عمله 
فمن هو المزين؟ الشيطان، والإنسان يزين عمله في بعض الأحيان، يتفلسف، يفلسف انحرافه، ويفلسف حقده، ويفلسف انتقامه، ويفلسف شهوانيته، ويفلسف طمعه، ويفلسف بخله 

▪️العقل إذا ضل زين للإنسان سؤ عمله 

▪️من زين له سؤ عمله وقع في مصيبتين مصيبة سؤ عمله ومصيبة فلسفة سؤ عمله 
مصيبة العمل السيء، ومصيبة أنه يتوهم أن هذا العمل السيء هو عمل طيب
  """;
}
