class ElmTextTwentyTwo {
  static const textTwentyTwoPageOne_1 = """
 أنت مصيرك إلى الله عز وجل، ماذا أعددت لهذا اللقاء؟ ماذا هيأت له؟ ماذا ادخرت له؟ ماذا تزودت له؟ بم تلقى الله إذاً؟ 
لاصدقة ولا جهاد، جهاد النفس والهوى، فبم تلقى الله إذاً؟ 
  """;
  static const ayahTwentyTwoPageOne_1 = """

        كل نفس ذائقة الموت ثم إلينا ترجعون 

 """;
  static const textTwentyTwoOnePageOne_2 = """
جاء في بعض الآثار: أنه ما من بيت إلا وملكُ الموت يقف فيه في اليوم خمس مرات فإذا رأى أن العبد قد انقضى اجله، وانقطع رزقه ألقى عليه غم الموت! فغشيته سكراته، فمن أهل البيت الضاربة وجهها، والممزقة ثوبها، والصارخة بويلها، يقول ملك الموت: فيم الجزع؟ ومما الفزع؟ ما أذهبتُ لواحد منكم رزقاً، ولا قربت له أجلاً، وإن لي فيكم لعودة، ثم عودة، حتى لا أبقي منكم أحداً 
فو الذي نفس محمد بيده، لو يرون مكانه ويسمعون كلامه لذهلوا عن ميتهم، ولبكوا على أنفسهم 
أي أنهم ينسون أن يغسلوا الميت! فإذا شُيع هذا الميت رفرفت روحه فوق النعش، تقول: يا أهلي، ياولدي، لا تلعبن بكم الدنيا كما لعبت بي، جمعت المال مما حل وحرم، فأنفقته في حله وفي غير حله، فالهناء لكم والتبعة علي 
فو الذي نفس محمد بيده لو ترون ما أنتم عليه بعد الموت ما أكلتم طعاماً عن شهوة تذهب القابلية نهائياً ولا شربتم شراباً، ولذهبتم إلى الصُعدات تضربون وجوهكم، وتزمون أنفسكم، هكذا ورد في بعض الآثار 
""";

// page 2
  static const ayahHadithTwentyTwoPageTwo_1 = """
  
        كل نفس ذائقة الموت 

  """;
  static const textTwentyTwoPageTwo_1 = """
هذا أخطر حدث في حياة الإنسان، أخطر من الحياة والولادة، لماذا؟ الولادة فيها خيارات كثيرة أمامك، أما الموت فليس فيه خيار، فإذا سيق رجل للإعدام، إذا بكى هل يخلصونه مما هو فيه؟ البكاء والتوسل هل ينجيانه من الإعدام؟ لا، لو ضحك هل ينجو؟ هذا ممر إجباري، ضحكه كبكائه، وصراخه كصمته، وتوسله ككبريائه، هذا الحكمُ لابد من أن يقع، لذلك قال ربنا عز وجل 
  
  """;

  static const ayahHadithTwentyTwoPageTwo_2 = """

        الذي خلق الموت والحياة 

 """;
  static const subtitleTwentyTwoPageTwo_1 = """
خلق الموت والحياة 
  """;

  static const textTwentyTwoPageTwo_2 = """
بدأ بالموت، لأن حدث الموت أخطر في حياة الإنسان من حدث الحياة، كمثل أول العام الدراسي فأوله سهل، الفرص كلها واسعة ومفتوحة، تدرس أو لا تدرس، تهدر بعض الوقت أو تستغله، تنتبه أو لا تنتبه، تتشاغل، تكتب، تؤدي الواجبات، تهملها 
هناك خيارات واسعة جداً، ولكن دخولك على قاعة الامتحان يترتب عليه النجاح أو الرسوب، الإكرام أو الإهانة، هنا ضاقت الخيارات
""";

  static const subtitleTwentyTwoPageTwo_2 = """
  سكرات الموت 
  """;
  static const ayahHadithTwentyTwoPageTwo_3 = """
  
    حتى إذا جاء احدهم الموت 
  
  """;

  // page 3
  static const textTwentyTwoPageThree_1 = """
بعضهم قال: إن الإنسان إذا جاءه الموت لابد أن يعرف مقامه في الآخرة، إما أن يرى مقامه في جنةٍ عرضها السماوات والأرض، وإما أن يرى مكانه في النار، في دركات النار، لذلك حينما يُشرف الإنسان على الموت يعرف مكانه في الآخرة، إما في جنة يدوم نعيمها؛ أو في نار لا ينفذ عذابها 
  """;

  static const ayahHadithTwentyTwoPageThree_1 = """

    حتى إذا جاء احدهم الموت 
    قل إن الموت الذي تفرون منه فإنه ملاقيكم 

 """;

  static const textTwentyTwoPageThree_2 = """
تفرون منه.. أي كأنه يلحقكم.. فإنه ملاقيكم، فالإنسان أحياناً يفاجأ، يكون متوقعاً أن يموت من هذا المرض، يعتني بصحته عناية بالغة، فإذا هو يفاجأ بأنه يموت بحادث، وهذا وقع كثيراً، فالإنسان لا يعرف كيف يموت، ياترى يموت بمرض، بحادث، الله أعلم 
 """;

  static const subtitleTwentyTwoPageThree_1 = """
اجمل ساعة في حياة المؤمن ساعة لقاء ربه 
""";

  static const textTwentyTwoPageThree_3 = """
حينما يكون الإنسان مع الله عز وجل فهو في سعادة مابعدها سعادة، النبي عليه الصلاة والسلام في بعض الغزوات تفقد أحد أصحابه، وإسمه الربيع فقال: أين الربيع، فندب أحد أصحابه يبحث عنه في أرض المعركة، أحد أصحاب النبي الكريم توجه إلى أرض المعركة يبحث عن الربيع بين القتلى والجرحى، فإذا هو بين القتلى لكنه لم يمت بعد أي في النزع الأخير، فقال: إن النبي عليه الصلاة والسلام يُقرئك السلام، وقد بعثني أبحث عنك، فهل أنت ياربيع بين الأموات أم بين الأحياء؟ فقال الربيع: إنني من الأموات ولكن أقرئ رسول الله مني السلام وقل له: جزاك الله عنا خير ماجزى نبياً من أمته 
هذه حاله، هو في أرض المعركة يلقى النزع الأخير وحاله من أسعد الحالات، فالإنسان ليكن عمله في الدنيا عملاً طيباً بحيث لو جاءه الموت، قال كما قال سيدنا بلال رضي الله عنه، حينما قالت له ابنته: واكربتاه يا أبت 
قال: لا كرب على أبيك بعد اليوم غداً نلقى الأحبة؛ محمداً وصحبه 
 """;

// page 4 // From ElmTextTwentyTwo
  static const titleTwentyTwoPageFour_1 = """
الموت هو اليقين 
 """;

  static const ayahHadithTwentyTwoPageFour_1 = """
  قال ربنا عز وجل 
    واعبد ربك حتى يأتيك اليقين 
  """;

  static const textTwentyTwoPageFour_1 = """
اليقين هو الموت ولم يقل الله عز وجل: واعبد ربك حتى يأتيك الموت، قال 
  """;

  static const ayahHadithTwentyTwoPageFour_2 = """
  
    واعبد ربك حتى يأتيك اليقين 

   """;

  static const textTwentyTwoPageFour_2 = """
  الموت سُمي يقيناً لتيقن وقوعه.. كل مخلوق يموت، ولا يبقى إلا ذو العزة والجبروت، الليل مهما طال فلا بد من طلوع الفجر، والعمر مهما طال فلا بد من نزول القبر 
لذلك البطل هو الذي يعُد لهذه الساعة العُدة، هو الذي يعمل الصالحات، هو الذي يستقيم على أمر الله 
  """;

// page 5
  static const textTwentyTwoPageFive_1 = """
سمي الموت يقيناً لشيئ آخر، هو أن كل شيئ سمعته في الدنيا يصبح عند الموت يقيناً، نقول الآن: في جنة، وفي نار، وفي حساب، في صراط، وفي عذاب، وفي ملائكة، وفي زبانية، وفي جهنم، هذا الكلام كله من الغيبيات، عند الموت تصبح هذه الأخبار حقائق، سمي الموت يقيناً لتيقن وقوعه، وسمي الموت يقيناً لأن كل شيئٍ فيه يصبح يقيناً 
 """;

  static const ayahHadithTwentyTwoPageFive_1 = """
  
    إقرأ كتابك كفى بنفسك اليوم عليك حسيبا 

    لقد كنت في غفلة من هذا فكشفنا عنك غطائك فبصرك اليوم حديد 
    حتى إذا جاء احدهم الموت قال رب ارجعون 
    ان تقول نفس ياحسرتاه على مافرطت في جنب الله 

  """;

  static const textTwentyTwoPageFive_2 = """
ليتني أعود إلى الدنيا فأستقيم على أمر الله، ياليتني أعود إلى الدنيا فأعمل الصالحات، ياليتني أعود إلى الدنيا فأتعلم كتاب الله، ياليتني أعود إلى الدنيا فأجعل بيتي إسلامياً كما اراد الله عزوجل، ياليتني أعود إلى الدنيا لأحرر دخلي من الحرام، ياليتني أعود إلى الدنيا لأنفق المال فيما يرضي الله 
    قال ربي ارجعون لعلي اعمل صالحاً فيما تركت 
تركت أموالاً يارب، لعلي أعود إلى الدنيا فأنفقها في طاعتك، تركتها لأولادي، فأولادي صرفوها، وأنفقوها في معصية الله، فأغلب الظن أن الإنسان إذا ترك أموالاً طائلة، ولم يترك ذرية صالحة أغلب الظن أن هذه الأموال تُنفق على المعاصي لذلك النبي عليه الصلاة والسلام يصف الإنسان، حينما يوضع في النعش بأن روحه ترفرف فوق النعش وتقول: يا أهلي ياولدي، لا تلعبن بكم الدنيا كما لعبت بي، جمعت المال مما حل وحرم، فأنفقته في حله وفي غير حله، فالهناء لكم، والتبعة علي 
 """;

  static const ayahHadithTwentyTwoPageFive_2 = """

    حتى إذا جاء احدهم الموت قال رب ارجعون 

""";

// page 6
  static const textTwentyTwoPageSix_1 = """
يقول بعضهم: إن الميت يُخاطب الملائكة الذين قبضوا روحه، وكلمة رب اعتراضية، كما لو أن الأب أخذ ابنه ليضربه فالطفل ينادي أمه.. ينادي إنسان آخر يظن أنه سيُخلصه.. قال: أي يارب، أرجعوني أيها الملائكة كما كنت في الدنيا 
  """;
  static const ayahHadithTwentyTwoPageSix_1 = """
  
    لعلي اعمل صالحاً فيما تركت 

  """;

  static const textTwentyTwoPageSix_2 = """
الجواب زجر وردع وخزي 
 """;
  static const ayahHadithTwentyTwoPageSix_2 = """

    كلا إنها كلمة هو قائلها 
    
 """;

  static const textTwentyTwoPageSix_3 = """
أن هذه الكلمة التي قالها لا تُقدم ولا تؤخر، ولا تنفع، ولا تُجدي، ولا تؤثر، وليس لها أي مفعول، إنها كلمة هو قائلها، إذا كان ساقوا مجرماً إلى الإعدام بعد أن صدر الحكم بإعدامه، وتصدق الحكم، وهو مرتكب جريمة، إذا قال: خلصوني، سامحوني، اتركوني، نقول له: هذه كلمة لا تقدم ولا تؤخر، ولا تجدي، ولا تفعل شيئاً إنها كلمة هو قائلها، فالإنسان لاينبغي أن يُهمل أمر دينه في الدنيا حتى يأتي عليه يوم يتمنى أن يرجع إلى الدنيا ويقال له 
""";

  static const ayahHadithTwentyTwoPageSix_3 = """

    كلا إنها كلمة هو قائلها 
    
 """;

// page 7
  static const titleTwentyTwoPageSeven_1 = """
وجائت سكرة الموت بالحق 
  """;

  static const ayahHadithTwentyTwoPageSeven_1 = """

وجائت سكرة الموت بالحق 

 """;

  static const textTwentyTwoPageSeven_1 = """
النبي عليه الصلاة والسلام سيد الخلق وحبيب الحق، سيد ولد آدم، حبيب الله، خليل الله، ومع ذلك حينما جاءته سكرة الموت قال 
  """;

  static const ayahHadithTwentyTwoPageSeven_2 = """
  
    لا إله إلا الله، إن للموت لسكرات 

  """;
  static const textTwentyTwoPageSeven_2 = """
ان سكرة الموت جاءت بالحق الذي سمعه الإنسان في الدنيا 
  
من بعض المعاني التي تستنبط من هذه الآية 
أن سكرة الموت جائت بالحق الذي سمعته في الدنيا، رأيت الحق رأي العين، سمعت أنت أن الدنيا دار عمل والآخرة دار جزاء، سمعت أن الدنيا ملعونة، ملعون مافيها إلا ذكر الله، وما والاه، كل شيئٍ سمعته في الدنيا من كلام، أو فكرة سمعتها، فعند الموت تراها رأي العين 
حينما يستمع الإنسان في حياته الدنيا إلى خطب في المساجد، إلى دروس تفسير، مواعظ، يقرأ كتباً، كلها معلومات، هذه آيات، وأحاديث، وأدلة، وأقوال علماء، وفكرة عن الجنة والنار...إلخ، أما حينما يموت فكل هذا الذي سمعه يراه رأي العين
لذلك يقول الإنسان عند الموت 

  """;

// page 8
  static const ayahHadithTwentyTwoPageEight_1 = """

        رب ارجعون لعلي اعمل صالحاً فيما تركت

""";
  static const textTwentyTwoPageEight_1 = """
هُناك طلب من العبد أن يؤخره الله 
    لولا أخرتني إلى اجل قريب فأصدق وأكن من الصالحين ولن يؤخر الله نفساً إذا جاء أجله والله خبير بما تعملون 
    """;

  static const subtitleTwentyTwoPageEight_1 = """
ندم الإنسان بعد رؤية الموت رأي العين 
    """;

  static const textTwentyTwoPageEight_2 = """
عند الموت 
""";

  static const ayahHadithTwentyTwoPageEight_2 = """

        ياليتني قدمت لحياتي 
        
        """;
  static const textTwentyTwoPageEight_3 = """
عند الموت 
""";
  static const ayahHadithTwentyTwoPageEight_3 = """

        ياليتني اتخذت مع الرسول سبيلا 

 """;
  static const textTwentyTwoPageEight_4 = """
عند الموت 
  """;

  static const ayahHadithTwentyTwoPageEight_4 = """

        ياويلتى ليتني لم اتخذ فلاناً خليلا 

 """;
  static const textTwentyTwoPageEight_5 = """
عند الموت 
  """;

  static const ayahHadithTwentyTwoPageEight_5 = """

        ويوم يعض الظالم على يديه 

 """;
  static const textTwentyTwoPageEight_6 = """
هذا كله عند الموت لأنه رأى الحقيقة، رأها رأي العين، كانت خبراً، وعلم يقيناً، ثم أصبحت عين اليقين، وحق اليقين  
  """;

// page 9
  static const textTwentyTwoPageNine_1 = """
لا تملك إلا الساعة التي انت فيها، فالماضي لا يعود، والمستقبل لا تملكه، من عد غداً من أجله فقد أساء صحبة الموت فإذا قلت: غداً سأدفع ما علي من رسوم الهاتف، سأسدد إيصال الهاتف غداً 
أنت لا تعرف حقيقة الموت، الموت أسرع من ذلك، يخطف الناس خطفاً خلال ثانية، يكون شخص ملء السمع والبصر فإذا هو كلمات على الجدران، المرحوم فلان، عميد أسرتهم، الشاب، الشابة، إثر حادث أليم، إثر نوبة قلبية 
""";
  static const ayahHadithTwentyTwoPageNine_1 = """

        وجاءت سكرة الموت بالحق 

  """;
  static const String textTwentyTwoPageNine_2 = """
الموت ينقلك من علم اليقين إلى حق اليقين، ينقلك من أفكار منطقية سمعتها إلى مشاهدات حقيقية تراها، خيارنا مع الإيمان هل هو خيار قبول أو رفض؟ لا والله، إنما هو خيار وقت، إما أن نؤمن قبل فوات الآوان، إما أن نؤمن ونستفيد من إيماننا، أو أن نؤمن من دون أن نستفيد من الإيمان شيئاً فتزداد الحسرة والندم 
  """;
  static const String ayahHadithTwentyTwoPageNine_2 = """

        إنك ميت وإنهم ميتون 

  """;
  static const String textTwentyTwoPageNine_3 = """
هناك تفكير ساذج عند مُعظم الناس، يظن أنه إذا مات فلان يرتاح ويرث أمواله، فهل أنت لن تموت بعده؟ أو ربما تموت قبله 
    إنك ميت 
أنت بشر، لأنه ما من مخلوق إلا وسيموت، كل مخلوق يموت ولا يبقى إلا ذو العزة والجبروت 

والليل مهما طال   فلا بد من طلوع الفجر
والعُمر مهما طال   فلا بد من نزول القبر 

فالموت حق، فالأنبياء ماتوا، والمؤمنون ماتوا، والكفار ماتوا، والأغنياء ماتوا، والفقراء ماتوا، والأصحاء ماتوا، والمرضى ماتوا، والأقوياء ماتوا، والضعفاء ماتوا، والظالمون ماتوا، والمظلومون ماتوا، وكل مخلوق يموت 
   """;
  static const String ayahHadithTwentyTwoPageNine_3 = """

        إنك ميت وإنهم ميتون 
        
 """;
  static const String textTwentyTwoPageNine_4 = """

هم سيموتون أيضاً، يقول لك: مسكين مات، فهل أنت لن تموت؟ لا شماتة في الموت، فلان مات؟! وإنك ميتٌ معه، طبيب تراءى له أن مريضه سيموت بعد ساعتين، عاش ثلاثين سنة بعد هذه الكلمة، والطبيب مات بعد اثنتي عشرة سنة 
  """;
  static const String ayahHadithTwentyTwoPageNine_4 = """

        إنك ميت وإنهم ميتون 

  """;

  // page 10
  static const String subtitleTwentyTwoPageTen_1 = """
    
كُلنا عبيد لله عز وجل والله وحده الباقي 

    """;
  static const String textTwentyTwoPageTen_1 = """

المعنى الآخر: أن كلنا عبيد لله عز وجل، والله وحده الباقي، وهو الذي سيحاسبنا جميعاً، وهو الذي سيُوقفنا أمام أعمالنا، لماذا فعلتم؟ لماذا لم تفعلوا؟ 
    """;
  static const String ayahHadithTwentyTwoPageTen_1 = """
 
    انك ميت وإنهم ميتون ثم إنكم يوم القيامة عند ربكم تختصمون
 
 """;
  static const String subtitleTwentyTwoPageTen_2 = """
بطولة الإنسان أن يكون مع الحق المبين 
""";
  static const String textTwentyTwoPageTen_2 = """
هنيئاً لمن كان على الحق، كل إنسان يدعي في هذه الدنيا أنه على حق، القضية سهلة 
""";
  static const String ayahHadithTwentyTwoPageTen_2 = """

        كل حزب بما لديهم فرحون 

  """;
  static const String textTwentyTwoPageTen_3 = """
كل إنسان يدعي أنه على حق، ومعه الأدلة، ومعه البراهين، ومعه الشواهد، ويظن نفسه محور العالم، والناس من حوله جهلة، أما البطولة أن تكون على الحق فعلاً، البطولة حينما ترجع إلى الله عز وجل أن تكون مع الله، أن تكون مع الحق المبين
لذلك ربنا عز وجل قال 
""";
  static const String ayahHdithTwentyTwoPageTen_3 = """

        فتوكل على الله إنك على الحق المُبين 

  """;
  // page 11
  static const String subtitleTwentyTwoPageEleven_1 = """
هل يبقى الناس في اختلاف إلى الأبد؟ 
    """;
  static const String textTwentyTwoPageEleven_1 = """
لابد من أن تنكشف الحقائق، لابد من أن يظهر الحق، لابد من أن يزهق الباطل 
    """;
  static const String ayahHadithTwentyTwoPageEleven_1 = """

        إن الباطل كان زهوقا 

  """;
  static const String textTwentyTwoPageEleven_2 = """
فبشكل أو بأخر لو معك كيلو من الذهب الخالص، والناس جميعاً ظنوه معدناً خسيساً، لا تبالي بهم، ولو أوهمت الناس أن معك ذهباً خالصاً وهو معدن خسيس، لا تفرح بهذا الإيهام، خيرك منك وشرك منك، سعادتك منك وشقاؤك منك، ويوم القيامة
""";
  static const String ayahHadithTwentyTwoPageEleven_2 = """

        اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد ارجلهم 

""";
  static const String textTwentyTwoPageEleven_3 = """
فبشكل أو بأخر لو معك كيلو من الذهب الخالص، والناس جميعاً ظنوه معدناً خسيساً، لا تبالي بهم، ولو أوهمت الناس أن معك ذهباً خالصاً وهو معدن خسيس، لا تفرح بهذا الإيهام، خيرك منك وشرك منك، سعادتك منك وشقاؤك منك، ويوم القيامة
""";
  static const String ayahHadithTwentyTwoPageEleven_3 = """
          يُنبأ الإنسان يومئذٍ بما قدم واخر 
        كل نفس بما كسبت رهينة 
""";
// page 12
  static const String subtitleTwentyTwoPageTwelve_1 = """
الموت مصير كل حي 
    """;
  static const String textTwentyTwoPageTwelve_1 = """
إذاً 
""";
  static const String ayahHadithTwentyTwoPageTwelve_1 = """
        إنك ميت وإنهم ميتون   
  """;
  static const String textTwentyTwoPageTwelve_2 = """
وقد قالوا: سبحان من قهر عباده بالموت، فالإنسان له أن يقول مايشاء، وله أن يفعل مايشاء، ولكن لا بد من أن يموت، وبعد الموت يحكم الواحد الديان
""";
// page 13
  static const String subtitleTwentyTwoPageThirteen_1 = """
وففة
---
""";
  static const String subtitleTwentyTwoPageThirteen_2 = """
إحتضار الإنسان وعرض جميع أعماله أمامه 
  """;
  static const String ayahHadithTwentyTwoPageThirteen_1 = """

    وجائت سكرة الموت بالحق ذلك ماكنت منه تحيد 

  """;
  static const String textTwentyTwoPageThirteen_1 = """
هذا الإحتضار، والمؤمن يرى مقامه في الجنة فيقول: لم أر شراً قط، والكافر يرى مكانه في النار فيقول: لم أر خيراً قط، يكون في دنياه قد سافر، وتنقل كيف يشاء، وأكل أطيب الطعام، ومتع عينيه باجمل النساء، وماترك مكاناً إلا وذهب إليه، وفعل كل مايشتهي، وأنغمس في كل الملذات إلى قمة رأسه وعاش في مجتمع كما يقولون مجتمع التفلت، وفعل كل مايشتهي، وعندما يرى مكانه في النار يقول: لم أر خيراً قط
  """;
  // page 14
  static const String ayahHadithTwentyTwoPageFourteen_1 = """

قُل إن الموت الذي تفرون منه فإنه ملاقيكم 

  """;
  static const String subtitleTwentyTwoPageFourteen_2 = """
الموت مصير كل حي 
    """;

  static const String textTwentyTwoPageFourteen_3 = """
  ناً يخاف من عدو شرس، فهو يركض والعدو وراءه، وكل يقينه أنه وراءه، ثم فوجئ به أمامه! 
رجُل أصيب بأزمة قلبية، فرأى الموت يأتيه من قلبه، فاعتنى عناية تفوق حد الخيال، الطعام المقنن، والرياضة، والعناية، والراحة التامة، والبعد عن المشكلات، حسب تعليمات الطبيب، وهو لا ينتظر الموت إلا من قلبه، جاء صهره، ومعه سيارة فخمة، أخذه إلى نزهة، وفي طريق العودة وقع حادث أليم أودى بحياته، هو ينتظر الموت من أين؟ من قلبه، فإذا هو بحادث لم يكن يتوقعه 
  """;
  static const String ayahHadithTwentyTwoPageFourteen_4 = """

        قل إن الموت الذي تفرون منه فإنه ملاقيكم 

  """;
  static const String textTwentyTwoPageFourteen_5 = """
تظنه وراء ظهرك، وأنت هارب منه قد تفاجأ أنه أمامك
""";
// page 15
  static const String subtitleTwentyTwoPageFifteen_1 = """
  ياحسرتاه على مافرطت في جنب الله 
  """;
  static const String textTwentyTwoPageFifteen_1 = """
قصرت، ماعرفت الله حق المعرفة، ماقدرته حق قدره، ماعرفت عظمته، ماعرفت نفسي به، ماحملتها على طاعته، ماقرأت كلامه، ماحاولت فهم كلامه، ماحضرت مجالس العلم، مااتعظت بما وعظني به من مصائب 
  """;
  static const String ayahHadithTwentyTwoPageFifteen_1 = """
        ياحسرتاه على مافرطت في جنب الله 
  """;
  static const String textTwentyTwoPageFifteen_2 = """
احياناً الإنسان في الدنيا تفوته ميزة، فاته شيئ من الدنيا، يتأوه فتحس أنه قلبه تقطع، يقول لك: محروق قلبي، هذا البيت ضاع من يدي، فلانة خُطبت، كانت في بالي ولكنها خُطبت، ماكان في مثلها، هي أنسب زوجة لي، ولكن راحت من يدي، تجده على زوجة أو على بيت محروق قلبه، فإذا اكتشف أنه خسر الأخرة كلها، خسر الأبدية كلها، عذاب أبدي سرمدي من أجل سنوات عدة أمضاها في المعاصي، ألا يتألم؟ 
  """;

  // page 16
  static const String subtitleTwentyTwoPageSixteen_1 = """
  على الإنسان أن يكثر من ذكر الموت لأنه يذكر بالآخرة 
    """;
  static const String ayahHadithTwentyTwoPageSixteen_1 = """
        النبي الكريم قال {اكثروا ذكر هاذم اللذات} 

عش ماشئت فإنك ميت، وأحبب ماشئت فإنك مجزي به    
  """;
  static const String textTwentyTwoPageSixteen_1 = """
        إكرام الله عز وجل للمؤمن بأن يأتيه الموت بأحلى صورة 

من أدخل الموت في حساباته اليومية أصبح حسابه يوم القيامة يسيرا 
""";
  static const String ayahHadithTwentyTwoPageSixteen_2 = """
{لا أجمع على عبدي أمنين وخوفين، إن أمنني في الدنيا أخفته يوم القيامة، وإن خافني في الدنيا أمنته يوم القيامة}
""";

  // static var ayahHadithTwentyTwoPageNine_2;

  // static var ayahHadithTwentyTwoPageNine_3;

  // static var ayahHadithTwentyTwoPageNine_4;

  // static var ayahHadithTwentyTwoPageTen_2;

  // static var ayahHadithTwentyTwoPageEleven_2;

  // static var ayahHadithTwentyTwoPageEleven_3;

  // static var textTwentyTwoPageTwo_3;
}
