class ElmTextPre {
  static const String titleOne = """
مجموعة خواطر حول الدين والحياة  
----------------------------
""";

  static const String ayahHadith = """
وَذَكِّرۡ فَإِنَّ ٱلذِّكۡرَىٰ تَنفَعُ ٱلۡمُؤۡمِنِینَ ۝٥٥ * 
---------------
الذاريات 55 * 
""";

  static const String elmTextOne_1 = """
احببت أن شارك بها من باب بلغوا عني ولو ايه وإلا فأنا أقل من أن أتحدث في مثل هذه الأمور 
كما أن هناك بعض الإقتباسات التي سمعتها أو قرأتها لبعض العلماء فأحببت نقلها للفائدة

فإن كان من توفيق فمن الله وما كان من خطأ أو نسيان فمن نفسي ومن الشيطان والله ورسولة براء
""";
}
