class ElmTextDersThree {
  /*------------ Page 1 -----------*/
  static const String titleThreeeOne = """
العطاء (المال والملك) ليس مقياس لحب الله
-------------
""";

  static const String elmTexThreeOne_1 = """
بعض أو معظم الناس يظن بأن من اعطاه الله مالاً وفيراً أو منصباً لائقاً أو زوجة جيدة أو تجارة عريضة أو صحة جيدة يظن بأنه محظوظ أو أن الله يحبه ويكرمه لايعرفون بأن المال أحيان كثيرة يكون استدراج وامتحان من الله لأن الله سبحانه وتعالى يعطي الدنيا لمن يحب ولمن لايحب ولايمكن أن تكون الدنيا والعطاء مقياساً لمحبة الله عز وجل فلينظر ناظر بعقله أن الله أكرم رسولنا عليه الصلاة والسلام أم اهانه حين زوى عنه الدنيا فإن قال أهانه فقد كذب، وإن قال أكرمه فلقد أهان غيره حيث أعطاه الدنيا، المال الذي يعطيه الله عز وجل ليس إكراماً بل هو ابتلاء وأي عطاء ينتهي عند الموت ليس بعطاء 
""";
  static const String ayaHadithThreeOne_1 = """
قال تعالى 
أَحَسِبَ ٱلنَّاسُ أَن یُتۡرَكُوۤا۟ أَن یَقُولُوۤا۟ ءَامَنَّا وَهُمۡ لَا یُفۡتَنُونَ ۝٢
العنكبوت 2 
""";
  static const String elmTextThreeOne_2 = """
 ولأنهم  لايعرفون بأن الله وزع الحظوظ في الدنيا توزيع ابتلاء وفي الآخرة توزيع جزاء
""";
  static const String ayahHadithThreeOne_2 = """
قال تعالى 
ٱنظُرۡ كَیۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲۚ وَلَلۡءَاخِرَةُ أَكۡبَرُ دَرَجَـٰتࣲ وَأَكۡبَرُ تَفۡضِیلࣰا ۝٢١
الاسراء 21 

""";

/*----------- page 2 ------------ */
  static const String elmTextThreeTwo_1 = """
الناس في الدنيا متفاوتون الصحة درجات، والشكل درجات، والقوة درجات، والمكانة الاجتماعية درجات، والذكاء درجات، والدخل درجات، وهكذا تقتضي الحكمة الإلهية أن يكون الناس درجات لاكن هذه الدرجات مؤقتة وقد يكون الفقير عند الله عز وجل أعظم  من أعلى مرتبة في الارض

  """;
  static const String elmTextThreeTwo_2 = """
هناك تفضيل في الصحة وفي المال وفي الجمال وفي الذكاء وفي القوة وفي المكانة وفي كل شيء؛ الحياة مراتب لاكن هذه المراتب الدنيوية مؤقتة وتنتهي بالموت الله سبحانه وتعالى يمتحن كل إنسان ليرى صدقه من كذبه
""";

  static const String ayahHadithThreeTwo_1 = """
قال تعالى 
۞ إِنَّ قَـٰرُونَ كَانَ مِن قَوۡمِ مُوسَىٰ فَبَغَىٰ عَلَیۡهِمۡۖ وَءَاتَیۡنَـٰهُ مِنَ ٱلۡكُنُوزِ مَاۤ إِنَّ مَفَاتِحَهُۥ لَتَنُوۤأُ بِٱلۡعُصۡبَةِ 
القصص 76 
 """;

  static const String elmTextThreeTwo_3 = """
 وكما قلنا سابقاً أن المال والملك ليس مقياس لحب الله فلقد أعطى قارون المال وهو لايحبه، وأعطى فرعون الملك وهو لايحبه أعطى الأنبياء العلم والحكمة وهو يحبهم فانظر عطائك من أي نوع؛ هناك من يملك الرقاب وهناك من يملك القلوب الأنبياء بكمالهم ملكوا القلوب والأقوياء بقوتهم ملكوا الرقاب والأنبياء لهم اتباع والأقوياء لهم اتباع
---------------------
""";
/* -------- page 3 -----------*/
  static const String ayahHadithThreeThree_1 = """
ويقول رسولنا الكريم
 تعس عبد الدينار وعبد الدرهم تعس عبد الخميصة
رواة البخاري 

وقال سبحانه وتعالى 
وَتَأۡكُلُونَ ٱلتُّرَاثَ أَكۡلࣰا لَّمࣰّا ۝١٩
وَتُحِبُّونَ ٱلۡمَالَ حُبࣰّا جَمࣰّا ۝٢٠
الفجر 19 


""";

  static const String elmTextThreeThree_1 = """
تأكلون التراث أي الإرث فالمنازعات الآن بين الأسر والعداوات والمحاكمات والقضاء مثقل بمشكلات  الإرث كل طرف يحب أن يأخذ كل الإرث وحده وأن يحرم الباقين ولايرضى المرء أن يأخذ ماله يريد أن يأخذ ماله ومال غيره وعلامة المؤمن أنه يكتفي بماله بما قسم له الله


""";
  static const String elmTextThreeThree_2 = """
وأخيراً وليس آخراً عزيزي القارىء إذا أردت أن تعرف من هم الذين يحبهم الله انظر في درسنا القادم


""";
}
