class ElmTextDersEighteen {
  //---- page 1
  static const String titleEighteenOne = """
ماقدرو الله حق قدره إن الله لقوي عزيز 
""";
  static const String elmTextEighteenOne_1 = """
الله سبحانه وتعالى هو العزيز ، القاهر الذي لا يُغلب ولا يُقهر ، المنيع الذي لا يرام جنابه ، فلا ينال جنابه لعزته وعظمته ، وجبروته وكبريائه ، العزيز الذي لا مثل له ولا نظير ، الغالب الذي لايعجزه شيئ ، القوي القاهر الذي لا يقف له شيئ 
وهو سبحانه العزيز الذي له العزة كلها : 
عزة القوة .. وعزة الغلبة .. وعزة الامتناع 

""";
// page 2
  static const String elmTextEighteenTwo_1 = """
ولايحزنك قولهم إن العزة لله جميعا هو السميع العليم 

الله جل جلاله هو العزيز ، وله العزة جميعا ، فنواصي العباد بيده ، ومشيئته نافذة فيهم ، وهو القاهر لهم على ما أراد 
فمن اراد العز في الدنيا والآخره فليطلبه من رب العزة تبارك وتعالى مالك الدنيا والآخرة ، وذلك يحصل بكمال الإيمان والتقوى ، ولزوم طاعة الله عز وجل 
""";

  static const String ayahHadithEighteenTwo_1 = """
( من كان يريد العزة فلله العزة جميعا إليه يصعد الكلم الطيب والعمل الصالح يرفعه )
""";

  static const String elmTextEighteenTwo_2 = """
ومع عظم الطاعة وحسنها وكمالها ودوامها تزداد العزة

""";
// page 3
  static const String elmTextEighteenThree_1 = """
ملايين الأموال أُنفقت لمحاربة الدين والإسلام بطرق وأساليب مختلفة منها عبر المسلسلات التي تعبث بعقول الناس وتحاول إضهار صورة المتدين بصورة بشعة بوحشية وقسوه وعدم رفق مع الآخر لأجل تشويه الإسلام ومحاربته 

جائت لقطة القطه بدقيقة وانتشرت ليراها أكثر من مليار وستميةمليون خلال ٢٤ ساعة لمشهد عفوي بسيط نسفت كل مكايد الأعداء واضهرت الوجه الحقيقي للمسلم
""";

  static const String ayahHadithEighteenThree_1 = """
 (( بل نقذف بالحق على الباطل فيدمغه فإذا هو زاهق ولكم الويل مما تصفون))
 
  صدق الله العظيم القائل ايضا 
  
""";

  static const String ayahHadithEighteenThree_2 = """
  (( إن الذين كفرو ينفقون اموالهم ليصدوا عن سبيل الله فسينفقونها ثم تكون عليهم حسره ثم يغلبون))

 """;

  // page 4
  static const String ayahHadithTextEighteenFour_1 = """
ولما بلغ أشده اتيناه حكما وعلما وكذلك نجزي المحسنين  
""";

  static const String elmTextEighteenFour_1 = """
هكذا نجزيهم على مر الايام ، على مر العصور ، في كل الأقاليم ، في كل البلاد ، في البلاد المتقدمه والبلاد المتخلفه ، وفي شرق الأرض وفي غربها ، في شمالها وفي جنوبها على البر وفي البحر وفي الجو 

إن الذين امنو وعملو الصالحات سيجعل لهم الرحمن ودا 
""";

  // page 5
  static const String elmTextEighteenFive_1 = """
هذه بشرى للمؤنين الباب مفتوح والطريق اليه سالك ، والاله موجود ، والله هو هو ومعاملته هي هي ، وقوانينه هي هي لاتتبدل ولا تتغير ، ولا تُعدل ولا تُجمد ، ولاتوقف ، ولا يُضاف عليها ، ولا يُحذف منها لذلك ابشر 
كن له كما يُريد يكُن لك كما تريد ، سلم له فيما يريد يجعل حياتك كما تريد

  """;

//-- page 6
  static const String ayahHadithEighteenSix_1 = """
من عمل صالحآ من ذكر او أنثى وهو مؤمن فلنحيينه حياة طيبه... 

الحياة الطيبه لاتعني انه غني ، تعني انه موصول بالله ، تعني انه متوكل على الله ، تعني انه يحب الله ، تعني انه خاضع لمنهج الله ، تعني انه يتأمل بحياة سعيده ، قادمه بعد الموت ، هذه حاله دقيقه جدآ

""";

// page 7
  static const String elmTextEighteenSeven_1 = """
علاقة الرجل بالمرآه في منهج الله عز وجل علاقه مستمره ، ليس هناك  علاقه طارئه أبدآ
العلاقه الطارئه ليست من منهج الله عز وجل
هذه المرأه ربطت مصيرها مع زوجها
هي زوجته ، وأم اولاده ، تكبر معه ، تتقاسم معه مافي حياته من حلو ومر ، وفي كل مرحله لها جمالها ، ولها مكانتها ، ولها قيمتها ، ولو عرضت على أية امرأه في الأرض الزواج أو ان تكون متعه رخيصه لا ترضى إلا الزواج
  """;

  // page 8
  static const String ayahHadithEighteenEight_1 = """
ولكن للجهل اللذي يهيمن على فتيات المسلمين غير اللذين عرفوا بناتهم بمنهج الله عز وجل قد يؤثرن التفلت وقد يؤثرن الخروج ، قد يؤثرن علاقات لاترضي الله عز وجل ، هذا كله من الجهل ومن التغذيه غير الإسلاميه اللتي تتغذى بها البنات كل يوم إلى منتصف الليل
هذه التغذيه في مجموعها تهيئ تصورات للفتاه تجعلها تتفلت من منهج الله
""";

  static const String subtitleEighteenEight_1 = """
إيثار الدنيا على الآخرة سبب تفتت وتفرق المسلمين 
""";

// page 9
  static const String ayahHadithEighteenNine_1 = """
 
وماتفرقو إلا من بعد ماجائهم العلم بغياً بينهم 

        ( بغياً بينهم ) 
""";

  static const String elmTextEighteenNine_1 = """
أي تفرقو بسبب البغي أي الحسد وطلب المكاسب الدنيوية ، إذاً الحق يجمع والباطل يفرق ، والآخرة تجمع والدنيا تفرق ، والقيم تجمع والحاجات تفرق ، فإذا اردنا أن نجتمع فلنطلب الدار الآخرة ، وإذا اردنا ان نجتمع فليكن الحق إمامنا ، أما إذا اردنا الدنيا نتنافس ، ونختلف ، ويطعن بعضنا ببعض ، ونتراشق التُهم ، 
وإذا اردنا أن نجتمع فيجب علينا أن تتحد أهدافنا ووسائلنا ، أما إذا تفرقنا ، فكل إنسان طلب مصالح شخصية ، ولو كان الإطار حقاً والغلاف حقاً ، وهذا ما يؤدي إلى تفكيك الأمة 
""";

  static const String elmTextEighteenNine_2 = """
والإنسان بقدر إخلاصه إنه يُرجح مصالح المسلمين العامة على مصلحته الخاصة ، وكلما ضعف إخلاصه رجح مصلحته الخاصة على مصالح المسلمين 
ولذلك فنحن الآن بحاجة إلى أن نتعاون ، وأن نتكاتف ، أن يعذر بعضنا بعضاً ، وأن نتعاون فيما أتفقنا ، وأن يعذر بعضنا بعضاً فيما اختلفنا ، نحتاج أن نحترم جميع الدعاة ، وجميع العلماء من دون أن ننتقص منهم ، وألا نجعل من مجالسنا نهشاً لأعراضهم ومكانتهم فليس هذا في صالح المؤمنين إطلاقاً
  
  """;
}
