class ElmTextDersFifteen {
  // Page 1
  static const String titleFifteenOne = """
  العزة لله 
  -------
""";

  static const String ayahHadithFifteenOne_1 = """
 مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ إِلَیۡهِ یَصۡعَدُ ٱلۡكَلِمُ ٱلطَّیِّبُ وَٱلۡعَمَلُ ٱلصَّـٰلِحُ یَرۡفَعُهُۥۚ 
فاطر 10 

""";

  static const String elmTextFifteenOne_1 = """
أنت كمؤمن يجب أن لا تعتز بغير الله
لا تعتز بمسؤل في الدولة أو شيخ قبيلة أو حزب أو جماعة يجب أن يكون إعتزازك بالله الواحد القهار المهيمن القوي العزيز الجبار

إذا كنت مع الجبار فأنت القوي

إذا كنت مع الجبار فالمستقبل لك

اذا كنت مع الجبار فأنت المنتصر

إذا كنت مع الجبار تدور الأيام ولا تستقر إلا على رفعة شأنك

  """;

// page 2
  static const String elmTextFifteenTwo_1 = """
يجبر كل احد ولا يجبره أحد

الإنسان بفطرته يحب دائماً أن يكون مع القوي ، فالمؤمن أحد اسباب قوته أنه معتز بالقوي

المؤمن أحد اسباب قوته أن كل من حوله ومن فوقه ومن تحته بيد الله وأنه مع الله

وإذا كان الله معك فمن عليك؟

وإذا كان الله عليك فمن معك؟

سبب قوة المؤمن أنه متوكل على الله
إذا اردت ان تكون اقوى الناس فتوكل على الله

سبب قوة المؤمن أنه لا يخضع ولا يستكين ولا يذل لأنه مع القوي
""";
  static const String ayahHadithFifteenTwo_1 = """
 أنا عندَ ظَنِّ عَبدي بي ؛ فَلْيَظُنَّ بي ما شاءَ* 
""";
  static const String footerFifteenTwo = """
---------------------
الراوي *
: واثلة بن الأسقع الليثي أبو فسيلة | المحدث : الألباني | المصدر : صحيح الموارد
الصفحة أو الرقم : 2088 | خلاصة حكم المحدث : صحيح 
""";

// page 3
  static const String elmTextFifteenThree_1 = """
من كان مع الله العزيز كان عزيزاً

كن مع القوي العزيز تكُن عزيزاً وتنجُ من كل هم وآلم

إجعل لربك كل عزك يستقر ويثبت
  فإذا اعتززت بمن يموت فإن عزك ميت

إذا اردت العزة فاعتز بالله سبحانه وتعالى ، سبحانك إنه لا يذلُ من واليت ، ولا يعزُ من عاديت 
""";
  static const String ayahHadithFifteenThree_1 = """
قال سبحانه وتعالى
 فَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا صَـٰلِحࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَمِنۡ خِزۡیِ یَوۡمِئِذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ ۝٦٦ 
هود 66 
""";
  static const String elmTextFifteenThree_2 = """
القوي الذي لا يُدان بقوته ، والعزيز اللذي لا يُنال جانبه

  """;

  // page 4
  static const String ayahHadithFifteenFour_1 = """

  (مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ) 

""";

  static const String elmTextFifteenFour_1 = """
الإنسان أحياناً يحصل مركزاً معيناً ، أو دخلاً معيناً ، أو تجارة معينة ، أو شأناً معيناً ، أو مكانة معينة ، ربما خاف على هذه المكانة ، هذا المركز ؛ فهو يرفض الحق حفاظاً على مركزه ، هناك عوامل كثيرة يرفضها ، وهناك أشخاص كثيرون يرفضون الدين ، لا كراهية في الدين ، لا لأنهم لم يقتنعوا به ، هم مقتنعون به ، ولكن يتوهمون لضعف إيمانهم أنهم إذا تدينوا ، أو إذا آمنوا ، أو إذا صلوا ، أو إذا تابوا ، أو إذا انضبطوا يخسرون مكانتهم أو مناصبهم ، أو دنياهم العريضة ، أو دخلهم الكبير ،أو مكانتهم في الأرض فهذا الوهم الخطير 
:ربنا عز وجل بدده في هذه الآية قال
""";
  static const String ayahHadithFifteenFour_2 = """

  (مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ) 
فاطر 10 

""";
// page 5
  static const String titleFifteenFive = """
:العزة لا تُنال إلا من الله
""";
  static const String elmTextFifteenFive_1 = """
لا يمكن لما سوى الله أن يمنحك العزة  أية جهة سوى الله  أي إنسان  أي عظيم  أي غني  أي قوي  أية جهة على وجه الأرض لا يُمكن أن تمنحك العزة إلا الله 

كفار قريش لماذا كفروا بمحمد صلى الله عليه وسلم ؟ 
والله الذي لا إله الا هو عرفوه رسولاً كما يعرفون أبنائهم هكذا قال الله عز وجل
""";

  static const String ayahHadithFifteenFive_1 = """

( یَعۡرِفُونَهُۥ كَمَا یَعۡرِفُونَ أَبۡنَاۤءَهُمۡۖ ) 
البقرة 146 

""";

// page 6
  static const String elmTextFifteenSix_1 = """
لماذا كفروا به إذاً حفاظاً على مكانتهم، حفاظاً على زعامتهم، حفاظاً على تجارتهم ، حفاظاً على انصراف الناس لهم  ماالذي حصل فيما بعد 
هل بقيت لهم هذه المكانة ؟ 
هل بقيت لهم هذه العزة ؟ 
ألم يُصرعوا في معارك بدر وأحد والخندق ؟

ألم يقل النبي عليه الصلاة والسلام لهم *
""";
  static const String ayahHadithFifteenSix_1 = """

 يا أَبَا جَهْلِ بنَ هِشَامٍ يا أُمَيَّةَ بنَ خَلَفٍ يا عُتْبَةَ بنَ رَبِيعَةَ يا شيبَةَ بنَ رَبِيعَةَ -خاطبهم بأسمائهم واحدا واحدا - أَليسَ قدْ وَجَدْتُمْ ما وَعَدَ رَبُّكُمْ حَقًّا؟ فإنِّي قدْ وَجَدْتُ ما وَعَدَنِي رَبِّي حَقًّا فَسَمِعَ عُمَرُ قَوْلَ النبيِّ صَلَّى اللَّهُ عليه وسلَّمَ، فَقالَ: يا رَسولَ اللهِ، كيفَ يَسْمَعُوا وَأنَّى يُجِيبُوا وَقَدْ جَيَّفُوا؟ قالَ: وَالَّذِي نَفْسِي بيَدِهِ ما أَنْتُمْ بأَسْمع لِما أَقُولُ منهمْ، وَلَكِنَّهُمْ لا يَقْدِرُونَ أَنْ يُجِيبُوا 
""";

  static const String footerFifteenSix = """
---------------------
الراوي *
 أنس بن مالك | المحدث : مسلم | المصدر : صحيح مسلم
الصفحة أو الرقم : 2874 | خلاصة حكم المحدث : [صحيح] 

  """;
// page 7
  static const String elmTextFifteenSeven_1 = """
التاريخ بين أيدينا ، ماالذي حصل ؟ هؤلاء الذين قاوموا الدعوة ، وكفروا بها ، وكذبوا بها ، وسفهوا النبي الكريم وأصحابه حفاظاً على مكانتهم ، حفاظاً على وجاهتهم ، حفاظاً على تجارتهم ، ماالذي حصل ؟ خسروا بلدهم وشأنهم ألم يقف أبو سفيان في باب عمر بن الخطاب ساعات طويلة فلم يؤذن له ؟ 
وصهيب وبلال يدخلان بلا استئذان ، فلما دخل عليه ، قال: زعيم قريش يقف ببابك ساعات طويلة ، ولا تأذن لي وهذان يدخلان متى يشاءان ، قال له: أنت مثلهما! من أنت أمامهما؟

""";
// page 8
  static const String titleFifteenEight = """
 :طاعة الله سبيل العزة
""";
  static const String elmTextFifteenEight_1 = """
إذا توهم الإنسان أنه بمعصية الله قد يرتفع ، وإذا توهم الإنسان أنه بترك الدين يملك عزة وكرامة فهذا هو عين الجهل هذا كلام واضح كالشمس
""";
  static const String ayahHadithFifteenEight_1 = """

 مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ 
فاطر 10 
""";
  static const String elmTextFifteenEight_2 = """
:وقد قيل
من التمس رضا الله عنه بسخط الناس رضي الله عنه ، وأرضى عنه الناس ، ومن التمس رضا الناس بسخط الله ، سخط الله عليه وأسخط عليه الناس

""";
// page 9
  static const String titleFifteenNine = """
:لا يملك العزة مخلوق
""";
  static const String elmTextFifteenNine_1 = """
لم يقل: فلله العزة ، هناك كلمة أساسية ، وهي جميعا ، العزة كلها من الله ، وما من مخلوق في الأرض يملك هذه العزة ، لا تجد جهة إذا مشيت معها تعطيك عزة ، الأمور بخواتيمها ، الأمور بما تستقر عليه ، طبعاً الله عز وجل جعل امتحانات كثيرة ، جهات أرضية كثيرة تمنحك العزة الظاهرة ، ولكن بعد حين يتخلون عنك ، فلذلك الإنسان الذي مع الحق ، موقفه قوي جداً ، موقعه قوي
أما مع الباطل فهو عرضة لانهيار سريع

  """;
// page 10
  static const String ayahHadithFifteenTen_1 = """
  
  فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ 
""";
  static const String elmTextFifteenTen_1 = """
إذا آمنت بالله كُنت عزيزاً ، وإذا استقمت على أمره كنت عزيزاً ، وإذا عملت الصالحات أحبك الناس فعظموك ، فكنت عزيزاً وإذا اتصلت بالله ، فذقت حلاوة القرب ، استغنيت عن مديح الناس لك، فكنت عزيزاً ، إذا كان عند الإنسان خواء روحي ، عنده جفاف روحي ، أحب أنه يسعد بالناس ، والاستئناس بالناس من علامات الإفلاس ، لما يصير للإنسان صلة بالله عز وجل يستغني بها عن الناس ، يستغني بها عن سقطاتهم ، عن اللقاء بهم لقاء ساذجاً ، وسخيفاً ، لقاءاته كلها تكون مثمرة

""";
// page 11
  static const String elmTextFifteenEleven_1 = """
حينما تؤمن فأنت عزيز ، وحدت ، لا تخاف في الله لومة لائم ، لا تنافق ، لا تكذب ، لا تدلس ، لا تتملق ، لا تخنع ، لا تخضع لما استقمت فما عليك مأخذ ، رافع الرأس دائماً ، قد تكون فقيراً وتحمل الحاجة بيدك ، وأنت رافع رأسك ، وقد تكون في أعلى درجات الغنى ، لكن الدخل مشبوه ، فأنت ذليل إذاً : الإيمان بالله ، الاستقامة على أمره ، والعمل الصالح والاتصال بالله عز وجل ، تُكسب الإنسان عزة
""";
  static const String ayahHadithFifteenEleven_1 = """
قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلۡمُلۡكِ تُؤۡتِی ٱلۡمُلۡكَ مَن تَشَاۤءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَاۤءُ وَتُعِزُّ مَن تَشَاۤءُ وَتُذِلُّ مَن تَشَاۤءُۖ بِیَدِكَ ٱلۡخَیۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ ۝٢٦
ال عمران 26 

  """;
// page 12
  static const String titleFifteenTwelve = """
 :كل شيئ في الكون ملك لله
 """;
  static const String elmTextFifteenTwelve_1 = """
الله جل جلاله ملكه ملك تام  يملك الشيئ خلقاً ، ويملكه تصرفاً ، ويملكه مصيراً
""";
  static const String subtitleFifteenTwelve_1 = """
 :صحتك ملك لله
 """;
  static const String elmTextFifteenTwelve_2 = """
أي شيئ تتمتع به فهو ملك الله عز وجل لك بيت ، عقلك ، أي عضو تتمتع به ملك الله ، أي جهاز تتمتع به ملك الله ، أية خبره تملكها هي ملك لله ، العلم ، الخبرة ، النسب ، الحسب ، الوسامه ، الذكاء ، الحكمة ، الصحة

""";

// page 13
  static const String titleFifteenThirteen_1 = """
 :مكانتك بيد الله
 """;
  static const String elmTextFifteenThirteen_1 = """
مكانتك في المجتمع ملك لله عز وجل
إن كنت تملك مكانة فهي ملك الله ، ملكك إياها  إن كنت تملك محبة الناس ، فمحبة الناس بالهام الله عز وجل
عندك زوجة الله ملكك إياها عندك أولاد ابرار الله ملكك إياهم ، تتمتع بصحة طيبة ، الله ملكك إياها

الأعرابي اللذي بيده قطيع الإبل ، فسُئل عن هذه الإبل ؟ قال : لله في يدي ، وما من كلمة أبلغ من هذه الكلمة ( لله في يدي ) 

بيتك ، واختصاصك ، وحرفتك ، ودكانك ، وزوجتك ، وأولادك ، وسمعتك ، وكرامتك  وراحة بالك ، وحريتك التي تتمتع بها  
لا أجد في اللغة العربية كلمة أوسع من كلمة ( مالك الملك ) ، أي شيئ يُملك فمالكه هو الله

  """;

// page 14
  static const String ayahHadithFifteenFourteen_1 = """

 تُؤۡتِی ٱلۡمُلۡكَ مَن تَشَاۤءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَاۤءُ 
 ال عمران 126 

""";
  static const String elmTextFifteenFourteen_1 = """
فهذا المعنى : إنك إن تمتعت بقوة ، أو إن تمتعت بصحة ، أو إن تمتعت بعقل ، أو إن تمتعت بذكاء ، أو إن تمتعت بخبرة ، أو إن تمتعت بأهل ، أو إن تمتعت بأولاد ، أو إن تمتعت ببيت ، كله من الله ، فكلما تعمقت في الإيمان وجدت أن الله هو كل شيئ ، وأن الله منحك كل شيئ ، وأن الله قادر على أن يسلبك كل شيئ

ربما منعك فأعطاك ، وربما أعطاك فمنعك ، والله عز وجل حكيم ، إذا نزع منك الملك ثم كشفت لك حكمة نزع هذا الملك فينبغي أن تذوب محبة لله ، إن اعطاك الملك فلحكمة ، وإن نزع منك الملك فلحكمة ، قد تكون عقوبة ، والعقوبة نوع من التربية ، وقد تكون وقاية ، والوقاية نوع من التربية ، وقد تكون ابتلاء  والابتلاء رفع درجات ، على كلٍ يجب ان تعتقد أن كل شيئ فعله الله هو محض حكمة ومحض فضل

  """;

// pag 15
  static const String ayahHadithFifteenFifteen_1 = """

 وَتُعِزُّ مَن تَشَاۤءُ وَتُذِلُّ مَن تَشَاۤءُۖ 
ال عمران 126 

""";
  static const String elmTextFifteenFifteen_1 = """
فهذه الدنيا كل حال يزول ، قد تصيب عزاً ، وقد يذل الإنسان ، هذا يحي البرمكي كان الرجل الأول في الدولة العباسية ، إذا هو في السجن يُعذب ، فقال لبعض من حوله " لعل دعوة مظلوم أصابتنا ، ونحن عنه غافلون"

وفرعون كان له ملك مصر
""";
  static const String ayahHadithFifteenFifteen_2 = """

  فَقَالَ أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ ۝٢٤

""";
  static const String elmTextFifteenFifteen_2 = """
تورط ، وتبع سيدنا موسى في البحر ، ثم أدركه الغرق ، ولولا أن الموج لفظه إلى الشاطئ لتوهم أتباعه أنه صعد إلى السماء ، فإمعاناً في إذلاله قذفه الموج إلى الشاطئ  
  """;

// page 16
  static const String ayahHadithFifteenSixteen_1 = """

قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلۡمُلۡكِ تُؤۡتِی ٱلۡمُلۡكَ مَن تَشَاۤءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَاۤءُ وَتُعِزُّ مَن تَشَاۤءُ وَتُذِلُّ مَن تَشَاۤءُۖ 
 ال عمران 126 

""";
  static const String elmTextFifteenSixteen_1 = """
:أجمل مافي الأية ، بحسب السياق
""";
  static const String ayahHadithFifteenSixteen_2 = """
( تؤتي الملك من تشاء) 
( وتنزع الملك ممن تشاء) 
( وتعز من تشاء) 
( وتذل من تشاء) 
""";
  static const String elmTextFifteenSixteen_2 = """
الإذلال شر بمفهوم الأرض كان ينبغي بحسب السياق أن تكون الآية
 بيدك الخير والشر  
:لكن الله عز وجل قال
""";
  static const String ayahHadithFifteenSixteen_3 = """
  ( بيدك الخير ) 
""";
  static const String elmTextFifteenSixteen_3 = """
ماذا يستنبط ؟ يستنبط أن إيتاء الملك خير ، وان نزع الملك خير ، وأن الإعزاز خير ، وأن الإذلال خير
  """;

// page 17
  static const String ayahHadithFifteenSeventeen_1 = """

 سُبۡحَـٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا یَصِفُونَ ۝١٨٠ 
الصافات 180 

""";
  static const String elmTextFifteenSeventeen_1 = """
عزة معنوية ، وعزة مادية ، هو رب العزة ، هو صاحب العزة ، فإذا أردت العزة فكن معه ، إن اردت العزة فلذ بحماه ، إن اردت العزة فاستعذ به

إجعل لربك كُل عزك يستقر ويثبت
     
فإذا اعتززت بمن يموت فإن عزك ميت
 """;
}
