class ElmTextDersTwo {
  // TwoOne
  static const String titleTwoOne_1 = """
العلم والمعرفة
-------------
""";
  static const String ayahHadithTwoOne_1 = """
وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧ 
الأنعام 37 
""";
  static const String elmTextTwoOne_1 = """
انت مع من؟ 
اذا كان اكثرهم لا يعلمون فانت مع من ؟ مع الاكثريه ام مع الاقليه ؟
""";

  // TwoTwo
  static const String ayahHadithTwoTwo_1 = """
قال تعالى 
وَمَا یَتَّبِعُ أَكۡثَرُهُمۡ إِلَّا ظَنًّاۚ 
يونس 36 
قال تعالى 
وَإِن تُطِعۡ أَكۡثَرَ مَن فِی ٱلۡأَرۡضِ یُضِلُّوكَ عَن سَبِیلِ ٱللَّهِۚ
الانعام 116
""";
  static const String elmTextTwoTwo_1 = """
فهل يقبل منك ان تقول هكذا شأن الناس كلهم يااخي ، وانا واحد من الناس ، هكذا التقاليد الان ، هكذا العادات ، هكذا ماتعارف عليه الناس ، هكذا نشأنا يااخي ، هكذا العادات ، هكذا التقاليد ، كل الناس مخطؤن 
""";

  // TwoThree
  static const String ayahHadithTwoThree_1 = """
اقرأ قوله تعالى 
وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧
الأنعام 37 
""";
  static const String elmTextTwoThree_1 = """
يعلمون التجاره والصناعه، والزراعه، وكسب المال وانتهاز الفرص ، واصول الحياة ، وكيف يتنعمون بها ، وكيف يشترون الاجهزه المتنوعه في البيت ، هذا كله يعرفونه ، ولكنهم يجهلون المصير ، يجهلون ساعةيوم يقوم الناس لرب العالمين ، فالعبره ان تعرف الحقيقه كلها لا ان تعرف شطرها 
""";

  static const String ayahHadithTwoThree_2 = """
قال تعالى 
یَعۡلَمُونَ ظَـٰهِرࣰا مِّنَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَهُمۡ عَنِ ٱلۡءَاخِرَةِ هُمۡ غَـٰفِلُونَ ۝٧
الروم 7 
""";
  static const String elmTextTwoThree_2 = """
قد تلتقي بدكتور يحمل شهادة بورد ، ومع ذلك لايعلم عن الاخره شيئا ، يعيش لحظته ، يعيش حياته الدنيا ، لايستطيع أن يفكر ابعد من الموت ، وكانه يضن الموت نهاية الحياه ، ولا شيئ بعد الموت ، هذا ليس علما ، هذه حرفه ، وليس علما ، العلم ان تعرف الحقيقه كلها من كل جوانبها 
""";

  static const String ayahHadithTwoThree_3 = """
قال تعالى 
وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧
الانعام 37 
""";
  static const String elmTextTwoThree_3 = """
لذلك لا تستانس اذا كان الناس جميعا في ضلال يقول لسان حالك انا مثل هؤلاء الناس 
""";

  // TwoFour
  static const String elmTextTwoFour_1 = """
قد تجد عظماء في بيئات متخلفه ، وعلماء في بيئات جاهله ، والانسان اذا اختار شيئاً لن يقف شيئ في طريقه ، وان القرار اللذي يتخذه الانسان في شان مصيره قلما تنقضه الايام إذا كان صادرا حقا عن إراده وإيمان
إنك إذا اردت ان تكون مستقيما في هذا الزمان كنت كذلك ، وكلمة لا استطيع كلمه مضحكه ، لانك قد تفعل اشياء اخرى تبدو مستحيله ، ولكنك بتصميمك عليها فعلتها ، ولو انك صممت على ان تكون مستقيمآ لبلغت الاستقامه ، لو صممت على ان تعرف كتاب الله لعرفته ، لو صممت على ان تصلي قيام الليل لصليته
هذا اللذي لا يعرف إلا الطعام والشراب وكسب المال والإنغماس في الشهوات هذا ميت 
""";

  static const String ayahHadithTwoFour_1 = """
قال تعالى 
أَمۡوَ ٰتٌ غَیۡرُ أَحۡیَاۤءࣲۖ 
النحل 21 
""";
  static const String elmTextTwoFour_2 = """
وهذا اللذي عرف ربه ، واحبه ، واقبل عليه ، وتقرب إليه ، وجعل حياته كلها في طاعته ، وجعل طاقاته كلها مسخره لخدمةعباده هذا الحي
لذلك يقول سيدنا علي 
ياكميل ، مات خزان المال وهم احياء
والعلماء باقون مابقي الدهر 
 اعيانهم مفقوده 
  وامثالهم في القلوب موجوده
كن عالما ، او متعلما ، او مستمعا ، او محبا
ويظل المرء عالما ماطلب العلم ، فإذا ضن انه قد علم فقد جهل
""";

  // TwoFive
  static const String elmTextTwoFive_1 = """
الحياة متعبه ، فيها مزالق وفيها مواقف حرجه  وفيها متاهات ، فيها ظنون ، وفيها فساد ، فإن لم يعتصم الإنسان بالإيمان الصحيح فسوف يضيع مع الناس ، سوف تنزلق قدمه ، سوف تزل قدمه ، وتهوي به في مكان سحيق
""";
  static const String elmTextTwoFive_2 = """
وبالعلم لاتبقى لدى المؤمن وسوسه ، ولا هم ، ولا حزن ، ولا ضيق ، ولا قلق ، ولا يأس ، ولا شيء من هذا القبيل ، هذا التمزق الداخلي ، انفصام الشخصيه ، الخور ، الضعف ، الخنوع ، هذه الامراض اللتي فتكت بالناس ، ونحن مع ماعندنا من ايمان ، مع قرائتنا لكتاب الله في نعمة كبيره 
إن قارئ القرآن لا يحزن ، فلا يمكن ان تحزن إذا قرات القرآن بشكل صحيح وفهم لآياته واضح ، إذا كنت تقرؤه ، وتعقله ، وتفهمه ، وتطبقه ، لايمكن ان تحزن 
""";
  static const String ayahHadithTwoFive_1 = """
قال تعالى 
فَإِنَّكَ بِأَعۡیُنِنَاۖ
الطور 48 
""";
  static const String elmTextTwoFive_3 = """
مع قرائتنا لكتاب الله وفهمه الفهم الصحيح يقوى الايمان ، ومن علامات الايمان التوكل على الله ، والتفويض لأمر الله ، والتسليم لقضاء الله ، والرضا بقضاءالله ، توكل ، وتفويض ، وتسليم ، ورضا
""";
  static const String ayahHadithTwoFive_2 = """
قالو لأبي الدرداء *
يا أبا الدرداء لقد احترق دكانك ، قال : ماكان الله ليفعل ، يا أبا الدرداء لقد احترق دكانك ، قال: ماكان الله ليفعل ، إلى ان جاءه الخبر الصحيح ، لم يحترق دكانك ، قال: اعلم ذلك  فهو مطمئن ، فقد فوض امره إلى الله سبحانه ، وتوكل عليه ، ثم غادر دكانه ، فكان الله خليفته في حفظ دكانه
""";
  static const String elmTextTwoFive_4 = """
وإذا امنت بالله ورسوله يؤتك كفلين من رحمته  اي ضمانه في الدنيا وضمانه في الآخره ، ويجعل لك نورا تمشي به في الناس ، يريك الخير من الشر
""";

  // TwoSix
  static const String elmTextTwoSix_1 = """
الإنسان بلا علم كالبهيمه تماما ، الإنسان بلا علم إلى أن يكون حيواناً أقرب منه من أن يكون إنساناً، يأكل ، ويشرب ، وينام ، ويعطي نفسه ماتشتهي ، ويتكلم مايحلو له ، فيؤذي ويفرق ، ويخرب البيوت، وهو لايدري ماذا يفعل ، يتمحور حول ذاته ، يجر الأمور نحو مصلحته، يعيش على أنقاض الآخرين، يبني مجده على رفاتهم، يبني غناه على فقرهم، يبني سعادته على شقائهم، يبني حياته على موتهم، يبني أمنه على قلقهم، الإنسان من دون علم ومن دون هدى يدمر نفسه، ويدمر مجتمعه، يدمر ذاته، ويدمر الآخرين، لا تعنيه إلا ذاته 
""";
  static const String elmTextTwoSix_2 = """
احيانا تصاب النفس بالقلق، تصاب بالخوف، تصاب بالشعور بالقهر احيانا
إن هذه الأحاسيس المدمره، هذه المشاعر المقلقه، وهذا الإختلال في توازن الإنسان، هذا كله سببه الجهل، يأتي القرآن فيطمئن، نضرب على هذا امثله كثيره
""";
  static const String ayahHadithTwoSix_1 = """
قال تعالى 
مَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَلَنُحۡیِیَنَّهُۥ حَیَوٰةࣰ طَیِّبَةࣰۖ وَلَنُجۡزِیَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُوا۟ یَعۡمَلُونَ ۝٩٧
النحل 97 
""";
  static const String elmTextTwoSix_3 = """
هذا نص قرأني، هذا كلام رب العالمين، يجب ان يبدد هذا الكلام كل خوف، كل قلق، كل شعور بالمستقبل المظلم، يجب ان يبدد هذا القول وهو كلام رب العالمين كل شعور بالظلم، كل شعور بأن الحياة تحتاج إلى إنسان شرس، إلى إنسان قوي ..لا 
""";
  static const String ayahHadithTwoSix_2 = """
مَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنَحْيِيَنَّهُ حَيَاةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُم بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ
[النحل: 97]
أَمۡ حَسِبَ ٱلَّذِینَ ٱجۡتَرَحُوا۟ ٱلسَّیِّءَاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَوَاۤءࣰ مَّحۡیَاهُمۡ وَمَمَاتُهُمۡۚ سَاۤءَ مَا یَحۡكُمُونَ ۝٢١
الجاثية 21 
""";
  static const String elmTextTwoSix_4 = """
انتهى الامر الله عز وجل يعجب ! أيعقل ياعبادي ان اعامل المسيئ كالمحسن؟! ان اعامل من عرفني كمن لا يعرفني ؟ ايعقل هذا ؟ 
""";

  // TwoSeven
  static const String elmTextSeven_1 = """
اذا عرفت الله عز وجل وانه بيده كل شيئ ، وأن الأمر كله إليه ، وانه اليه ترجع الأمور كلها ، وانه بيده ملكوت السماوات والأرض ، وانه ما من دابه إلا هو آخذ بناصيتها ، وهو يحكم لا معقب لحكمه ، وهو لطيف لما يشاء ، وان الخير منه ، والشر بتقديره من الإنسان كسبا  ومن الله فعلآ ، 
 إذا قرأ الإنسان القرآن وفهمه الفهم الصحيح وطبقه انقلبت نفسه إلى نفس هانئه ، وادعه ، مطمئنه ، واثقة برضاء الله عز وجل، واثقة من عدالته، واثقة برحمته، تعرف ان هذه الحياة قصيرة، طبيعتها الإبتلاء طبيعتها الإمتحان وأن الحياة الحقيقية حياة الآخرة وان هذه الدنيا دار ابتلاء وان الآخرة دار عطاء هذه الدنيا دار تكليف، وان الآخرة دار تشريف اذا عرف هذه المعاني رضي بدخله رضي بزوجته رضي بأولاده رضي بكل شيء لانه يرى هذا كله بتخطيط من علي
 """;

  static const String titleTwoSeven_1 = """
 فضل العلم وأهله
  """;

  static const String elmTextSeven_2 = """
   العلم هو القيمة الوحيدة المرجحة التي أعتمدها القرآن الكريم، فالشيئ الذي يرفعك هو العلم، والشيئ الذي يخفضك هو الجهل، وأي شيئ آخر عَرَضٌ زائل يأتي ويذهب، ولا قيمة له، لا يرفع صاحبه ولا يخفضه، قد يكون الإنسان عند الله في أعلى عليين وهو فقير، وقد يكون في أعلى عليين وهو مريض، وقد يكون في أعلى عليين ونسبه غير معروف، وقد يكون في أعلى عليين وليس جميل الصورة.
 بعض التابعين كان قصير القامة، أسمر اللون، أحنف الرجل، مائل الذقن، ناتئ الوجنتين، ضيق المنكبين، ليس شيئٌ من قبح المنظر إلا وهو آخذٌ منه بنصيب، وكان مع ذلك سيد قومه، إذا غضب غضب لغضبته مئة ألف سيفٍ؛ لا يسألونه فيم غضب؟ وكان إذا علم أن شُرب الماء يفسد مروءته ما شربه، فلا شكلُك، ولا مالك، ولا نسبك، ولا صحتك، ولا قوتك تغني عنك من الله شيئاً، ولكن العلم وحده هو الذي يرفع
""";

  static const String ayahHadithTwoSeven_1 = """
         ولقد أتينا داوود وسليمان علما 
""";

  // TwoEight
  static const String titleTwoEight_2 = """
 الصفة الفارقة بين الإنسان والحيوان هي العلم 
 """;

  static const String elmTextTwoEight_1 = """
 يقول الإمام الغزالي: الإنسان شريفٌ لما خُلق له، فلو افتخر بحجمه فالجمل أكبر منه، ولو افتخر بعِظمه فالفيل أعظم منه.. أي أكثر عظماً منه
  ولو افتخر بشجاعته فبعض السباع أشجع منه، ولو افتخر بسفاده بعض الطيور الوضيعة أكثر سفاداً منه.. أي جماعاً.. ولو أفتخر بشكله الجميل فبعض الحيوانات أجمل منه
 ما من صفةٍ يمكن أن تفتخر بها إلا وفي الحيوان ما هو أشد اتصافاً بهذه الصفة من الإنسان
 إذا افتخر بحدة بصره، فأي طائر يرى ثمانية أمثال ماتراه أنت، إذا افتخر برهافة سمعه فهناك حيواناتٌ حقيرةٌ جداً في نظر الناس أشد سمعاً من الإنسان، إذا افتخر مثلاً بقوة شمِهِ، فبعض أنواع الكلاب قوة شمِهِ مليون ضعف عن قوة شم الإنسان، ما من صفةٍ، ولا حاسةٍ، ولا شيئٍ يمكن أن يفتخر به الإنسان إلا وفي الحيوان ما تفوق عليه، إلا أن الإنسان خُلق ليعرف الله عز وجل، وأعطي العلم، أنت يمكن أن تفتخر، أو يمكن أن تقول: أنا، إذا كنت عالماً، لأن الله سبحانه وتعالى قال 
 الله الذي خلق سبع سماوات ومن الأرض مثلهن يتنزل الأمر بينهن لتعلموا أن الله على كل شيئٍ قدير وأن الله قد أحاط بكل شيءٍ علما 
 فالعلم علة السماوات والأرض 
 """;

  static const String ayahHadithTwoEight_1 = """
 خلقت السماوات والأرض ولم أعي بخلقهن أفيعييني رغيفٌ أسوقه لك كل حين؟! خلقت السماوات والأرض من أجلك فلا تتعب وخلقتك من أجلي فلا تلعب، فبحقي عليك لا تتشاغل بما ضمنته لك عما افترضته عليك 
""";

  static const String elmTextTwoEight_2 = """
 كل الكون مسخر من أجل الإنسان، والإنسان خُلق من أجل أن يعرف الله عز وجل، لذلك كما قال الإمام الغزالي الإنسان شريف لما خُلق له، لماذا خلقت أنت؟ خُلقت في هذه الدنيا كي تعرف الله عز وجل، فإذا عرفته عبدته، وإذا عبدته سعدت بقربه 
""";

  static const String ayahHadithTwoEight_2 = """

         إلا من رحم ربك ولذلك خلقهم 
 
 آية صريحة واضحة محكمة كالشمس الساطعة 
 
         إلا من رحم ربك ولذلك خلقهم 

 طلب العلم فريضة على كل مسلم 
""";

  // TwoNine
  static const String titleTwoNine_1 = """
 الصفة الفارقة بين الإنسان والحيوان هي العلم 
 """;

  static const String elmTextTwoNine_1 = """
 لذلك العلم ليس شيئاً نأخذه أو لا نأخذه، ليس شيئاً نتزينُ به أو نستغني عنه، ليس حرفة أخترناها أو اخترنا غيرها، لا، العلم كما قال عليه الصلاة والسلام في الحديث الصحيح المتواتر 
""";

  static const String ayahHadithTwoNine_1 = """
         طلب العلم فريضة على كل مسلم 
""";

  static const String elmTextTwoNine_2 = """
 لذلك العلم ليس شيئاً نأخذه أو لا نأخذه، ليس شيئاً نتزينُ به أو نستغني عنه، ليس حرفة أخترناها أو اخترنا غيرها، لا، العلم كما قال عليه الصلاة والسلام في الحديث الصحيح المتواتر 
""";
  static const String ayahHadithTwoNine_2 = """
         طلب العلم فريضة على كل مسلم 
""";
  static const String titleTwoNine_2 = """
 العلم هو الطريق الموصل إلى الله 
 """;
  static const String elmTextTwoNine_3 = """
   هنا يوجد سؤال دقيق: لماذا هذا الإنسان تصرف على نحو ماجاء بالآية التالية 
 وإذا مس الإنسان ضر دعا ربه منيباً إليه ثم إذا خوله نعمة منه نسي ما كان يدعو إليه من قبل وجعل لله أنداداً ليضل عن سبيله
 الله قال له عندما ضل بالنعمة التي أولاه الله اياها 
 """;
  static const String ayahHadithTwoNine_3 = """
 قل تمتع بكفرك قليلاً إنك من اصحاب النار 
""";
  static const String elmTextTwoNine_4 = """
 ولماذا الثاني هذا شأنه مع الله سبحانه 
 أم من هو قانت اناء الليل ساجداً وقائماً يحذر الآخرة ويرجو رحمة ربه 
 فما الذي جعل الأول في هذه الحال المتناقضة المُزرية، وجعل الآخر في هذه الإنابة والإحتيال والخوف والرجاء؟ جاء الجواب 
 """;
  static const String ayahHadithTwoNine_4 = """
 قل هل يستوي الذين يعلمون والذين لا يعلمون 
""";

  // twoTen
  static const String elmTextTwoTen_1 = """
 معنى هذا أن العلم طريق وحيد إلى الله عز وجل، العلم هو الطريق الموصل إلى الله 
""";

  static const String ayahHadithTwoTen_1 = """
         كذلك إنما يخشى الله من عباده العلماء 
""";
  static const String elmTextTwoTen_2 = """
 المثوبة من دون علم مستحيلة لذلك العلم طريق وحيد إلى الله عز وجل 
 هذا الإنسان الضال، الشارد، تأتيه الدنيا فيرقص، تذهب عنه فينتحر مثلاً، يكشف الله عنه المصيبة فينسى أنه دعا ربه، ويكفر، ويشرك، ويضل نفسه عن سبيل الله، كل هذه الأمراض الوبيلة في عقيدته، في سلوكه، أساسها أنه لا يعلم؛ وهذا الإنسان القانت آناء الليل، الساجد، القائم، الذي يحذر الآخرة، ويرجوا رحمة الله عز وجل لأنه يعلم، إذاً إذا أردت أن تكون من الذين رضي الله عنهم، من الذين استقاموا على أمره، من الذين أنابوا إليه، من الذين وقفوا عند حدوده، من الذين باعوا أنفسهم في سبيله، فعليك بالعلم 
 المشكلة الملحة أن الإنسان الشارد كيف يتوب؟ إذا كان مقتنعاً بأن سلوكه الضال صحيح، وليس لديه معصية، فهذا لا يتوب لماذا؟ لأنه لا يعلم، أجل لا يتوب إلا إذا تعلم أن هذا العمل مخالف للشرع، معنى هذا أن حتى التوبة من دون علم مستحيلة، أحياناً تلتقي مع أشخاص غارقين بالمعاصي ويقولون: ماذا فعلنا؟ هكذا كل الناس، من قال لك أنا غلطان؟ فهذه مشكلة مدمرة بالنسبة له، هو لا يدري ولا يدري أنه لا يدري، لذلك العلم طريق وحيد إلى الله عز وجل، ما في طريق ثان إلا العلم 
""";
  static const String ayahHadithTwoTen_2 = """
 قل هل يستوي الذين يعلمون والذين لا يعلمون
""";

  static const String elmTextTwoTen_3 = """
 العلم المقصود هو العلم بالكليات الذي يقودنا لمعرفة الله ومعرفة منهجه وسر وجوده 
 بالمناسبة: بعض التفاسير فيها إشارة لطيفة إلى أن العلم الذي أراده الله هنا ليس العلم بالجزئيات، أحياناً تجد شخصاً يحمل دكتوراه بالفيزياء، فهل يعلم بنص هذه الآية، إن العلم إذا لم يأخذ بك إلى طاعة الله ليس علماً، العلم المقصود هنا العلم بالكليات، العلم الذي يقودك إلى معرفة الله، ومعرفة منهجه، ومعرفة سر وجوده، ومهمتك في الحياة، العلم الذي يحملك على طاعة الله هو العلم المطلوب، فليس كل إنسان نال شهادة عُليا، اختصاص معين، صار عالماً حسب نص هذه الآية 
""";
  static const String ayahHadithTwoTen_3 = """
 قل هل يستوي الذين يعلمون والذين لا يعلمون
""";

  // TwoEleven (moved up)
  static const String titleTwoEleven_1 = """
️أصول مهمة
""";
  static const String elmTextTwoEleven_1 = """
أصل الدين معرفة الله 
وأصل العبادة معرفة الشرع 
وأصل صلاح الدنيا معرفة طبائع الأشياء 
فهذه العلوم المادية التي إذا ذُكرت ظنها الناس هي العلم ولا علم سواها؛ الرياضيات، والفيزياء، والكيمياء، والفلك، وعلم النفس، وعلم الإجتماع، يظُن الناس أن هذه العلوم وحدها هي العلم، هذه بعض أنواع العلم، هذا علمٌ بالخليقة، وهناك علمٌ بالشريعة، هناك علمٌ بالحقيقة، هناك علمٌ بالله، هناك علمٌ بأمره، هناك علمٌ بخلقه، هذه العلوم المادية المحسوسة التجريبية يمكن أن ترفع مستوى معيشتنا، يمكن أن تطوع لنا الحديد، يمكن أن تختصر لنا الزمن، يمكن أن تقرب المكان، ولكنها لا تسعدنا، لا يمكن أن تسعدنا لأنها حرفةٌ من الحرف، أما العلم الذي يسعدك فهو العلم بالله عز وجل 

️إذا أردت الدنيا فعليك بالعلم، وإذا أردت الآخرة فعليك بالعلم، وإذا أردتهما معاً فعليك بالعلم، والعلم لا يعطيك بعضه إلا اذا أعطيته كلك، فإذا أعطيته بعضك لم يعطك شيئاً، ويظل المرء عالماً ما طلب العلم، فإذا ظن أنه قد علم فقد جهل 

️طالب العلم يؤثر الآخرة على الدنيا فيربحهما معاً، بينما الجاهل يؤثر الدنيا على الآخرة فيخسرهما معاً
""";

  // TwoTwelve (was Eleven)
  static const String titleTwoTwelve_1 = """
وقفة
-----
""";
  static const String ayahHadithTwoTwelve_1 = """
وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدۡرِهِۦ
""";
  static const String elmTextTwoTwelve_1 = """
أي ماعظموه حق تعظيمه، ما عرفوه حق معرفته، كل اخطائهم، وكل شركهم، وكل إنحرافهم، وكل معاصيهم بسبب نقص معرفتهم

حقيقة تقول: نقص المعرفه يقابله إنحراف السلوك، ما من سلوك منحرف، ما من إنسان وقع في مخالفات، ما من إنسان قصر في أداء واجب، ما من إنسان وقع فيما حرم الله إلا بسبب نقص معرفته، فهناك علاقة طردية بين العلم وبين السلوك
""";

  // TwoThirteen (was Twelve)
  static const String titleTwoThirteen_1 = """
وقفة
---
️النشاط العقلي والنفسي والسلوكي 
""";
  static const String elmTextTwoThirteen_1 = """
لا بد لك من نشاط عقلي، ونشاط نفسي، ونشاط سلوكي، فالنشاط العقلي يعني أن هذا العقل غذاؤه العلم، لا بد من طلب العلم، لا بد من تفكر في خلق السماوات والأرض، لا بد من نظر في افعال الله عز وجل، لا بد من تلاوة القرآن، لا بد من فهمه، إنه كتابنا الأول، هذا جانب عقلي 
""";
  static const String subtitleTwoThirteen_1 = """
الجانب النفسي: لا بد من ذكر الله 
""";
  static const String ayahHadithTwoThirteen_1 = """
الا بذكر الله تطمئن القلوب 
""";
  static const String subtitleTwoThirteen_2 = """
الجانب السلوكي: لا بد من استقامة على أمر الله 
""";
  static const String ayahHadithTwoThirteen_2 = """
فاستقم كما أمرت ومن تاب معك 
""";
  static const String titleTwoThirteen_2 = """
️قد ينسى المرء بعض العلم بالمعصية 
""";
  static const String elmTextTwoThirteen_2 = """
شكوت إلى وكيعٍ سؤ حفظي 
فارشدني إلى ترك المعاصي 
وأنبأني بأن العلم نورٌ 
ونور الله لا يُهدى لعاصي 

لاتُعصه في النهار، يوقظك في الليل، قد ينسى المرء بعض العلم بالمعصية فالمعاصي تُنسي، فكتاب الله عز وجل مهما يكون واضحاً لديك، إذا خالفتهُ تنساهُ، وتصبح في حجاب عنه
""";
}
