class ElmTextDersEight {
  static const String elmTextDersEigtht1 = """
الخاطرة الثامنة
المعيه الإلهيه
---------------------

""";

  static const String elmTextDersEigtht2 = """
الشعور أن الله معك شعور لا يقدر بثمن

طبعا الله مع كل إنسان، هذه عامه لا ميزه فيها للإنسان 

قال تعالى *
وَهُوَ مَعَكُمۡ أَیۡنَ مَا كُنتُمۡۚ
---------------------
الحديد 4 *

""";

  static const String elmTextDersEigtht3 = """
أما المعيه الخاصه 

قال تعالى * 
 وَٱعۡلَمُوۤا۟ أَنَّ ٱللَّهَ مَعَ ٱلۡمُتَّقِینَ ۝١٩٤

قال تعالى ** 
 وَٱللَّهُ مَعَ ٱلصَّـٰبِرِینَ ۝٢٤٩

قال تعالى ***
 إِنَّ ٱللَّهَ مَعَ ٱلَّذِینَ ٱتَّقَوا۟ وَّٱلَّذِینَ هُم مُّحۡسِنُونَ ۝١٢٨

هذه معيه خاصه ، معية الحفظ ، معية التوفيق ، معية العطف ، والرعايه ، والنصر ، والتأييد

فالبطل هو اللذي يجتهد ليستحق أن يكون الله معه

---------------------
البقرة  194 *
البقرة 153 **
النحل 128 ***
""";


  static const String elmTextDersEigtht4 = """
العوام يقولون: خاطرك ، الله معك

هذه العباده كلمة( الله معك ) ليست قليله

إجتهد كي تستحق أن يكون الله معك ، فإذا كان الله معك فلا تخش بأسا ، موسى طفل صغير لا زال في المهد 
 
 قال تعالى *
 فَأَلۡقِیهِ فِی ٱلۡیَمِّ 
---------------------
  القصص 7 *
  """;

  static const String elmTextDersEigtht5 = """
  فَإِذَا خِفۡتِ عَلَیۡهِ 
  
إذا خفت: أي ساورك خوف وقلق عليه فألقيه في اليم

رسولنا الكريم وهو مختبئ في الغار ماذا قال لصاحبه
 
 قال تعالى *
 لَا تَحۡزَنۡ إِنَّ ٱللَّهَ مَعَنَاۖ 
---------------------
التوبة 40 *
""";

  static const String elmTextDersEigtht6 = """
ماذا اراد كفار قريش ؟ ارادو قتل النبي صلى الله عليه وسلم ، أخرجوه ، قاتلوه ، حاربوه ، فلما شاهدهم النبي صلى الله عليه وسلم في بئر في بدر قال: ( ياعتبة بن ربيعه يا أميه بن خلف ، يا شيبه بن ربيعه ، خاطبهم بأسمائهم واحدآ تلو الآخر ، لقد كذبتموني وصدقني الناس ، هل وجدتم ماوعد ربكم حقآ ؟ فإني وجدت ماوعدني ربي حقا ، لقد كذبتموني وصدقني الناس ، وكفرتم بي وآمن بي الناس ، وخذلتموني ونصرني الناس ، فقالوا: أتخاطب قومآ جيفوا ؟ 
قال: ما أنتم بأسمع لي منهم
---------------------

  """;

  static const String elmTextDersEigtht7 = """
خلاصةالخلاصه: عندما تكون مستقيما تصيبك العنايه الإلهيه

البطوله أن تكون على المنهج ، لإنك إن لم تكن على المنهج الصحيح فإن أقرب الناس إليك يقضي عليك ، أقرب الناس إليك يتنكر لك ، لإن كل من حولك بيد الله عز وجل ، فلذلك الإنسان العاقل لا ينجيه من الله إلا أن يكون مع الله

---------------------

  """;

  static const String elmTextDersEigtht8 = """
لاينجيه من الله إلا أن يكون وقافا عند أمر الله ، أما ذكاؤه ، حيلته ، خبرته ، قوته ، جمعه ، هذا كله لا قيمة له عند الله عز وجل ، لإنه يؤتى الحذر من مأمنه ،  *وعلى نفسها جنت براقش ، وإذا اراد الله إنفاذ أمر أخذ من كل ذي لب لبه ، فإذا أراد الله أن يكرمك ألقى حبك في قلوبهم ، وإذا أراد أن يؤدبك ألقى البغض والشك في قلوبهم ، فإذا هم يتنكرون لك
---------------------
* قصة المثل
يقال أن براقش كانت كلبة، وقد أغار قوم على قومها، فنبحت، فنبهت قومها، فقاموا، وذهبوا إلى مغارة؛ ليختبوا فيها، وعندما جاء اللصوص أخذوا يبحثون عن أهل القرية، ولم يجدوا أحد، وعندما هموا بالانصراف نبحت الكلبة براقش، فانتبه لها اللصوص، فقتلوا عددا من قومها، وقتلوها أيضا، فقيل: جنت على أهلها براقش


 """;
  static const String elmTextDersEigtht9 = """
فإذا كنت بطلا فكن مع القوي ، والله هو القوي ، الله أبدي سرمدي قوي فكن معه ليكن معك
---------------------
 """;
}
