class ElmTextDersSeven {
  static const String elmTextDersSeven1 = """
   الخاطرة السابعة
(  التوكل على الله  )
---------------------
""";

  static const String elmTextDersSeven2 = """
التوكل على الله يضفي على حياة الإنسان أمنآ ، إن الله يعطي الذكاء والمال والجمال للكثيرين من خلقه ، ولكنه يعطي السكينه بقدر لأصفيائه المؤمنين ، والمتوكل في نعيم وطمأنينه ، 
---------------------
""";

  static const String elmTextDersSeven3 = """
المتوكل لو يعلم ملوك الأرض ماعليه من السعادة لقاتلوه عليها بالسيوف

قال تعالى *
فَكِیدُونِی جَمِیعࣰا ثُمَّ لَا تُنظِرُونِ ۝٥٥
إِنِّی تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّی وَرَبِّكُمۚ مَّا مِن دَاۤبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِیَتِهَاۤۚ إِنَّ رَبِّی عَلَىٰ صِرَ ٰطࣲ مُّسۡتَقِیمࣲ ۝٥٦

قال تعالى **
إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ عَلَیۡهِ تَوَكَّلۡتُۖ وَعَلَیۡهِ فَلۡیَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ ۝٦٧
---------------------
هود 55 *
يوسف 67 **
  """;

  static const String elmTextDersSeven4 = """
لك قضيه عند إنسان ترى هل يوافق أم لا يوافق ؟!
إن الحكم إلا لله ، إن كانت خيرآ لك ألهمه الله أن يوافق ، وإن كانت ليست كذلك ألهمه ألا يوافق وأخترع حجة واهيه لعدم الموافقه لإن الحكم إلا لله

لكل شيئ حقيقه ومابلغ عبد حقيقة الإيمان حتى يعلم أن ما أصابه لم يكن ليخطئه ، وما أخطأه لم يكن ليصيبه
---------------------
""";

  static const String elmTextDersSeven5 = """
لذلك عزيزي القارئ اطمئن فإن الله يعلم كيد الكائدين

انت ايها الأخ الكريم إذا كان هناك من يدبر لك كيدآ يكفيك طمأنينه ، ويكفيك ثقه بالله عز وجل أن الله عليم بهذا الكيد
---------------------

""";

  static const String elmTextDersSeven6 = """
لذلك قال بعضهم: كفاك نصرا على عدوك أنه في معصية الله ، مهما كاد لك ، ومهما دبر لك إن هذا الكيد بعلم الله ، إن هذا الكيد سوف يحبطه الله عز وجل 

قال تعالى *
إِنَّهُمۡ یَكِیدُونَ كَیۡدࣰا ۝١٥
وَأَكِیدُ كَیۡدࣰا ۝١٦

قال تعالى **
۞ إِنَّ ٱللَّهَ یُدَ ٰفِعُ عَنِ ٱلَّذِینَ ءَامَنُوۤا۟ۗ 

قال تعالى ***
إِنَّ رَبِّی بِكَیۡدِهِنَّ عَلِیمࣱ ۝٥٠
---------------------
الطارق 15 *
الحج 38 **
يوسف 50 ***
""";

static const String elmTextDersSeven7 = """
قال تعالى *
وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا ۝٨١

لأن معركة الحق والباطل معركة أزلية أبدية ، مادام هُناك حق هُناك باطل ، ومادام هناك حق وباطل فهناك صراع بينهما ، 
فإذا أتبعت منهج الله عز وجل ربما عاداك أقرب الناس إليك ، يمكن أن تكون زوجتك ، يحرجك من كلامها : تقول ماكنت هكذا ، أنت تغيرت ، ماهذا التشدد ؟ يمكن أن يكون أولادك ، ألا يتحملوا ، وكذلك جيرانك ، شركاؤك ، وأقرب الناس إليك ، فعندما يفهم الإنسان الإسلام فهماً اجتماعياً ، عواطف دينية فقط ، فالقضية سهلة ومحتملة ، أما حينما يطبق الإسلام تطبيقاً حقيقياً ينشأ من هذا التطبيق المتضررون ، المعارضون ، فينشأ حوله مشكلة ، فإذا أراد الإنسان طاعة الله عز وجل فلا يتوقع أن الطريق ورود ، بل يتوقع أن الطريق فيه متاعب وأشواك
---------------------
النساء 81 *
 """;
static const String elmTextDersSeven8 = """
إذا كنت في شركة ، وأردت أن تطبق أمر الله عز وجل ، الشركاء لا يرضون عن ذلك ، هنالك ارباح طائلة سيجنيها الشركاء من بعض الأساليب غير المشروعة في كسب المال ، 
فإذا قلت : أنا لا أوافق على هذا الشيئ ، فبالطبع تنتهي الشراكة ، ويتفاصل الشركاء ، فدائماً وطن نفسك أن طاعة الله لها ثمن ، ولا يمكن أن تجمع بين الدنيا والأخرة ببساطة ، 
هذا ليس تشاؤماً ، ولكن من طبيعة الأمور أنك إذا أردت أن تقيم منهج الله عز وجل فهناك معارضون ، هناك متضررون ، هناك من يُسفه هذا الاتجاه ، هناك من يقف في طريقك ، هناك من يكيدُ لك 
---------------------
 """;
static const String elmTextDersSeven9 = """
لذلك ربنا سبحانه وتعالى يطمئنك 
وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا ۝٨١

فإذا كان الله معك فمن عليك وإذا كان عليك فمن معك ؟ 

لذلك ورد في بعض الاحاديث أنه **

 إذا أردت ان تكون اقوى الناس فتوكل على الله ، إذا أردت أن تكون اكرم الناس فاتق الله ، إذا أردت أن تكون أغنى الناس فكن بما في يدي الله أوثق منك بما في يديك
---------------------
النساء 81 *
* لم اجد له تخريج في كتب الحديث
 """;
static const String elmTextDersSeven10 = """
:وورد في الحديث القدسي
 ما من مخلوق يعتصم بي من دون خلقي أعرف ذلك من نيته ،
 فتكيده أهل السماوات والأرض إلا جعلت له من بين ذلك مخرجاً ، 
 وما من مخلوق يعتصم بمخلوق دوني أعرف ذلك من نيته ،
  إلا جعلت الأرض هوياً تحت قدميه وقطعت أسباب السماء بين يديه
---------------------

 """;
static const String elmTextDersSeven11 = """ 
وقفة
 وَكَفَىٰ بِٱللَّهِ وَلِیࣰّا وَكَفَىٰ بِٱللَّهِ نَصِیرࣰا ۝٤٥

ولياً : يتولى اموركم ، ونصيرا : ينصركم على اعدائكم

وتوكل على الله وكفى بالله وكيلا

إذا توكلت على الله كفاك به وكيلا ، فهو القوة المطلقة في الكون ، الله عز وجل قدرته مطلقة

قال تعالى **
وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰتِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا ۝١٣٢

كأن الله سبحانه وتعالى يريد أن يطمئننا ، وهؤلا الذين يضعف ايمانهم في هذه الأيام العصيبه يرون أن الأرض ليست بملك الله عز وجل ، يملك أناس بلغو ذروة القوة ، وفرضوا إرادتهم على كل الشعوب ، وأنهم آلهة الارض ، وهذا يبعث في النفس القلق والخوف والضجر ، بينما الموحد متوازن ، والبطوله أن توحد في مثل هذه المحن
لا في الرخاء ، في الرخاء جميع الناس موحدون ، ولكن الموحد الحقيقي هو الذي حينما تشتد المحن يبقى متيقناً أن الامر بيد الله
 
 قال تعالى ***
 یَدُ ٱللَّهِ فَوۡقَ أَیۡدِیهِمۡۚ
---------------------
النساء 45 *
النساء 132 **
الفتح 10 ***
""";
static const String elmTextDersSeven12 = """ 
في زحمة المحن الإسلاميه ينسى المسلمون أن الأمر بيد الله ، يقعون في شرك خفي ، يرون أن الأمر بيد وحيد القرن ، فمن رضي عنه سلم ، ومن لم يرض عنه عطب وهلك ، هذا التفكير وحده يحطم الإنسان ، الله عز وجل خلقك ولا يمكن أن يسلمك لأحد : 

:قال تعالى *
s فَكِیدُونِی جَمِیعࣰا ثُمَّ لَا تُنظِرُونِ ۝٥٥
إِنِّی تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّی وَرَبِّكُمۚ مَّا مِن دَاۤبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِیَتِهَاۤۚ إِنَّ رَبِّی عَلَىٰ صِرَ ٰطࣲ مُّسۡتَقِیمࣲ ۝٥٦

---------------------
هود 55 *
""";
static const String elmTextDersSeven13 = """ 
 وَإِن جَنَحُوا۟ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا 

لا تقُل : موقف تمثيلي ، ثم ينقضون علينا ، الله معك ، ولن يخذلك ، لا تكن داعية حرب ، كُن داعية سلم

قال تعالى *
۞ وَإِن جَنَحُوا۟ لِلسَّلۡمِ فَٱجۡنَحۡ لَهَا وَتَوَكَّلۡ عَلَى ٱللَّهِۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ ۝٦١

إن الله هو سميع وعليم ، إن تكلمت فهو سميع ، وإن اضمرت شيئاً فهو عليم ، لاتخاف ، إذا كان الله معك فمن عليك ؟ وإذا كان عليك فمن معك ؟
---------------------
الأنفال 61 *
""";
}
