class ElmTextDersFour {
  static const String elmTextDersFour1 = """
الخاطرة الرابعة 
المحبة الإلهية
---------------------

""";

  static const String elmTextDersFour2 = """
عزيزي القارىء أتريد أن يحبك الله؟ 
أتحب أن تعرف الله من يحب؟ 
---------------------

""";

  static const String elmTextDersFour3 = """
افتح القرآن واقرأ الآيات في مواضع كثيرة ومتفرقة 

قال تعالى *
إِنَّ ٱللَّهَ یُحِبُّ ٱلتَّوَّ ٰبِینَ وَیُحِبُّ ٱلۡمُتَطَهِّرِینَ ۝٢٢٢

قال تعالى **
بَلَىٰۚ مَنۡ أَوۡفَىٰ بِعَهۡدِهِۦ وَٱتَّقَىٰ فَإِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُتَّقِینَ ۝٧٦

قال تعالى ***
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُحۡسِنِینَ ۝١٩٥

قال تعالى ****
وَٱللَّهُ یُحِبُّ ٱلصَّـٰبِرِینَ ۝١٤٦

قال تعالى *****
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُتَوَكِّلِینَ ۝١٥٩  

قال تعالى ******
إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُقۡسِطِینَ ۝٤٢

---------------------
البقرة 222 *
ال عمران 76  **
البقرة 195    ***
ال عمران 176 ****
ال عمران 159 *****
المائدة 42   ******
  """;

  static const String elmTextDersFour4 = """
إذا اردت أن يحبك الله كن تقياً، وكن مستقيماً، وكن صادقاً، وكن أخلاقياً، وكن متطهراً 
التعامل مع الله تعامل واضح

عزيزي القارىء هل وجدت نفسك بين السطور؟! هل أحببت الله واستقمت على أمره وأنتهيت عن ما نهى؟ حتى تستحق أن يحبك الله

---------------------

""";

  static const String elmTextDersFour5 = """
وهل تطمح لأن يحبك الله؟ حتى تكون في عنايته الخاصة وحفظه ورعايته وتأييده ونصره، هل اقبلت عليه بعقلك وبكل مشاعرك واحاسيسك؟ من خلال تفكرك في خلق السماوات والأرض ومن خلال طعامك وشرابك ومن خلال تفكرك في الإبل كيف خلقت، والسماء كيف رفعت، والجبال كيف نصبت، هل تفكرت في الفجر وليالٍ عشر وفي الشمس وضحاها؟ كي تعظم الله عز وجل ولكي يحملك تعظيمه على طاعته وحينما تطيعه وتقبل عليه يتجلى عليك وتذوق طعم القرب منه فتحبه ويحبك
---------------------

""";

  static const String elmTextDersFour6 = """
وهل تقربت إلى الله من خلال معاملتك لخلقه؟ هل تعاملت مع خلقه برفق؟ وهل أحسنت لمن أساء إليك؟ هل وصلت من قطعك؟ هل أعطيت كل ذي حق حقه؟ هل تواضعت لله وخلعت عنك رداء العجب والكبر والاستعلاء؟ هل أنت من المقسطين؟ هل أنت من الكاظمين الغيظ العافين عن الناس؟ هل أنت من المحسنين؟
---------------------

""";

  static const String elmTextDersFour7 = """
هل تعاملت مع عباد الله بأخلاق أو قسوة وغِلظة وكِبر واستكبار وتعنت؟
 
 يارسول الله *
  من أحب عباد الله إلى الله قال: أحسنهم خلقاً

هل ياترى تفكرت في قولة سبحانة وتعالى 
 یُحِبُّهُمۡ وَیُحِبُّونَهُۥۤ **
---------------------
رواة الأمام أحمد وبن ماجة *
المائدة 54 **
  """;

  static const String elmTextDersFour8 = """
أجمل ماقيل في حب الله
---------------------

""";

  static const String elmTextDersFour9 = """
فليتك تحلوا والحياة مريرةً
    وليتك ترضى والأنام غضاب
    
وليت الذي بيني وبينك عامر
     وبيني وبين العالمين خراب

وليت شرابي من ودادك سائغ 
    شربي من ماء الفرات سراب 

إذا صح منك الوصل فالكل هين
       وكل الذي فوق التراب تراب
---------------------

  """;

  static const String elmTextDersFour10 = """
:وقيل

فلو شاهدت عيناك من حسننا الذي         
  رأوه لما وليت عنا لغيرنا

ولو سمعت أذناك حسن خطابنا 
     خلعت عنك ثياب العجب وجئتنا 

ولو ذقت من طعم المحبة ذرة
        عذرت الذي أضحى قتيلاً بحبنا 

ولو نسمت من قربنا لك نسمة
       لمت غريباً واشتياقاً لقربنا

فما حبنا سهل وكل من أدعى
     سهولته قلنا له: قد جهلتنا
---------------------

""";

  static const String elmTextDersFour11 = """
وأخيراً يقول سبحانه وتعالى *
 وَٱلَّذِینَ ءَامَنُوۤا۟ أَشَدُّ حُبࣰّا لِّلَّهِۗ 
 
 هل انت منهم حتى تستحق أن يحبك الله ويتجلى عليك؟
---------------------
البقرة 156 *

  """;

  static const String elmTextDersFour12 = """
بالمقابل أيضاً انظر من الذي لايحبه الله افتح المصحف واقرأ الآيات في مواضع كثيرة ومتفرقة
---------------------


  """;

  static const String elmTextDersFour13 = """
قال تعالى * 
وَٱللَّهُ لَا یُحِبُّ ٱلۡفَسَادَ ۝٢٠٥

قال تعالى **
إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡمُعۡتَدِینَ ۝١٩٠

قال تعالى ***
وَٱللَّهُ لَا یُحِبُّ ٱلظَّـٰلِمِینَ ۝٥٧

قال تعالى ****
إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا ۝٣٦

قال تعالى *****
إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ خَوَّانًا أَثِیمࣰا ۝١٠٧

قال تعالى ******
إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡخَاۤئِنِینَ ۝٥٨

قال تعالى *******
وَٱللَّهُ لَا یُحِبُّ ٱلۡمُفۡسِدِینَ ۝٦٤

قال تعالى ********
إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ ۝١٤١

قال تعالى *********
إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡتَكۡبِرِینَ ۝٢٣

قال تعالى ***********
 لَّا یُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوۤءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِیعًا عَلِیمًا ۝١٤٨

---------------------
الى عمران 57 *
البقرة 190 **
ال عمران 57 ***
النساء 36 ****
النساء 107 *****
الانفال 58 ******
المائدة 64 *******
الانعام 141 ********
النحل 23 *********
النساء 148 **********
  """;
  static const String elmTextDersFour14 = """ 
:أخيراً
 أعظم الحب الذي يكون من الله فإن أحبك الله أسعدك ونصرك وأجاب دعائك وأزال همك وأزاح غمك وألقى في قلوب الخلق حبك 

قال تعالى *
 وَأَلۡقَیۡتُ عَلَیۡكَ مَحَبَّةࣰ مِّنِّی وَلِتُصۡنَعَ عَلَىٰ عَیۡنِیۤ ۝٣٩

---------------------
 طه 39 *
  """;
}
