class ElmTextDersFifteen {

  static const String elmTextDersFifteen1 = """ 
 مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ إِلَیۡهِ یَصۡعَدُ ٱلۡكَلِمُ ٱلطَّیِّبُ وَٱلۡعَمَلُ ٱلصَّـٰلِحُ یَرۡفَعُهُۥۚ * 

أنت كمؤمن يجب أن لا تعتز بغير الله
لا تعتز بمسؤل في الدولة أو شيخ قبيلة أو حزب أو جماعة يجب أن يكون إعتزازك بالله الواحد القهار المهيمن القوي العزيز الجبار

إذا كنت مع الجبار فأنت القوي

إذا كنت مع الجبار فالمستقبل لك

اذا كنت مع الجبار فأنت المنتصر

إذا كنت مع الجبار تدور الأيام ولا تستقر إلا على رفعة شأنك

---------------------
فاطر 10 * 
  """;

  static const String elmTextDersFifteen2 = """
يجبر كل احد ولا يجبره أحد

الإنسان بفطرته يحب دائماً أن يكون مع القوي ، فالمؤمن أ اسباب قوته أنه معتز بالقوي

المؤمن أحد اسباب قوته أن كل من حوله ومن فوقه ومن تحته بيد الله وأنه مع الله

وإذا كان الله معك فمن عليك؟! 

وإذا كان الله عليك فمن معك؟! 

سبب قوة المؤمن أنه متوكل على الله
إذا اردت ان تكون اقوى الناس فتوكل على الله

سبب قوة المؤمن أنه لا يخضع ولا يستكين ولا يذل لأنه مع القوي
( انا عند ضن عبدي بي فليضن بي ماشاء )

---------------------
""";

  static const String elmTextDersFifteen3 = """
من كان مع الله العزيز كان عزيزاً

كنن مع القوي العزيز تكُن عزيزاً وتنجُ من كل هم وآلم

إجعل لربك كل عزك يستقر ويثبت
  فإذا اعتززت بمن يموت فإن عزك ميت

إذا اردت العزة فاعتز بالله سبحانه وتعالى ، سبحانك إنه لا يذلُ من واليت ، ولا يعزُ من عاديت ، 

قال سبحانه وتعالى
 فَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا صَـٰلِحࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَمِنۡ خِزۡیِ یَوۡمِئِذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ ۝٦٦ *
 
القوي الذي لا يُدان بقوته ، والعزيز اللذي لا يُنال جانبه

---------------------
هود 66 *

  """;
  static const String elmTextDersFifteen4 = """
  (مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ) *

الإنسان أحياناً يحصل مركزاً معيناً ، أو دخلاً معيناً ، أو تجارة معينة ، أو شأناً معيناً ، أو مكانة معينة ، ربما خاف على هذه المكانة ، هذا المركز ؛ فهو يرفض الحق حفاظاً على مركزه ، هناك عوامل كثيرة يرفضها ، وهناك أشخاص كثيرون يرفضون الدين ، لا كراهية في الدين ، لا لأنهم لم يقتنعوا به ، هم مقتنعون به ، ولكن يتوهمون لضعف إيمانهم أنهم إذا تدينوا ، أو إذا آمنوا ، أو إذا صلوا ، أو إذا تابوا ، أو إذا انضبطوا يخسرون مكانتهم أو مناصبهم ، أو دنياهم العريضة ، أو دخلهم الكبير ، أو مكانتهم في الأرض ، فهذا الوهم الخطير ، 
:ربنا عز وجل بدده في هذه الآية قال
  (مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ) *

---------------------
فاطر 10 *
""";

  static const String elmTextDersFifteen5 = """
:العزة لا تُنال إلا من الله
لا يمكن لما سوى الله أن يمنحك العزة ، أية جهة سوى الله ، أي إنسان ، أي عظيم ، أي غني ، أي قوي ، أية جهة على وجه الأرض ، لا يُمكن أن تمنحك العزة إلا الله ، 

كفار قريش لماذا كفروا بمحمد صلى الله عليه وسلم ؟ 
والله الذي لا إله الا هو عرفوه رسولاً كما يعرفون أبنائهم هكذا قال الله عز وجل
( یَعۡرِفُونَهُۥ كَمَا یَعۡرِفُونَ أَبۡنَاۤءَهُمۡۖ ) *

---------------------
البقرة 146 *
""";

  static const String elmTextDersFifteen6 = """
لماذا كفروا به إذاً حفاظاً على مكانتهم، حفاظاً على زعامتهم، حفاظاً على تجارتهم ، حفاظاً على انصراف الناس لهم ، ماالذي حصل فيما بعد ، هل بقيت لهم هذه المكانة ؟ هل بقيت لهم هذه العزة ؟ ألم يُصرعوا في معارك بدر وأحد والخندق ، ألم يقل النبي عليه الصلاة والسلام لهم : يافلان ، ياشيبة بن ربيعة ، يا أمية بن خلف ، خاطبهم بأسمائهم واحداً واحداً ، هل وجدتم ما وعد ربكم حقا ، إني وجدت ما وعدني ربي حقا ، لقد كذبتموني وصدقني الناس ، وأخرجتموني وآواني الناس ، وخذلتموني ونصرني الناس ، قالوا أتخاطب قوماً جيفوا ، قال : ما أنتم بأسمع لي منهم ، ولكنهم لا يجيبونني

---------------------

  """;

  static const String elmTextDersFifteen7 = """
التاريخ بين أيدينا ، ماالذي حصل ؟ هؤلاء الذين قاوموا الدعوة ، وكفروا بها ، وكذبوا بها ، وسفهوا النبي الكريم وأصحابه حفاظاً على مكانتهم ، حفاظاً على وجاهتهم ، حفاظاً على تجارتهم ، ماالذي حصل ؟ خسروا بلدهم وشأنهم ، ألم يقف أبو سفيان في باب عمر بن الخطاب ساعات طويلة فلم يؤذن له ؟ 
وصهيب وبلال يدخلان بلا استئذان ، فلما دخل عليه ، قال: زعيم قريش يقف ببابك ساعات طويلة ، ولا تأذن لي وهذان يدخلان متى يشاءان ، قال له: أنت مثلهما! من أنت أمامهما؟

---------------------

""";

  static const String elmTextDersFifteen8 = """
 :طاعة الله سبيل العزة
إذا توهم الإنسان أنه بمعصية الله قد يرتفع ، وإذا توهم الإنسان أنه بترك الدين يملك عزة وكرامة فهذا هو عين الجهل هذا كلام واضح كالشمس

 مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ *

عن عائشة رضي الله عنها ، عن النبي صلى الله عليه وسلم قال: 
(( من التمس رضا الله عنه بسخط الناس رضي الله عنه ، وأرضى عنه الناس ، ومن التمس رضا الناس بسخط الله ، سخط الله عليه وأسخط عليه الناس )) 

---------------------

""";

  static const String elmTextDersFifteen9 = """
:لا يملك العزة مخلوق
لم يقل: فلله العزة ، هناك كلمة أساسية ، وهي جميعا ، العزة كلها من الله ، وما من مخلوق في الأرض يملك هذه العزة ، لا تجد جهة إذا مشيت معها تعطيك عزة ، الأمور بخواتيمها ، الأمور بما تستقر عليه ، طبعاً الله عز وجل جعل امتحانات كثيرة ، جهات أرضية كثيرة تمنحك العزة الظاهرة ، ولكن بعد حين يتخلون عنك ، فلذلك الإنسان الذي مع الحق ، موقفه قوي جداً ، موقعه قوي ، 
أما مع الباطل فهو عرضة لانهيار سريع

---------------------
  """;

  static const String elmTextDersFifteen10 = """

  فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ *
إذا آمنت بالله كُنت عزيزاً ، وإذا استقمت على أمره كنت عزيزاً ، وإذا عملت الصالحات أحبك الناس فعظموك ، فكنت عزيزاً ، وإذا اتصلت بالله ، فذقت حلاوة القرب ، استغنيت عن مديح الناس لك، فكنت عزيزاً ، إذا كان عند الإنسان خواء روحي ، عنده جفاف روحي ، أحب أنه يسعد بالناس ، والاستئناس بالناس من علامات الإفلاس ، لما يصير للإنسان صلة بالله عز وجل يستغني بها عن الناس ، يستغني بها عن سقطاتهم ، عن اللقاء بهم لقاء ساذجاً ، وسخيفاً ، لقاءاته كلها تكون مثمرة

---------------------

""";

  static const String elmTextDersFifteen11 = """
حينما تؤمن فأنت عزيز ، وحدت ، لا تخاف في الله لومة لائم ، لا تنافق ، لا تكذب ، لا تدلس ، لا تتملق ، لا تخنع ، لا تخضع لما استقمت فما عليك مأخذ ، رافع الرأس دائماً ، قد تكون فقيراً وتحمل الحاجة بيدك ، وأنت رافع رأسك ، وقد تكون في أعلى درجات الغنى ، لكن الدخل مشبوه ، فأنت ذليل إذاً : الإيمان بالله ، الاستقامة على أمره ، والعمل الصالح والاتصال بالله عز وجل ، تُكسب الإنسان عزة

قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلۡمُلۡكِ تُؤۡتِی ٱلۡمُلۡكَ مَن تَشَاۤءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَاۤءُ وَتُعِزُّ مَن تَشَاۤءُ وَتُذِلُّ مَن تَشَاۤءُۖ بِیَدِكَ ٱلۡخَیۡرُۖ إِنَّكَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ ۝٢٦
---------------------
ال عمران 26 *

  """;

  static const String elmTextDersFifteen12 = """
 :كل شيئ في الكون ملك لله
الله جل جلاله ملكه ملك تام ، يملك الشيئ خلقاً ، ويملكه تصرفاً ، ويملكه مصيراً

 :صحتك ملك لله
أي شيئ تتمتع به فهو ملك الله عز وجل لك بيت ، عقلك ، أي عضو تتمتع به ملك الله ، أي جهاز تتمتع به ملك الله ، أية خبره تملكها هي ملك لله ، العلم ، الخبرة ، النسب ، الحسب ، الوسامه ، الذكاء ، الحكمة ، الصحة ، 

---------------------

""";

  static const String elmTextDersFifteen13 = """
 :مكانتك بيد الله
مكانتك في المجتمع ملك لله عز وجل
إن كنت تملك مكانة فهي ملك الله ، ملكك إياها ، إن كنت تملك محبة الناس ، فمحبة الناس بالهام الله عز وجل
عندك زوجة الله ملكك إياها ، عندك أولاد ابرار الله ملكك إياهم ، تتمتع بصحة طيبة ، الله ملكك إياها

الأعرابي اللذي بيده قطيع الإبل ، فسُئل عن هذه الإبل ؟ قال : لله في يدي ، وما من كلمة أبلغ من هذه الكلمة ( لله في يدي ) 

بيتك ، واختصاصك ، وحرفتك ، ودكانك ، وزوجتك ، وأولادك ، وسمعتك ، وكرامتك ، وراحة بالك ، وحريتك التي تتمتع بها ، 
لا أجد في اللغة العربية كلمة أوسع من كلمة ( مالك الملك ) ، أي شيئ يُملك فمالكه هو الله

---------------------

  """;

  static const String elmTextDersFifteen14 = """
 تُؤۡتِی ٱلۡمُلۡكَ مَن تَشَاۤءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَاۤءُ * 

فهذا المعنى : إنك إن تمتعت بقوة ، أو إن تمتعت بصحة ، أو إن تمتعت بعقل ، أو إن تمتعت بذكاء ، أو إن تمتعت بخبرة ، أو إن تمتعت بأهل ، أو إن تمتعت بأولاد ، أو إن تمتعت ببيت ، كله من الله ، فكلما تعمقت في الإيمان وجدت أن الله هو كل شيئ ، وأن الله منحك كل شيئ ، وأن الله قادر على أن يسلبك كل شيئ

ربما منعك فأعطاك ، وربما أعطاك فمنعك ، والله عز وجل حكيم ، إذا نزع منك الملك ثم كشفت لك حكمة نزع هذا الملك فينبغي أن تذوب محبة لله ، إن اعطاك الملك فلحكمة ، وإن نزع منك الملك فلحكمة ، قد تكون عقوبة ، والعقوبة نوع من التربية ، وقد تكون وقاية ، والوقاية نوع من التربية ، وقد تكون ابتلاء ، والابتلاء رفع درجات ، على كلٍ يجب ان تعتقد أن كل شيئ فعله الله هو محض حكمة ومحض فضل

---------------------
 ال عمران 126 *

  """;

  static const String elmTextDersFifteen15 = """
 وَتُعِزُّ مَن تَشَاۤءُ وَتُذِلُّ مَن تَشَاۤءُۖ * 

فهذه الدنيا كل حال يزول ، قد تصيب عزاً ، وقد يذل الإنسان ، هذا يحي البرمكي كان الرجل الأول في الدولة العباسية ، إذا هو في السجن يُعذب ، فقال لبعض من حوله " لعل دعوة مظلوم أصابتنا ، ونحن عنه غافلون"

وفرعون كان له ملك مصر
  فَقَالَ أَنَا۠ رَبُّكُمُ ٱلۡأَعۡلَىٰ ۝٢٤

تورط ، وتبع سيدنا موسى في البحر ، ثم أدركه الغرق ، ولولا أن الموج لفظه إلى الشاطئ لتوهم أتباعه أنه صعد إلى السماء ، فإمعاناً في إذلاله قذفه الموج إلى الشاطئ  

---------------------
ال عمران 126 *
  """;
  
  static const String elmTextDersFifteen16 = """ 
قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلۡمُلۡكِ تُؤۡتِی ٱلۡمُلۡكَ مَن تَشَاۤءُ وَتَنزِعُ ٱلۡمُلۡكَ مِمَّن تَشَاۤءُ وَتُعِزُّ مَن تَشَاۤءُ وَتُذِلُّ مَن تَشَاۤءُۖ 

:أجمل مافي الأية ، بحسب السياق
( تؤتي الملك من تشاء) 
( وتنزع الملك ممن تشاء) 
( وتعز من تشاء) 
( وتذل من تشاء) 

الإذلال شر بمفهوم الأرض كان ينبغي بحسب السياق أن تكون الآية
 بيدك الخير والشر ، 
:لكن الله عز وجل قال
  ( بيدك الخير ) 

ماذا يستنبط ؟ يستنبط أن إيتاء الملك خير ، وان نزع الملك خير ، وأن الإعزاز خير ، وأن الإذلال خير

---------------------
 ال عمران 126 *
  """;

  static const String elmTextDersFifteen17 = """
 سُبۡحَـٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا یَصِفُونَ ۝١٨٠ * 

عزة معنوية ، وعزة مادية ، هو رب العزة ، هو صاحب العزة ، فإذا أردت العزة فكن معه ، إن اردت العزة فلذ بحماه ، إن اردت العزة فاستعذ به

إجعل لربك كُل عزك يستقر ويثبت
     
فإذا اعتززت بمن يموت فإن عزك ميت
---------------------
الصافات 180 *
 """;
 
//   static const String elmTextDersFifteen18 = """

// ---------------------
//  """;
//   static const String elmTextDersFifteen19 = """

// ---------------------
//   """;
//   static const String elmTextDersFifteen20 = """

// ---------------------
//  """;

//   static const String elmTextDersFifteen21 = """

// ---------------------

// """;
//   static const String elmTextDersFifteen22 = """

// ---------------------

// """;
//   static const String elmTextDersFifteen23 = """ 

// ---------------------

// """;

//   static const String elmTextDersFifteen24 = """ 

// ---------------------
// """;

//   static const String elmTextDersFifteen25 = """ 

// ---------------------

// """;

// static const String elmTextDersFifteen26 = """ 

// ---------------------
// """;
}
