class ElmTextTwentyFive {
  // page one
  // 1
  static const String subtitleTwentyFivePageOne_1 = """
 :الفلاح دنيوي وأخروي
  """;

  static const String elmTextTwentyFivePageOne_1 = """
قال بعضهم: الفلاح في الدنيا البقاء، أن يكون عمره مديداً، والغنى، والعِز، وقال بعضهم: أما الفلاح في الآخرة فهو بقاءٌ بلا فناء، وغنىً بلا فقر، وعزٌ بلا ذل، وعلمٌ بلا جهل، وهذا ينطبق على أهل الآخرة، لذلك كان عليه الصلاة والسلام كلما وقعت عينه على بيتٍ جميل أو على شيءٍ من حُطام الدنيا، أو على بستانٍ جميل، أو على شيءٍ يروق للناس كان يدعو، ويقول 
""";
  static const String ayahHadithTwentyFivePageOne_1 = """
ٱللَّهُمَّ لَا عَيْشَ إِلَّا عَيْشُ ٱلْآخِرَةِ
مُتَّفَقٌ عَلَيْهِ عَنْ أَنَسٍ""";
// 2
  static const String elmTextTwentyFivePageOne_2 = """
لأن هذا مؤقت، هذا لا بد من أن يذهب، سيدنا عمر رضي الله عنه أمسك تفاحة شهية، فقال:{أكلتها ذهبت, أطعمتها بقيت} 
فكل شيئ تستهلكه يذهب، أما إذا أنفقته يبقى، والسعداء الذين قدموا أموالهم أمامهم إلى الآخرة، فإذا وافتهم المنية رأو لهم مقاماً عند الله رفيعاً
  """;

// page 2
// 1
  static const String ayahHadithTwentyFivePageTwo_1 = """
قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ""";
  static const String subtitleTwentyFivePageTwo_1 = """
:تحقق فلاح المؤمنين
""";
  static const String elmTextTwentyFivePageTwo_1 = """
قد: حرف تحقيق، إذا جاءت قبل الفعل الماضي، وتأتي قد حرف تقليل إذا جاءت قبل الفعل المضارع، تقول: قد نجح فلان لتحقيق الوقوع، وتقول: قد ينجح فلانٌ لاحتمال الوقوع، بين تحقيق الوقوع، وبين احتمال الوقوع مسافةٌ كبيرة، فقد إذا جاءت قبل الفعل الماضي تُعرَب حرف تحقيق، وإذا جاءت قبل الفعل المضارع تعرب حرف تقليل، فهنا 
""";
// 2
  static const String ayahHadithTwentyFivePageTwo_2 = """
قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ""";
  static const String elmTextTwentyFivePageTwo_2 = """
الفلاح تحقق، أما أي فلاح آخر ينجزه الإنسان في الدنيا ربما لا يكون محققاً، لو اشترى بيتاً فخماً، وبالغ في تزيينه، قد تعاجله المنية قبل أن ينتهي، فهذا النجاح ليس محققاً، وقد ينال المرء شهادةً عالية، وقد تعاجله المنية قبل أن يستفيد منها، وقد يقبض الإنسان مبلغاً كبيراً، وقد تعاجله المنية قبل أن ينفقه، فأيُ نجاح على وجه الأرض ليس محققاً أكيداً، لكن الله سبحانه وتعالى يقول 
""";
// 3
  static const String ayahHadithTwentyFivePageTwo_3 = """
قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ""";

  // pageThree
  // 1
  static const String subtitleTwentyFivePageThree_1 = """
ورود فعل أفلح في القرآن في ثلاث أياتٍ حصراً 
""";
  static const String elmTextTwentyFivePageThree_1 = """
ولو تتبعت فعل أفلح في القرآن الكريم لوجدت أن هناك ثلاث آيات فقط 
:الأولى 
""";
  static const String ayahHadithTwentyFivePageThree_1 = """
قَدْ أَفْلَحَ مَن زَكَّىٰهَا""";
//2
  static const String elmTextTwentyFivePageThree_2 = """
:الثانية
""";
  static const String ayahHadithTwentyFivePageThree_2 = """
قَدْ أَفْلَحَ مَن تَزَكَّىٰ""";
// 3
  static const String elmTextTwentyFivePageThree_3 = """
:الثالثة 
""";
  static const String ayahHadithTwentyFivePageThree_3 = """
قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ""";

  static const String subtitleTwentyFivePageThree_2 = """

:الفلاح هو تحقيق المراد
""";
// 4
  static const String elmTextTwentyFivePageThree_4 = """
وفلح الأرض أي شقها، والفلاح هو النجاح، لو أن إنساناً خطط لمستقبله، أراد أن يكون طبيباً فاجتهد في الشهادة الثانوية حتى حقق مجموعاً يتيح له أن يدخل كلية الطب، ودخل إلى كلية الطب، وتخرج طبيباً، ثم تخصص، ونال أعلى شهادةٍ في العالم، وعاد إلى بلده، وافتتح عيادةً، وذاع صيته، وحقق دخلاً كبيراً، فاشترى بيتاً، وتزوج، واشترى سيارة، وكان دخله فوق حاجته، نقول: هذا الطالب أفلح في دنياه، أي رسم خطة، وهذه الخطة تحققت، فالفلاح هو النجاح، والفلاح هو الفوز، والفلاح هو التفوق، والفلاح هو تحقيق الهدف، والفلاح هو تحقيق المراد، الله سبحانه وتعالى يقول 
""";
  static const String ayahHadithTwentyFivePageThree_4 = """
قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ""";
// 5
  static const String elmTextTwentyFivePageThree_5 = """
أي الذين حققوا الهدف من خلقهم هم المؤمنون، هناك من يتفوق في الدنيا؛ هناك أصحاب الأموال الطائلة، هناك أصحاب أصحاب المراتب العلية، هناك أصحاب الشهادات الرفيعة، هؤلاء حققوا أهدافهم في الدنيا، لكن الحياة الدنيا إذا قيست إلى الحياة الآخرة ليست بشيئ، فالنجاح في الدنيا لا يعني النجاح الذي يرتضيه الله سبحانه وتعالى لعباده، لأن النجاح الذي أراده الله سبحانه وتعالى لعباده هو النجاح الأبدي 
""";
  static const String ayahHadithTwentyFivePageThree_5 = """
وَمَا ٱلْحَيَوٰةُ ٱلدُّنْيَآ إِلَّا مَتَٰعُ ٱلْغُرُورِ""";

  // page four
  // 1
  static const String subtitleTwentyFivePageFour_1 = """
:النجاح الدنيوي لا قيمة له 
""";
  static const String elmTextTwentyFivePageFour_1 = """
وما الحياة الدنيا إلا كمخيطٍ غُمس في مياه البحر، فلينظر أحدنا بما يرجع، إذا كانت الآخرة بحراً محيطاً كبيراً، الحياة الدنيا نقطة ماءٍ يحملها مخيطٌ دقيق، فالفلاح في الدنيا لا يُعدُ عند الله فلاحاً، قد يعد عند الناس فلاحاً، هذا له مال طائل، وذاك له مرتبة عالية، وآخر له دخلٌ كبير، ومنهم من له أولادٌ نجباء، وهذا له زوجةٌ تروق له، أو قوةٌ في الأرض يخافها معظم الناس، هذه نجاحات الدنيا، ولكن الدنيا لا تعدل عند الله جناح بعوضة، إذاً النجاح الدنيوي لا قيمة له، يقول الإمام علي كرم الله وجهه الغنى والفقر بعد العرض على الله 
لكن الفلاح الذي أراده الله سبحانه وتعالى، وينتظره من عباده هو الفلاح الذي يمتد أثره إلى الدار الآخرة، لا الذي ينتهي في الدنيا: إن الله يعطي الصحة والذكاء والمال والجمال للكثيرين من خلقه فهل يسمى الذكي في الدنيا فالحاً عند الله؟ لا.. قد يكون فالحاً عند الناس، هل يسمى القوي في الدنيا فالحاً عند الله؟ لا.. قد يكون فالحاً عند الناس، هل يسمى الوسيم في الدنيا فالحاً عند الله؟ قد يكون فالحاً عند الناس، ولكن الفلاح كُل الفلاح، والنجاح كُل النجاح، والفوز كُل الفوز أن تنال فلاحاً يمتدُ إلى الدار الآخرة، أن يكون النجاح متصلاً إلى الحياة الأبدية، فهذا الذي ينقطع في الدنيا لا قيمة له 
""";
  static const String ayahHadithTwentyFivePageFour_1 = """
ٱلدُّنْيَا دَارُ بَلَاءٍ وَٱنْقِطَاعٍ
{وَرَدَ فِي الْأَثَرِ}""";
// 2
  static const String elmTextTwentyFivePageFour_2 = """
والعبرة التي يغفل عنها معظم الناس، أن كل شيئٍ يجمعه الإنسان في الدنيا بدأ من أموال، إلى بيوت، إلى منتزهات، إلى سيارات، إلى مكانة، إلى جاه، إلى قوة، هذا كلهُ يغادره الإنسان 
""";
  static const String ayahHadithTwentyFivePageFour_2 = """
:يَقُولُ سَيِّدُنَا عُمَرُ رَضِيَ ٱللَّهُ عَنْهُ
كَفَىٰ بِٱلْمَوْتِ وَاعِظًا""";
// 3
  static const String elmTextTwentyFivePageFour_3 = """
فالمشكلة الكبرى أن يتطابق مقياس الفلاح عندك مع مقياس الفلاح عند الله عز وجل، إذا كان لك مقياس للفلاح، ولله سبحانه وتعالى مقياس آخر فهذه هي الخسارة، لابد من تطابق مقياس الفلاح الذي تعتقده مع مقياس الفلاح الذي أراده الله سبحانه وتعالى، الله سبحانه وتعالى جعل الإيمان هو الفلاحُ الذي يريده لعباده
 """;

// page five
//1
  static const String subtitleTwentyFivePageFive_1 = """
:مقياس الله في الفلاح 
العدل وعدم الظلم
""";
  static const String ayahHadithTwentyFivePageFive_1 = """
إِنَّهُۥ لَا يُفْلِحُ ٱلظَّٰلِمُونَ""";
  static const String elmTextTwentyFivePageFive_1 = """
إذا ظلم إنسانٌ زوجته، ظلم جيرانه، أكل حقوق الآخرين، اعتدى عليهم، اعتدى على اعراضهم، استطاع ان يستغلهم، أن يحتال عليهم، هذا لا يسمى ذكياً، وما فعله لا يسمى ذكاءً ولا تفوقاً، إنه غباءٌ بعينه، ربنا عز وجل قال 
""";
// 2
  static const String ayahHadithTwentyFivePageFive_2 = """
إِنَّهُۥ لَا يُفْلِحُ ٱلظَّٰلِمُونَ""";
  static const String elmTextTwentyFivePageFive_2 = """
إذا بعت شيئاً أخفيت عيبه هل أنت ذكي؟ لا.. أنت ظالم، ظلمت المشتري بإخفاء العيب، فالله سبحانه وتعالى يقول 
""";
// 3
  static const String ayahHadithTwentyFivePageFive_3 = """
إِنَّهُۥ لَا يُفْلِحُ ٱلظَّٰلِمُونَ""";
  static const String elmTextTwentyFivePageFive_3 = """
الإيمان وعدم الكفر 
""";
// 4
  static const String ayahHadithTwentyFivePageFive_4 = """
إِنَّهُۥ لَا يُفْلِحُ ٱلْكَٰفِرُونَ""";
  static const String elmTextTwentyFivePageFive_4 = """
هذا الذي أدار ظهره للدين، وجحد نعمة الله عز وجل، ولم يلتفت إلى الله عز وجل، والتفت إلى الدنيا فحقق نجاحاً كبيراً، هذا عند الله ليس بفالح 
""";
// 5
  static const String ayahHadithTwentyFivePageFive_5 = """
إِنَّهُۥ لَا يُفْلِحُ ٱلْكَٰفِرُونَ""";

  // page six
  // 1
  static const String subtitleTwentyFivePageSix_1 = """
التقوى 
""";
  static const String elmTextTwentyFivePageSix_1 = """
من الآيات الأخرى التي تشير إلى نوع الفلاح قوله تعالى 
""";
  static const String ayahHadithTwentyFivePageSix_1 = """
وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُفْلِحُونَ""";
// 2
  static const String elmTextTwentyFivePageSix_2 = """
أي استنيروا بنور الله عز وجل، اقتبسوا من الله نوراً يريكم الخير خيراً والشر شراً، والحق حقاً والباطل باطلاً لعلكم تفلحون 
""";
  static const String ayahHadithTwentyFivePageSix_2 = """
يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَٱبْتَغُوٓا۟ إِلَيْهِ ٱلْوَسِيلَةَ وَجَٰهِدُوا۟ فِى سَبِيلِهِۦ لَعَلَّكُمْ تُفْلِحُونَ ۝٣٥
سورة المائدة""";

  static const String subtitleTwentyFivePageSix_2 = """

العبادة وفعل الخير 
""";

// 3
  static const String ayahHadithTwentyFivePageSix_3 = """
وَٱعْبُدُوا۟ رَبَّكُمْ وَٱفْعَلُوا۟ ٱلْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ""";
  static const String subtitleTwentyFivePageSix_3 = """

ذكر آلاء الله 
""";
// 4
  static const String ayahHadithTwentyFivePageSix_4 = """
فَٱذْكُرُوٓا۟ ءَالَآءَ ٱللَّهِ لَعَلَّكُمْ تُفْلِحُونَ""";
  static const String subtitleTwentyFivePageSix_4 = """

التزام جماعة المؤمنين الصادقين 
""";
  static const String elmTextTwentyFivePageSix_3 = """
وجاء الفلاح في آية أخرى تحدثنا عن فئة ارتقت وسمت حتى صار بينها وبين الله صلة لا حدود لها، إنها حزب الله 
""";
// 5
  static const String ayahHadithTwentyFivePageSix_5 = """
أَلَآ إِنَّ حِزْبَ ٱللَّهِ هُمُ ٱلْمُفْلِحُونَ""";
  static const String elmTextTwentyFivePageSix_4 = """
هل أنت من حزب الله؟ هل أنت من المؤمنين الصادقين، الطائعين، المخلصين، القانتين، الصائمين، الصادقين 
 """;

// page seven
//1
  static const String subtitleTwentyFivePageSeven_1 = """
تطهير النفس وتحليتها هو التزكي وهذا هو الفلاح 
""";
  static const String ayahHadithTwentyFivePageSeven_1 = """
رَبُّنَا عَزَّ وَجَلَّ يَقُولُ
قَدْ أَفْلَحَ مَن تَزَكَّىٰ وَذَكَرَ ٱسْمَ رَبِّهِۦ فَصَلَّىٰ""";
  static const String elmTextTwentyFivePageSeven_1 = """
الذي نجح وأفلح وسعِد وتفوق وحقق الهدف، وسعِدَ إلى أبد الآبدين هو من تزكى، أنظر إلى حال الناس في هذه الأيام، من من الناس يعنيه أمر نفسه؟ الناس جميعاً يعنيهم أمر دُنياهم؛ بيتُهُ واسع ومُزين، ويحتاج إلى دخل كبير، ولا بد أن يسر بالحياة، ولبسٌ جيد ومظهر لائق، ووقت فراغ غني بالنزهات والسهرات! من الذي يعينه أمر نفسه؛ قد أفلح من تزكى! كل هذه المظاهر المادية تنتهي بالموت مهما علوت في الدنيا، ومهما كثر مالك، مهما غُصْتَ في نعيمها يأتي الموت فيسلبك كل هذه المُتع والمسرات والنعيم في ثانية واحدة، لكن الفلاح والنجاح أن تزكى، ما معنى تتزكى؟ 
قال بعضهم: قد أفلح من تزكى، أي مَن طَهَرَ نفسه من الأدران الخبيثة لأن أمراض الجسد تنتهي بالموت! لكن خطر أمراض النفس يبدأ بالموت، واحدٌ مُتكبر وحقود وحسود لئيم، يُحب ذاته، ويقبل أن يبني مجدهُ على أنقاض الآخرين، وثروتهُ على فقر الآخرين، وأن يبني نفسه على إتلاف الآخرين، فهذا الذي تزكى طهر نفسه من كُل الأدران والمُيول المُنحرفة ومن كل الشهوات والنقائص فقد أفلح، ومن معاني التزكية أيضاً التحلي بالكمال والتخلي عن الانحرافات، فلا بد من تحْلِيَه وتخلية، لا بد من تطهير النفس من الأدران، ثم تحليتها بالكمال، فالتطهير والتحلية هو التزكي، وهذا هو الفلاح، لأنه يوم لا ينفع مال ولا بنون إلا من أتى الله بقلبٍ سليم، هذا الجهد الكبير الذي يبذلهُ الإنسان في الدنيا كي يطهر نفسه من كل درن وعُجب وشركٍ واستعلاء وكبر وحقد وضغينة وأثرَة وحُب الذات؛ هذه الجهود يرى ثمرتها عند الموت قال تعالى 
""";
// 2
  static const String ayahHadithTwentyFivePageSeven_2 = """
سَلَٰمٌۭ قَوْلًۭا مِّن رَّبٍّۢ رَّحِيمٍۢ

ٱدْخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ

فَأَمَّا مَنْ أُوتِىَ كِتَٰبَهُۥ بِيَمِينِهِۦ فَيَقُولُ هَآؤُمُ ٱقْرَءُوا۟ كِتَٰبِيَهْ""";

// page eight
// 1
  static const String subtitleTwentyFivePageEight_1 = """
الجوهر أن تعرف الله وأن تكسب حياتك 
قال تعالى 
""";
  static const String ayahHadithTwentyFivePageEight_1 = """
كَانُوا۟ قَلِيلًۭا مِّنَ ٱلَّيْلِ مَا يَهْجَعُونَ""";
  static const String elmTextTwentyFivePageEight_1 = """
هذه الآية واضحة ولكن هل أنت في مستواها؟! هل لك رؤيَة تنطبق على هذه الآية؟ إن كانت لك رؤية خلاف هذه الآية...فإذا رأيت إنساناً حقق دخلاً كبيراً جداً فهل تقول: هذا هو الفالح! أين الآية إذاً؟! قال تعالى
""";
// 2
  static const String ayahHadithTwentyFivePageEight_2 = """
فَخَرَجَ عَلَىٰ قَوْمِهِۦ فِى زِينَتِهِۦ ۖ قَالَ ٱلَّذِينَ يُرِيدُونَ ٱلْحَيَوٰةَ ٱلدُّنْيَا يَٰلَيْتَ لَنَا مِثْلَ مَآ أُوتِىَ قَارُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٍۢ""";
  static const String elmTextTwentyFivePageEight_2 = """
من لم تكن له رؤيه مطابقة لهذه الآية فحالُه خطيرة ولو فهمها وحفظها وقرأها وتلاها في الصلاة، ليس العبرة أن تقرأ الآية إنما أن تعيشها وأن تكون في مستواها، أن تنطبق رؤيتك عليها؛ قد أفلح من تزكى، لذلك سيدنا الصديق ماندم على شيء من الدنيا فاته قط! فالحياة مُؤقتة، فإذا اختار الله لك أن تكون مُوظفاً ودخلك محدود فارض بهذا، المُهم أن تكون صحتك طيبة، وإيمانك جيد، وحياتك مُستقرة وهادئة، كل متاع الدنيا ليس هو جوهر الحياة؛ الجوهر أن تعرف الله، وأن تكسب حياتك 

فليتك تحلو والحياة مريرة 
        وليتك ترضى والأنام غضاب 
وليت الذي بيني وبينك عامرٌ 
        وبيني وبين العالمين خراب 
إذا صح منك الوصل فالكل هينٌ 
        وكل الذي فوق التراب تراب 
""";

// page nine
// 1
  static const String elmTextTwentyFivePageNine_1 = """
ربنا عز وجل عندما أغفل المفعول به أعطى معنى الفلاح المطلق 
""";
  static const String ayahHadithTwentyFivePageNine_1 = """
قَدْ أَفْلَحَ مَن زَكَّىٰهَا""";
// 2
  static const String elmTextTwentyFivePageNine_2 = """
فاستخدام الفعل الماضي أي تحقق الوقوع واستخدام{قد}هذه تزيد من تحقق الوقوع، {قد} حرف تحقيق {قد أفلح}، من الذي أفلح؟ قال 
""";
  static const String ayahHadithTwentyFivePageNine_2 = """
مَن زَكَّىٰهَا""";
// 3
  static const String elmTextTwentyFivePageNine_3 = """
أل{ها} على من تعود؟ على النفس 
ونفس وما سواها فألهمها فجورها وتقواها قد أفلح من زكاها 
والحقيقة إذا اعتقدت قيمة أخرى أخرى أن المال هو كل شيء فما أشد الضلال، وإذا اعتقدت أن الشهوات هي كل شيء فما أبعد الضلال 
 """;

//page ten
// 1
  static const String subtitleTwentyFivePageTen_1 = """
الهدف الأكبر من الخلق 
""";
  static const String ayahHadithTwentyFivePageTen_1 = """
قَدْ أَفْلَحَ مَن زَكَّىٰهَا""";
  static const String elmTextTwentyFivePageTen_1 = """
كيف يزكيها؟ ولماذا يزكيها؟ سؤال كيف ولماذا ومتى؟ 
متى؟ في الدنيا، ولماذا؟ لأن هذه النفس الإنسانية خلقت لتسعد بالله عز وجل، خلقت السماوات والأرض من أجلك فلا تتعب وخلقتك من أجلي فلا تلعب، أنت مخلوق من أجل أن تسعد بالله عز وجل، هذا هو الهدف الأكبر من خلقك، خلقت لتعرف الله فما معنى تعرفه؟ أي تسعد بقربه إلى أبد الآبدين في جنة فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر، لكنك لن تستطيع أن تسعد بالله وأن يكون لك مقعد صدق عند مليك مقتدر إلا إذا كنت مؤهلاً لهذا المنصب 
التأهيل في الدنيا، والجزاء في الآخرة، فما هو التأهيل؟ زكاها يجب أن تزكي نفسك لكي تصبح مؤهلة لأن تكون في كنف الله إلى الأبد، وربنا عز وجل بعد ما ذكر النفس وما سواها وألهمها فجورها وتقواها قال 
""";

// 2
  static const String ayahHadithTwentyFivePageTen_2 = """
قَدْ أَفْلَحَ مَن زَكَّىٰهَا""";
  static const String elmTextTwentyFivePageTen_2 = """
قد نجح نجاحاً مطلقاً هذا الذي توجه إلى نفسه فزكاها 
كلمة{زكاها} لها ثلاث معان 
ما معنى زكاها؟ لها ثلاث معان 
 """;

// page eleven
// 1
  static const String subtitleTwentyFivePageEleven_1 = """
زكاها أي طهرها من الأمراض التي سوف تعذبه إلى أبد الآبدين 
""";
  static const String elmTextTwentyFivePageEleven_1 = """
المعنى الأول: طهرها من الحقد والحسد والكبر والضغينة والآثرة وحب الذات والإستعلاء واللؤم والبخل والنفاق 
""";
  static const String ayahHadithTwentyFivePageEleven_1 = """
قَدْ أَفْلَحَ مَن زَكَّىٰهَا""";
// 2
  static const String elmTextTwentyFivePageEleven_2 = """
هناك أمراض تصيب النفس لا تعد ولا تحصى، وهذه الأمراض كلها اعراض الإعراض، تُعرض فتظهر عليها هذه الأعراض، فلان لئيم! عجيب ذلك، لا، العجيب إذا كان كريماً يكون عجيباً، وإذا كان مقطوعاً عن الله وكان كريماً فهذا هو العجيب، وإن كان مقطوعاً عن الله فلا بد من أن يكون لئيماً، ولا بد من أن يكون بخيلاً وقاسياً ويحب ذاته وحدها، ولكن هناك أذكياء نقول هذا ذكاء مصلحة فإذا وضع في موقف حرج وإذا ضيقت عليه ظهر لؤمه على حقيقته 
فالإنسان إن لم يكن له صلة بالله عز وجل فلا بد من أن يشكو من معظم هذه الأمراض، وهذه اسمها أعراض الإعراض
""";
  static const String ayahHadithTwentyFivePageEleven_2 = """
قَدْ أَفْلَحَ مَن زَكَّىٰهَا""";
// 3
  static const String elmTextTwentyFivePageEleven_3 = """
أي من طهر نفسه من هذه الأمراض، فلو كنت تسكن أفخم بيت وأنت لئيم فهذا هو الشقاء بعينه لأن البيت ينتهي عند الموت ولكن اللؤم سيبدأ فعله المؤلم بعد الموت إلى الأبد، ولو كان عندك ألف مليون فعند الموت تنتهي أما البخل فيبدأ فعله بعد الموت 
 """;

// page twelve
// 1
  static const String subtitleTwentyFivePageTwelve_1 = """
:معنى{زكاها} أي سما بها
""";
  static const String elmTextTwentyFivePageTwelve_1 = """
معنى زكاها أي سما بها لأن الإيمان فيه تخلية وتحلية، وتطهير وتعطير، فالمعنى الثاني لا يكفي أن تكون مستقيماً بل يجب أن تكون رحيماً كريماً ودوداً لطيفاً حليماً هذه هي الصبغة، فالصبغة عندما يتخلق الإنسان كقطعة معدن كانت في ثلاجة ضعها في الشمس تفقد شيئاً وتكسب شيئاً آخر إذ تفقد برودتها وتكسب الحرارة 
فالإنسان إذا اتجه إلى الله عز وجل يتخلص من أدرانه وأمراضه النفسية ويكسب الكمالات الإلهية 
""";
// 2
  static const String subtitleTwentyFivePageTwelve_2 = """
المعنى الثالث الزيادة والنمو 
""";
  static const String elmTextTwentyFivePageTwelve_2 = """
المعنى الثالث الزيادة والنمو، فلا ينبغي لك أن تبقى في مرتبة واحدة، بل لا بد من أن ترقى، والمغبون من تساوى يوماه، من لم يكن في زيادة فهو في نقصان 
أول معنى الطهارة من كل أمراض النفس، والمعنى الثاني التحلي بالكمالات الإلهية، التخلق بأخلاق الله، والمعنى الثالث الرقي والنمو 
 """;

  // page therteen
  // 1
  static const String elmTextTwentyFivePageTherteen_1 = """
من زكى نفسه يُعد فالحاً وذكياً وناجحاً 
إذا الإنسان تفقه بمعنى 
""";
  static const String ayahHadithTwentyFivePageTherteen_1 = """
قَدْ أَفْلَحَ مَن تَزَكَّىٰ""";
  // 2
  static const String elmTextTwentyFivePageTherteen_2 = """
والله الذي لا إله إلا هو لو أن إنساناً فهم هذه الآية وصدقها لحلت كل مشكلاته ولسعد في الدنيا والآخرة فالإنسان قد يرى الفلاح في جمع المال، وقد يرى الفلاح في النزهات مثلاً، وفي الإستمتاع بالمتع الدنيوية، وبأن يكون رفيع الشأن في الدنيا، هكذا قد يرى الفلاح ولكن الله سبحانه وتعالى يقول 
""";
  static const String ayahHadithTwentyFivePageTherteen_2 = """
قَدْ أَفْلَحَ مَن تَزَكَّىٰ""";
// 3
  static const String elmTextTwentyFivePageTherteen_3 = """
الذي نجح والذي أرتقى والذي يُعد فالحاً وذكياً وناجحاً هو من زكى نفسه 
""";
  static const String ayahHadithTwentyFivePageTherteen_3 = """
قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ ۝١
ٱلَّذِينَ هُمْ فِى صَلَاتِهِمْ خَٰشِعُونَ ۝٢
سورة المؤمنون""";
// 4
  static const String elmTextTwentyFivePageTherteen_4 = """
:إذاً 
""";
  static const String ayahHadithTwentyFivePageTherteen_4 = """
قَدْ أَفْلَحَ مَن زَكَّىٰهَا ۝٩
وَقَدْ خَابَ مَن دَسَّىٰهَا ۝١٠
سورة الشمس""";
// 5
  static const String elmTextTwentyFivePageTherteen_5 = """
:هذا هو المقسم عليه 
""";
  static const String ayahHadithTwentyFivePageTherteen_5 = """
وَٱلشَّمْسِ وَضُحَىٰهَا ۝١
وَٱلْقَمَرِ إِذَا تَلَىٰهَا ۝٢
وَٱلنَّهَارِ إِذَا جَلَّىٰهَا ۝٣
وَٱلَّيْلِ إِذَا يَغْشَىٰهَا ۝٤
وَٱلسَّمَآءِ وَمَا بَنَىٰهَا ۝٥
وَٱلْأَرْضِ وَمَا طَحَىٰهَا ۝٦
وَنَفْسٍۢ وَمَا سَوَّىٰهَا ۝٧
فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَىٰهَا ۝٨
سورة الشمس""";
// 6
  static const String elmTextTwentyFivePageTherteen_6 = """
فإذا كانت الآيات في نظرك عظيمة فجواب هذا القسم أن تزكي نفسك 
  """;

// PageFourteen
// 1
  static const String subtitleTwentyFivePageFourteen_1 = """
صفات المفلحين 
""";
  static const String elmTextTwentyFivePageFourteen_1 = """
(1)
الإيمان
""";
  static const String ayahHadithTwentyFivePageFourteen_1 = """
قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ""";
// 2
  static const String elmTextTwentyFivePageFourteen_2 = """
(2)
الخشوع في الصلاة
""";
  static const String ayahHadithTwentyFivePageFourteen_2 = """
ٱلَّذِينَ هُمْ فِى صَلَاتِهِمْ خَٰشِعُونَ""";
// 3
  static const String elmTextTwentyFivePageFourteen_3 = """
ضاقت الدائرة 
""";
  static const String elmTextTwentyFivePageFourteen_4 = """
(3)
الإعراض عن اللهو 
""";
  static const String ayahHadithTwentyFivePageFourteen_3 = """
وَٱلَّذِينَ هُمْ عَنِ ٱللَّغْوِ مُعْرِضُونَ""";

// 4
  static const String elmTextTwentyFivePageFourteen_5 = """
ضاقت 

(4)
أداء الزكاة وحفظ الفرج واداء الأمانة الحفاظ على الصلاة 

والذين هم للزكاة فاعلون والذين هم لفروجهم حافظون إلا على ازواجهم او ما ملكت ايمانهم فإنهم غير ملومين فمن ابتغى وراء ذلك فاولئك هم العادون والذين هم لأماناتهم وعهدهم راعون والذين هم على صلواتهم يحافظون 
كلما أضيفت صفة ضاقت الدائرة، فلذلك الفلاح الذي عناه الله سبحانه وتعالى ليس لمن يدعي الإيمان، وليس لمن يتوهم أنه مؤمن، ولكن لمن انطبقت عليه كل هذه الشروط 
""";

// PageFifteen
// 1
  static const String subtitleTwentyFivePageFifteen_1 = """
️طريق التزكية▪ 
""";
  static const String elmTextTwentyFivePageFifteen_1 = """
قد أفلح من تزكى وذكر اسم ربه فصلى
كيف تزكو النفس؟ إذا ذكرت اسم الله فصليت، هذا طريق التزكية
️لا تزكو النفس إلا بمعرفة الله والإقبال عليه

ولتكن منكم أمة يدعون إلى الخير ويأمرون بالمعروف وينهون عن المنكر وأولئك هم المفلحون 
""";
// 2
  static const String subtitleTwentyFivePageFifteen_2 = """

️صفات المفلحين▪
""";
  static const String elmTextTwentyFivePageFifteen_2 = """
(1)
الدعوة إلى الخير وهو الإسلام 
هذه اللام لام الأمر ولتكن منكم أمة يدعون إلى الخير، فلا بد من فئة في كل مجتمع تتعلم العلم الصحيح العميق الواسع، وتدعوا إلى الله، تدعوا إلى الخير إلى هذا القرآن، إلى هذا الإسلام، إلى هذا الدين القويم، تدعوا إلى كل شيئ يقرب إلى الله، وتنهى عن كل شيء يبعد عن الله عز وجل 

(2)
الأمر بالمعروف والنهي عن المنكر 

""";
  static const String ayahHadithTwentyFivePageFifteen_1 = """
لَٰكِنِ ٱلرَّسُولُ وَٱلَّذِينَ ءَامَنُوا۟ مَعَهُۥ جَٰهَدُوا۟ بِأَمْوَٰلِهِمْ وَأَنفُسِهِمْ ۚ وَأُو۟لَٰٓئِكَ لَهُمُ ٱلْخَيْرَٰتُ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ ۝٨٨
سورة التوبة""";
  static const String subtitleTwentyFivePageFifteen_3 = """

️النجاح المطلق نجاح في الدنيا والآخرة▪
  """;
  static const ayahHadithTwentyFivePageFifteen_2 = """
لَهُمُ ٱلْخَيْرَٰتُ""";
  // 3
  static const elmTextTwentyFivePageFifteen_3 = """
مطلقة في الدنيا والآخرة 
  """;
  static const ayahHadithTwentyFivePageFifteen_3 = """
وَلِمَنْ خَافَ مَقَامَ رَبِّهِۦ جَنَّتَانِ""";
  // 4
  static const elmTextTwentyFivePageFifteen_4 = """
في الدنيا جنة، وفي الآخرة جنة 
  """;
  static const ayahHadithTwentyFivePageFifteen_4 = """
وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ""";
  // 5
  static const elmTextTwentyFivePageFifteen_5 = """
هذا هو النجاح المطلق نجاح في الدنيا وفلاح في الآخرة 
  """;

  // PageSixteen
  // 1
  static const ayahHadithTwentyFivePageSixteen_1 = """
فَمَن ثَقُلَتْ مَوَٰزِينُهُۥ فَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ""";

  // 2
  static const ayahHadithTwentyFivePageSixteen_2 = """
فَـَٔاتِ ذَا ٱلْقُرْبَىٰ حَقَّهُۥ وَٱلْمِسْكِينَ وَٱبْنَ ٱلسَّبِيلِ ۚ ذَٰلِكَ خَيْرٌۭ لِّلَّذِينَ يُرِيدُونَ وَجْهَ ٱللَّهِ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ ۝٣٨
سورة الروم

أُو۟لَٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ ۖ وَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ ۝٥
سورة البقرة""";
  static const elmTextTwentyFivePageSixteen_1 = """
️وردت هذه الآية في موضعين في القرآن الكريم، مرة في سورة البقرة، ومرة في سورة لقمان، في الأولى بين لنا بعض من صفات المتقين، أولئك الذين ارادوا الوقاية من عذاب الدنيا وعذاب الآخرة بحثوا عن المنهج فوجدوه في كتاب الله، فآمنوا بالله غيباً، واتصلوا به عن طريق الإنفاق، مما رزقهم، وآمنوا بسلسلة الرسالات، وآمنوا بالآخرة، أيمان بالغيب، إنفاق، اتصال بالله،
 هذا هو الفلاح، وهذا هو النجاح

وفي الثانية بين لنا بعض من صفات المحسنين، ومن صفات المحسنين1_إقامة الصلاة2_إيتاءالزكاة، والزكاة إحسان إلى الخلق
الإيمان باليوم الآخر 

الناس كلهم يسعون إلى الفلاح ويختلفون في حقيقته 
ما من إنسان على وجه الأرض إلا ويتمنى أن يكون من الفالحين، ومن الفائزين، ومن المتفوقين، ومن الناجحين، النجاح هدف كل إنسان؛ ولكن المشكلة أن الإنسان إذا عميت بصيرته لا يعرف من أين النجاح، لذلك ربنا سبحانه وتعالى قال 
""";

// pageSeventeen
// 1
  static const String ayahHadithTwentyFivePageSeventeen_1 = """
أُو۟لَٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ

وَلَا يُفْلِحُ ٱلسَّاحِرُ حَيْثُ أَتَىٰ""";
  static const String elmTextTwentyFivePageSeventeen_1 = """
لن تُفلح إذا أردت أن تُلفت نظر الناس إلى شيءٍ لا ينتمي إلى الحق، لن تُفلح إطلاقاً إذا أردت أن تستعيض عن شرع الله بشرع وضعي، لايمكن أي تشريع وضعي من صنع البشر أن ينجح، ولا يمكن أن يحقق أهدافه، ولا يمكن أن يُفلِحَ أصحابه لأنهم بشر 
 """;
  // 2
  static const String ayahHadithTwentyFivePageSeventeen_2 = """
قُل لَّا يَسْتَوِى ٱلْخَبِيثُ وَٱلطَّيِّبُ وَلَوْ أَعْجَبَكَ كَثْرَةُ ٱلْخَبِيثِ ۚ فَٱتَّقُوا۟ ٱللَّهَ يَٰٓأُو۟لِى ٱلْأَلْبَٰبِ لَعَلَّكُمْ تُفْلِحُونَ ۝١٠٠
سورة المائدة""";
  static const String subtitleTwentyFivePageSeventeen_1 = """
️المال الذي يأتي بأساليب غير مشروعة يذهب بطرق مؤلمة جداً 
 """;
  static const String elmTextTwentyFivePageSeventeen_2 = """
هناك شيئ طيب تطيب به النفس، وشيئ خبيث تخبث به النفس، فالطيب الذي تطيب النفس به طيب ولو كان قليلاً، والخبيث الذي تخبث به النفس يبقى خبيثاً ولو كان كثيراً
  """;
  // 3
  static const String ayahHadithTwentyFivePageSeventeen_3 = """
يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ ٱللَّهَ وَٱبْتَغُوٓا۟ إِلَيْهِ ٱلْوَسِيلَةَ وَجَٰهِدُوا۟ فِى سَبِيلِهِۦ لَعَلَّكُمْ تُفْلِحُونَ ۝٣٥
سورة المائدة""";
  static const String subtitleTwentyFivePageSeventeen_2 = """
️لابد من وسيلة تتقرب بها إلى الله
  """;
  static const String elmTextTwentyFivePageSeventeen_3 = """
أولاً طلب العلم
ثانياً أداء الفرائض وترك المحرمات 
ثالثاً طاعة الله في تفاصيل الشريعة 
رابعاً العمل الصالح بدءاً من إماطة الأذى عن الطريق، وانتهاءً بالدعوة إليه
 """;

  // pageEighteen
  // 1
  static const String elmTextTwentyFivePageEighteen_1 = """
️إن لم نعد لأعدائنا القوة لانفلح، ويصبح ديننا مضغة في الأفواه، يستهزأ بديننا، يستهزأ بعقائدنا، يستهزأ بنبينا لأننا ضعاف، ولو كنا أقوياء لعد الطرف الآخر ألف حساب وحساب لينال منا
 """;
  static const String ayahHadithTwentyFivePageEighteen_1 = """
وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ""";
  // 2
  static const String elmTextTwentyFivePageEighteen_2 = """
هذا الذي يوق شح نفسه من أفلح الفالحين، أما الذي يقع ضحية شح نفسه فهو من الهالكين 
شر الناس من يعيش فقيراً ليموت غنياً، شحيح يحرم نفسه كل خير، أندم الناس غني دخل ورثته بماله الجنة، ودخل هو بماله النار، جمع مالاً وفيراً، وورثه لأولاده، فاستقاموا على أمر الله بهذا المال، فدخلوا الجنة، ودخل هو النار بكسبه 
 """;
  static const String ayahHadithTwentyFivePageEighteen_2 = """
وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ""";
  // 3
  static const String elmTextTwentyFivePageEighteen_3 = """
حينما ينفق الإنسان الله جل جلاله يضاعفه له أضعافاً كثيرة، وهذه الحقيقة يعرفها المنفقون
  """;

  // pageNineteen
  // 1
  static const String ayahHadithTwentyFivePageNineteen_1 = """
وَمَن يُوقَ شُحَّ نَفْسِهِۦ فَأُو۟لَٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ""";
  static const String elmTextTwentyFivePageNineteen_1 = """
بين البخل والشح 
الحقيقة أن البُخل ان تبخل بمالك، أما الشُح أن تطمع في مال غيرك، أن تأخذ ما ليس لك، لذلك الإنسان الذي يأخذ ما ليس له هو عند الله شحيح، وهذا من أخطر الأمراض، لأن أكل المال الحرام مُدمِر 
  """;
  //2
  static const String ayahHadithTwentyFivePageNineteen_2 = """
يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱرْكَعُوا۟ وَٱسْجُدُوا۟ وَٱعْبُدُوا۟ رَبَّكُمْ""";
  static const String elmTextTwentyFivePageNineteen_2 = """
هذا إتصال بالله 
 """;
  // 3
  static const String ayahHadithTwentyFivePageNineteen_3 = """
وَٱفْعَلُوا۟ ٱلْخَيْرَ لَعَلَّكُمْ تُفْلِحُونَ""";
  static const String elmTextTwentyFivePageNineteen_3 = """
  الفلاح، والنجاح، والتفوق منوط في هذين الشيئين، الإتصال بالخالق والإحسان إلى الخلق 

️لا مخرج إلا بالتوبة
دائماً وأبداً الله سبحانه وتعالى يفتح باب التوبة، فما من شيءٍ يبُثُ الأمل في النفس أشد من أن الله سبحانه وتعالى جعل باب التوبة باب النجاة، فالتوبة صمام أمان، فإذا زاد الضغط على الإنسان تأتي التوبة صمام أمان، وإذا غرق الإنسان في ذنوبه تأتي التوبة حبل نجاة، وإذا أُحكِمَت عليه السبل كانت التوبة باب الخلاص، فكُلما ضاقت بك الأمور، وسُدت أمامك السبل فالله سبحانه وتعالى يفتح لك باب التوبة 
  """;
  // 4
  static const String ayahHadithTwentyFivePageNineteen_4 = """
فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحًۭا فَعَسَىٰٓ أَن يَكُونَ مِنَ ٱلْمُفْلِحِينَ""";
}
