class ElmTextDersTwentyNine {
  // Page 1
  static const String titleTwentyNinePageOne_1 = """
الطيران في الجنه
""";
  static const String textTwentyNinePageOne_1 = """
وأنا أقف جوار المنزل عند غروب الشمس، رفعت رأسي إلى السماء لأرى صقرًا يجنح بجناحيه يمينًا ويسارًا، وينطلق محلقًا لمسافة لا تبعد عني كثيرًا، ثم يعود بكل أريحية، ويبدو أنه مستمتع بما يفعله. وعندما كنت أحدق بعينيّ لأرى أين ينتهي به المطاف، وأتمنى أن أطير مثله، كان لسان حالي يقول: هل ياترى سيتحقق هذا الحلم وهذه الأمنية إذا أكرمني ربي وأدخلني الجنة؟
""";

  // Page 2
  static const String textTwentyNinePageTwo_1 = """
وتحدثني نفسي: هل ياترى أهل الجنة يستطيعون الطيران؟
""";
  static const String ayahHadithTwentyNinePageTwo_1 = """
ولرد عليها بكل ثقة: وكيف لا؟ وربنا سبحانه وتعالى لا يعجزه شيء في الأرض ولا في السماء، وهو السميع العليم، وقد وعدنا بذلك في سورة فصلت بقوله: {ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون}. ومن أوفى بعهده من الله؟!
""";

  // Page 3
  static const String textTwentyNinePageThree_1 = """
في تلك اللحظات المملوءة بأجواء حماسية وشوق ولهفة لجنة عرضها كعرض السماء والارض، طار بي عقلي المشغوف إلى جنة الفردوس الأعلى ونعيمها الدائم الذي لا ينقطع، حيث الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين، وحسن أولئك رفيقًا.
""";
  static const String textTwentyNinePageThree_2 = """
طاف بي عقلي في رياض الجنة بكل درجاتها، ومنها:
""";

  // Page 4
  static const String textTwentyNinePageFour_1 = """
جنة المأوى، حيث هناك من خاف مقام ربه ونهى النفس عن الهوى.
""";
  static const String textTwentyNinePageFour_2 = """
وجنات النعيم، حيث السابقون بفعل الخيرات في الدنيا، السابقون بدخول الجنة في الآخرة، المقربون في جنات النعيم على سرر موضونة، متكئين عليها متقابلين،
""";

  // Page 5
  static const String textTwentyNinePageFive_1 = """
حيث يوجد ثلة من الأولين وقليل من الآخرين، يطوف عليهم ولدان مخلدون بأكواب وأباريق، وكأس من معين وفاكهة مما يتخيرون، ولحم طير مما يشتهون، وحور عين كأمثال اللؤلؤ المكنون.
""";

  // Page 6
  static const String textTwentyNinePageSix_1 = """
وحيث أصحاب اليمين في سدر مخضود وطلح منظود وظل ممدود، وماء مسكوب وفاكهة كثيرة لا مقطوعة ولا ممنوعة، وفرش مرفوعة حيث يوجد عباد الله المخلصين على سرر متقابلين، يطاف عليهم بكأس من معين بيضاء، لذة للشاربين، وعندهم قاصرات الطرف عين كأنهن بيض مكنون.
""";

  // Page 7
  static const String textTwentyNinePageSeven_1 = """
لأرى نفسي بعين عقلي مع المتقين من الأهل والأحباب في جنات ونهر، في مقعد صدق عند مليك مقتدر، المقعد الحقيقي الذي لا يزول.
""";
  static const String textTwentyNinePageSeven_2 = """
لأرى نفسي متكئًا مع الأبرار من الأهل والأحباب في عليين، وهم على الأرائك، ينظرون، تعرف في وجوههم نظرة النعيم، يسقون من رحيق مختوم ختامه مسك.
""";

  // Page 8
  static const String textTwentyNinePageEight_1 = """
لأرى نفسي مع كل من خاف مقام ربه، متكئين على فرش بطائنها من استبرق وجنى الجنتين، دان مع من يشربون من كأس كان مزاجها كافورًا، ويطاف عليهم بآنية من فضة وأكواب كانت قواريرا، ويسقون فيها كأسًا كان مزاجها زنجبيلا.
""";

  // Page 9
  static const String textTwentyNinePageNine_1 = """
تمنيت في تلك اللحظات الممتعة أن أطير في تلك الأجواء الرائعة التي لا فيها شمس ولا زمهرير، ونشوة تغمرني من رأسي إلى أسفل قدمي، تركتهم لأحلّق قليلاً فوق مملكتي التي أنعم الله علي بها، وانطلقت بسرعة كسرعة هذا الصقر أو أكثر قليلًا.
""";

  // Page 10
  static const String textTwentyNinePageTen_1 = """
ومع أن المسافة بعيدة ولا تقاس بمسافات الدنيا، لكن بمشيئة الله، وبعد أن ألهمني الله أن أقول: سبحانك اللهم، فهي العملة المتداولة في الجنة، لأرى نفسي قد وصلت إلى آخر مكان من مملكتي التي منّ الله علي بها، نزلت دون أن أشعر بأي تعب أو إعياء.
""";

  // Page 11
  static const String textTwentyNinePageEleven_1 = """
لأرى نفسي بين أشجار مثمرة، وعينان نضّختان، وفاكهة ونخل ورمان، وقاصرات الطرف كأنهن الياقوت والمرجان.
""";
  static const String textTwentyNinePageEleven_2 = """
ورأيت أشياء جميلة مختلفة تمامًا عن ما رأيت عند أول دخولي للجنة من بساتين وأشجار وأنهار وغرف يُرى باطنها من ظاهرها وظاهرها من باطنها، وخيرات حسان، حور مقصورات في الخيام.
""";

  // Page 12
  static const String textTwentyNinePageTwelve_1 = """
تأملّت قليلاً، وشعرت بسكينة وراحة بال وطمأنينة، وتذكرت أنني تركت زوجتي الغالية في خيمتها مع حور العين، وقد من الله عليها بأن جعلها الأميرة عليهن بعملها الصالح، وتمنيت في تلك اللحظة أن تكون معي.
""";
  static const String textTwentyNinePageTwelve_2 = """
ولمجرد أن قلت: سبحانك اللهم، فإذا بي أنظر عن يميني لأراها إلى جانبي في الحال.
""";

  // Page 13
  static const String textTwentyNinePageThirteen_1 = """
اشتقت كذلك لأودي الأعزاء وبناتي الغاليات، ولمجرد أن تمنيت أن أراهم، فإذا بهم أمام عيني.
""";
  static const String textTwentyNinePageThirteen_2 = """
حينها تذكرت قوله سبحانه وتعالى ووعده: والذين آمنوا واتبعتهم ذرياتهم بإيمان الحقنا بهم ذرياتهم.
""";

  // Page 14
  static const String textTwentyNinePageFourteen_1 = """
وما كنت أفكر فيه أيضًا، وما كان يحيرني هو: هل هذه هي الغرف التي أخبرنا الله عنها في سورة الفرقان بأنها لعباد الرحمن، وذكر لنا صفاتهم بالتفصيل؟
""";
  static const String textTwentyNinePageFourteen_2 = """
أو التي أخبرنا عنها نبينا وحبيبنا محمد ﷺ بأنها لمن الان الكلام و أطعم الطعام وصلى في الليل والناس نيام؟
""";
  static const String textTwentyNinePageFourteen_3 = """
أو هذه الشجرة هي طوبى التي أخبرنا عنها بأنها لمن شغله عيبه عن عيوب الناس؟
""";
  static const String textTwentyNinePageFourteen_4 = """
أم هي لمن رأى في صحيفته استغفارًا كثيرًا؟
""";

  // Page 15
  static const String textTwentyNinePageFifteen_1 = """
وهذه الفواكه التي أخبرنا الله عنها في سورة المرسلات، كل ذلك لم يكن من نسج الخيال في لحظة تأمل وتفكر وحوار مع نفسي المذنبة المقصرة، المتعلقة بحبل رحمة الله والمؤملة بكرمه ورأفته سبحانه وتعالى، ولكنها وعود قرأتها في كتاب الله الذي لا يخلف وعوده.
""";
  static const String ayahHadithTwentyNinePageFifteen_1 = """
والقائل: {وإذا رأيت ثم رأيت نعيماً وملكا كبيراً}.
""";

  // Page 16
  static const String textTwentyNinePageSixteen_1 = """
ولأنه نعيم لا يمكن وصفه وملك عظيم لا يدانيه ملك، لم ولن أستطع تخيله على حقيقته.
""";
  static const String textTwentyNinePageSixteen_2 = """
ومع هذا لم أقتنع بكل ذلك الملك الذي قرأته في كتاب الله، ولكن نفسي كانت تواقة لتبحر وتتعمق في تفاصيل ما أخبرنا به ربنا سبحانه وتعالى على لسان نبينا ﷺ، من كل ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر.
""";

  // Page 17
  static const String textTwentyNinePageSeventeen_1 = """
عندها صحوت من حلم اليقظة الجميل، لأن ما أريد أن أفكر فيه أكبر من حجم عقلي، ولا يمكن لعقل بشر أن يستطيع تخيله.
""";
}
