class ElmTextDersTen {
// page 1
  static const String titleTenOne = """
 والذين جاهدو فينا
---------------
""";

  static const String elmTexTenOne_1 =
      """ طاقته ، نشاطه ، تفكيره ، وقته ، خبرته ، علمه ، عضلاته ، كل شيئ يملكه أنفقه في سبيل الله ، بذل غاية الجهد ، بذل كل مايملك فينا في سبيلنا في سبيل معرفتنا في سبيل طاعتنا في سبيل التقرب إلينا في سبيل نيل رضائنا

""";

  static const String ayahHadithTenOne_1 = """
 وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا 
""";

  static const String elmTextTenOne_2 = """

وقته، إمكاناته، ماله، صحته، مكانته، وجاهته، ذكائه، معلوماته، كل عضلاته، كل خبراته، علمه، وحرفته، كل شيئ بذله رخيصآ في سبيل الله، في سبيل معرفتنا، في سبيل طاعتنا، في سبيل التقرب إلينا، في سبيل نيل رضائنا
   """;

  static const String ayahHadithTenOne_2 = """
وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩
سورة العنكبوت """;

  static const String elmTextTenOne_3 = """

هؤلاء الله عز وجل يطمئنهم، لا بد من أن تصلو إلينا، لا بد من أن نعينكم على طاعتنا، لابد أن نعينكم على بلوغ رضائنا
""";

// page 2
  static const String ayahHadithTenTwo_1 = """
وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩ 
""";

  static const String elmTextTenTwo_1 = """
أبشروا، سبلنا هي السبل الموصلة إلينا، سبيل الطاعة، سبيل الرضوان، سبيل الجنه، سبيل السعاده، سبيل السلم، أن تكون في سلام مع الله، ومع الناس، سبيل الحمد، هذه السبل كلها لله، والسبل إلى الله كثيرة، سبيل لطاعته، سبيل لتقواه، سبيل لمرضاته، سبيل للفوز بجنته، سبيل لمحبةأنبيائه ورسله، سبيل لأن تسعد بقربه

""";

// page 3
  static const String titleTenThree_1 = """
معية الله للمحسنين 
--------------
""";

  static const String ayahHadithTenThree_1 = """
وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩ 
""";

  static const String elmTextTenThree_1 = """
هذه معيه خاصه، وهذه المعيه الخاصه ثمنها ان تكون محسنآ مع من ؟ مع كل الخلق، بقولك محسن، بعملك محسن، بحرفتك محسن، بوظيفتك محسن، بتجارتك محسن، بصناعتك محسن، بكل شيئ تفعله، في بيتك محسن، مع جيرانك محسن، مع الخلق كلهم محسن معهم
   """;

  static const String ayahHadithTenThree_2 = """

وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩ 
سورة العنكبوت 

""";

  static const String elmTextTenThree_2 = """
ومن السذاجه والغباء، وضيق العقل والحمق ان تظن ان معيةالله تنالها بلا ثمن أو بثمن بخس
 """;

// page 4
  static const String ayahHadithTenFour_1 = """
:قال تعالى 
 وَقَالَ ٱللَّهُ إِنِّی مَعَكُمۡۖ لَئِنۡ أَقَمۡتُمُ ٱلصَّلَوٰةَ وَءَاتَیۡتُمُ ٱلزَّكَوٰةَ وَءَامَنتُم بِرُسُلِی وَعَزَّرۡتُمُوهُمۡ وَأَقۡرَضۡتُمُ ٱللَّهَ قَرۡضًا حَسَنࣰا 
 سورة المائدة 

""";

  static const String elmTextTenFour_1 = """
هذه معية الله عز وجل، فالإنسان لا يطمع بمعيةالله بلا ثمن أو بثمن بخس سخيف، الا إن سلعةالله غالية، وطلب الجنه من دون عمل ذنب من الذنوب
 """;

// page 5
  static const String ayahHadithTenFive_1 = """

وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩

""";

  static const String elmTextTenFive_1 = """
هذه الأيه بشاره لكل محسن
والله اللذي لا إله إلا هو، هذه الايه وحدها فيها بشاره كبيره لكل مؤمن، أيها المؤمن: مادام همك ان تعرفنا، مادام همك أن تطيعنا، مادام همك أن تتقرب إلينا، مادام همك أن تبذل كل شيئ من أجلنا، فأبشر، فإنك سوف تصل إلينا، وتهتدي إلى سعادتك وجنتك، ومعيةالله عز وجل ثمنها أن تكون محسنا
""";

  static const String ayahHadithTenFive_2 = """
وَلَمَّا بَلَغَ أَشُدَّهُۥۤ ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰاۚ وَكَذَ ٰلِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ ۝٢٢
سورة يوسف 

---------------------
  """;

// page 6
  static const String elmTextTenSix_1 = """
يجب أن تكون محسنا، يجب أن يفتقدك الناس إذا غبت عنهم، إذا دخلت البيت يجب أن يكون عند اولادك عيد، لأنك محسن، فإذا كنت قاسيا عليهم، فإذا كنت بخيلا يتوخى الأولاد أن لا تكون بينهم، فكن محسنآ في عملك، في دائرتك، في متجرك، في مصنعك، في دكانك، في زراعتك، في أي شيء، محسن مع الوالدين، مع الزوجة، مع الأقارب، مع الجيران
""";

  static const String ayahHadithTenSix_1 = """
 وَٱلَّذِینَ جَـٰهَدُوا۟ فِینَا 
 سورة العنكبوت 
 ---------------------
 """;

  // page 7
  static const String elmTextTenSeven_1 = """
بذلوا كل جهدهم، كل طاقتهم، كل علمهم، كل خبرتهم، كل عضلاتهم، كل وقتهم، كل شبابهم فينا، من أجل معرفتنا وطاعتنا والتقرب إلينا
""";
  static const String ayahHadithTenSeven_1 = """
لَنَهۡدِیَنَّهُمۡ سُبُلَنَاۚ  

""";

  static const String elmTextTenSeven_2 = """
سبل السعادة والسلام، والأمن والراحة والرضوان، والفوز والنجاح والفلاح
""";

  static const String ayahHadithTenSeven_2 = """
 وَإِنَّ ٱللَّهَ لَمَعَ ٱلۡمُحۡسِنِینَ ۝٦٩ 
 سورة العنكبوت 

""";

  static const String elmTextTenSeven_3 = """
هذه الأية تكفي كل مؤمن، ولتكن في قلبه دائمآ، ولتكن في ذهنه دائما
 ---------------------
   """;
}
