class ElmTextDersTwo {
  // TwoOne
  static const String titleTwoOne_1 = """
العلم والمعرفة
-------------
""";
  static const String ayahHadithTwoOne_1 = """
وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧ 
الأنعام 37 
""";
  static const String elmTextTwoOne_1 = """
انت مع من؟ 
اذا كان اكثرهم لا يعلمون فانت مع من ؟ مع الاكثريه ام مع الاقليه ؟
""";

  // TwoTwo
  static const String ayahHadithTwoTwo_1 = """
قال تعالى 
وَمَا یَتَّبِعُ أَكۡثَرُهُمۡ إِلَّا ظَنًّاۚ 
يونس 36 
قال تعالى 
وَإِن تُطِعۡ أَكۡثَرَ مَن فِی ٱلۡأَرۡضِ یُضِلُّوكَ عَن سَبِیلِ ٱللَّهِۚ
الانعام 116
""";
  static const String elmTextTwoTwo_1 = """
فهل يقبل منك ان تقول هكذا شأن الناس كلهم يااخي ، وانا واحد من الناس ، هكذا التقاليد الان ، هكذا العادات ، هكذا ماتعارف عليه الناس ، هكذا نشأنا يااخي ، هكذا العادات ، هكذا التقاليد ، كل الناس مخطؤن 
""";

  // TwoThree
  static const String ayahHadithTwoThree_1 = """
اقرأ قوله تعالى 
وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧
الأنعام 37 
""";
  static const String elmTextTwoThree_1 = """
يعلمون التجاره والصناعه، والزراعه، وكسب المال وانتهاز الفرص ، واصول الحياة ، وكيف يتنعمون بها ، وكيف يشترون الاجهزه المتنوعه في البيت ، هذا كله يعرفونه ، ولكنهم يجهلون المصير ، يجهلون ساعةيوم يقوم الناس لرب العالمين ، فالعبره ان تعرف الحقيقه كلها لا ان تعرف شطرها 
""";

  static const String ayahHadithTwoThree_2 = """
قال تعالى 
یَعۡلَمُونَ ظَـٰهِرࣰا مِّنَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَهُمۡ عَنِ ٱلۡءَاخِرَةِ هُمۡ غَـٰفِلُونَ ۝٧
الروم 7 
""";
  static const String elmTextTwoThree_2 = """
قد تلتقي بدكتور يحمل شهادة بورد ، ومع ذلك لايعلم عن الاخره شيئا ، يعيش لحظته ، يعيش حياته الدنيا ، لايستطيع أن يفكر ابعد من الموت ، وكانه يضن الموت نهاية الحياه ، ولا شيئ بعد الموت ، هذا ليس علما ، هذه حرفه ، وليس علما ، العلم ان تعرف الحقيقه كلها من كل جوانبها 
""";

  static const String ayahHadithTwoThree_3 = """
قال تعالى 
وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ ۝٣٧
الانعام 37 
""";
  static const String elmTextTwoThree_3 = """
لذلك لا تستانس اذا كان الناس جميعا في ضلال يقول لسان حالك انا مثل هؤلاء الناس 
""";

  // TwoFour
  static const String elmTextTwoFour_1 = """
قد تجد عظماء في بيئات متخلفه ، وعلماء في بيئات جاهله ، والانسان اذا اختار شيئاً لن يقف شيئ في طريقه ، وان القرار اللذي يتخذه الانسان في شان مصيره قلما تنقضه الايام إذا كان صادرا حقا عن إراده وإيمان
إنك إذا اردت ان تكون مستقيما في هذا الزمان كنت كذلك ، وكلمة لا استطيع كلمه مضحكه ، لانك قد تفعل اشياء اخرى تبدو مستحيله ، ولكنك بتصميمك عليها فعلتها ، ولو انك صممت على ان تكون مستقيمآ لبلغت الاستقامه ، لو صممت على ان تعرف كتاب الله لعرفته ، لو صممت على ان تصلي قيام الليل لصليته
هذا اللذي لا يعرف إلا الطعام والشراب وكسب المال والإنغماس في الشهوات هذا ميت 
""";

  static const String ayahHadithTwoFour_1 = """
قال تعالى 
أَمۡوَ ٰتٌ غَیۡرُ أَحۡیَاۤءࣲۖ 
النحل 21 
""";
  static const String elmTextTwoFour_2 = """
وهذا اللذي عرف ربه ، واحبه ، واقبل عليه ، وتقرب إليه ، وجعل حياته كلها في طاعته ، وجعل طاقاته كلها مسخره لخدمةعباده هذا الحي
لذلك يقول سيدنا علي 
ياكميل ، مات خزان المال وهم احياء
والعلماء باقون مابقي الدهر 
 اعيانهم مفقوده 
  وامثالهم في القلوب موجوده
كن عالما ، او متعلما ، او مستمعا ، او محبا
ويظل المرء عالما ماطلب العلم ، فإذا ضن انه قد علم فقد جهل
""";

  // TwoFive
  static const String elmTextTwoFive_1 = """
الحياة متعبه ، فيها مزالق وفيها مواقف حرجه  وفيها متاهات ، فيها ظنون ، وفيها فساد ، فإن لم يعتصم الإنسان بالإيمان الصحيح فسوف يضيع مع الناس ، سوف تنزلق قدمه ، سوف تزل قدمه ، وتهوي به في مكان سحيق
""";
  static const String elmTextTwoFive_2 = """
وبالعلم لاتبقى لدى المؤمن وسوسه ، ولا هم ، ولا حزن ، ولا ضيق ، ولا قلق ، ولا يأس ، ولا شيء من هذا القبيل ، هذا التمزق الداخلي ، انفصام الشخصيه ، الخور ، الضعف ، الخنوع ، هذه الامراض اللتي فتكت بالناس ، ونحن مع ماعندنا من ايمان ، مع قرائتنا لكتاب الله في نعمة كبيره 
إن قارئ القرآن لا يحزن ، فلا يمكن ان تحزن إذا قرات القرآن بشكل صحيح وفهم لآياته واضح ، إذا كنت تقرؤه ، وتعقله ، وتفهمه ، وتطبقه ، لايمكن ان تحزن 
""";
  static const String ayahHadithTwoFive_1 = """
قال تعالى 
فَإِنَّكَ بِأَعۡیُنِنَاۖ
الطور 48 
""";
  static const String elmTextTwoFive_3 = """
مع قرائتنا لكتاب الله وفهمه الفهم الصحيح يقوى الايمان ، ومن علامات الايمان التوكل على الله ، والتفويض لأمر الله ، والتسليم لقضاء الله ، والرضا بقضاءالله ، توكل ، وتفويض ، وتسليم ، ورضا
""";
  static const String ayahHadithTwoFive_2 = """
قالو لأبي الدرداء *
يا أبا الدرداء لقد احترق دكانك ، قال : ماكان الله ليفعل ، يا أبا الدرداء لقد احترق دكانك ، قال: ماكان الله ليفعل ، إلى ان جاءه الخبر الصحيح ، لم يحترق دكانك ، قال: اعلم ذلك  فهو مطمئن ، فقد فوض امره إلى الله سبحانه ، وتوكل عليه ، ثم غادر دكانه ، فكان الله خليفته في حفظ دكانه
""";
  static const String elmTextTwoFive_4 = """
وإذا امنت بالله ورسوله يؤتك كفلين من رحمته  اي ضمانه في الدنيا وضمانه في الآخره ، ويجعل لك نورا تمشي به في الناس ، يريك الخير من الشر
""";

  // TwoSix
  static const String elmTextTwoSix_1 = """
الإنسان بلا علم كالبهيمه تماما ، الإنسان بلا علم إلى أن يكون حيواناً أقرب منه من أن يكون إنساناً، يأكل ، ويشرب ، وينام ، ويعطي نفسه ماتشتهي ، ويتكلم مايحلو له ، فيؤذي ويفرق ، ويخرب البيوت، وهو لايدري ماذا يفعل ، يتمحور حول ذاته ، يجر الأمور نحو مصلحته، يعيش على أنقاض الآخرين، يبني مجده على رفاتهم، يبني غناه على فقرهم، يبني سعادته على شقائهم، يبني حياته على موتهم، يبني أمنه على قلقهم، الإنسان من دون علم ومن دون هدى يدمر نفسه، ويدمر مجتمعه، يدمر ذاته، ويدمر الآخرين، لا تعنيه إلا ذاته 
""";
  static const String elmTextTwoSix_2 = """
احيانا تصاب النفس بالقلق، تصاب بالخوف، تصاب بالشعور بالقهر احيانا
إن هذه الأحاسيس المدمره، هذه المشاعر المقلقه، وهذا الإختلال في توازن الإنسان، هذا كله سببه الجهل، يأتي القرآن فيطمئن، نضرب على هذا امثله كثيره
""";
  static const String ayahHadithTwoSix_1 = """
قال تعالى 
مَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَلَنُحۡیِیَنَّهُۥ حَیَوٰةࣰ طَیِّبَةࣰۖ وَلَنُجۡزِیَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُوا۟ یَعۡمَلُونَ ۝٩٧
النحل 97 
""";
  static const String elmTextTwoSix_3 = """
هذا نص قرأني، هذا كلام رب العالمين، يجب ان يبدد هذا الكلام كل خوف، كل قلق، كل شعور بالمستقبل المظلم، يجب ان يبدد هذا القول وهو كلام رب العالمين كل شعور بالظلم، كل شعور بأن الحياة تحتاج إلى إنسان شرس، إلى إنسان قوي ..لا 
""";
  static const String ayahHadithTwoSix_2 = """
مَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُم بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ
[النحل: 97]
أَمۡ حَسِبَ ٱلَّذِینَ ٱجۡتَرَحُوا۟ ٱلسَّیِّءَاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَوَاۤءࣰ مَّحۡیَاهُمۡ وَمَمَاتُهُمۡۚ سَاۤءَ مَا یَحۡكُمُونَ ۝٢١
الجاثية 21 
""";
  static const String elmTextTwoSix_4 = """
انتهى الامر الله عز وجل يعجب ! أيعقل ياعبادي ان اعامل المسيئ كالمحسن؟! ان اعامل من عرفني كمن لا يعرفني ؟ ايعقل هذا ؟ 
""";

  // TwoSeven
  static const String titleTwoSeven_1 = """
وقفة
-----
""";
  static const String ayahHadithTwoSeven_1 = """
وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدۡرِهِۦ
""";
  static const String elmTextTwoSeven_1 = """
أي ماعظموه حق تعظيمه، ما عرفوه حق معرفته، كل اخطائهم، وكل شركهم، وكل إنحرافهم، وكل معاصيهم بسبب نقص معرفتهم

حقيقة تقول: نقص المعرفه يقابله إنحراف السلوك، ما من سلوك منحرف، ما من إنسان وقع في مخالفات، ما من إنسان قصر في أداء واجب، ما من إنسان وقع فيما حرم الله إلا بسبب نقص معرفته، فهناك علاقة طردية بين العلم وبين السلوك
""";

  // TwoEight
  static const String titleTwoEight_1 = """
وقفة
---
️النشاط العقلي والنفسي والسلوكي 
""";
  static const String elmTextTwoEight_1 = """
لا بد لك من نشاط عقلي، ونشاط نفسي، ونشاط سلوكي، فالنشاط العقلي يعني أن هذا العقل غذاؤه العلم، لا بد من طلب العلم، لا بد من تفكر في خلق السماوات والأرض، لا بد من نظر في افعال الله عز وجل، لا بد من تلاوة القرآن، لا بد من فهمه، إنه كتابنا الأول، هذا جانب عقلي 
""";
  static const String subtitleTwoEight_1 = """
الجانب النفسي: لا بد من ذكر الله 
""";
  static const String ayahHadithTwoEight_1 = """
الا بذكر الله تطمئن القلوب 
""";
  static const String subtitleTwoEight_2 = """
الجانب السلوكي: لا بد من استقامة على أمر الله 
""";
  static const String ayahHadithTwoEight_2 = """
فاستقم كما أمرت ومن تاب معك 
""";

  // TwoNine
  static const String titleTwoNine_1 = """
️قد ينسى المرء بعض العلم بالمعصية 
""";
  static const String elmTextTwoNine_1 = """
شكوت إلى وكيعٍ سؤ حفظي 
فارشدني إلى ترك المعاصي 
وأنبأني بأن العلم نورٌ 
ونور الله لا يُهدى لعاصي 

لاتُعصه في النهار، يوقظك في الليل، قد ينسى المرء بعض العلم بالمعصية فالمعاصي تُنسي، فكتاب الله عز وجل مهما يكون واضحاً لديك، إذا خالفتهُ تنساهُ، وتصبح في حجاب عنه
""";

  // TwoTen
  static const String titleTwoTen_1 = """
️أصول مهمة 
""";
  static const String elmTextTwoTen_1 = """
أصل الدين معرفة الله 
وأصل العبادة معرفة الشرع 
وأصل صلاح الدنيا معرفة طبائع الأشياء 
فهذه العلوم المادية التي إذا ذُكرت ظنها الناس هي العلم ولا علم سواها؛ الرياضيات، والفيزياء، والكيمياء، والفلك، وعلم النفس، وعلم الإجتماع، يظُن الناس أن هذه العلوم وحدها هي العلم، هذه بعض أنواع العلم، هذا علمٌ بالخليقة، وهناك علمٌ بالشريعة، هناك علمٌ بالحقيقة، هناك علمٌ بالله، هناك علمٌ بأمره، هناك علمٌ بخلقه، هذه العلوم المادية المحسوسة التجريبية يمكن أن ترفع مستوى معيشتنا، يمكن أن تطوع لنا الحديد، يمكن أن تختصر لنا الزمن، يمكن أن تقرب المكان، ولكنها لا تسعدنا، لا يمكن أن تسعدنا لأنها حرفةٌ من الحرف، أما العلم الذي يسعدك فهو العلم بالله عز وجل 

️إذا أردت الدنيا فعليك بالعلم، وإذا أردت الآخرة فعليك بالعلم، وإذا أردتهما معاً فعليك بالعلم، والعلم لا يعطيك بعضه إلا اذا أعطيته كلك، فإذا أعطيته بعضك لم يعطك شيئاً، ويظل المرء عالماً ما طلب العلم، فإذا ظن أنه قد علم فقد جهل 

️طالب العلم يؤثر الآخرة على الدنيا فيربحهما معاً، بينما الجاهل يؤثر الدنيا على الآخرة فيخسرهما معاً
""";
}
